/*
SQLyog Community Edition- MySQL GUI v7.14 
MySQL - 5.1.67-0ubuntu0.10.04.1 : Database - md_0_9_0b
*********************************************************************
*/

/*!40101 SET NAMES utf8 */;

/*!40101 SET SQL_MODE=''*/;

/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;

CREATE DATABASE /*!32312 IF NOT EXISTS*/`md_0_9_0b` /*!40100 DEFAULT CHARACTER SET latin1 */;

USE `md_0_9_0b`;

/*Table structure for table `admin_users` */

DROP TABLE IF EXISTS `admin_users`;

CREATE TABLE `admin_users` (
  `ID` tinyint(3) unsigned NOT NULL AUTO_INCREMENT,
  `NAME` varchar(100) NOT NULL DEFAULT '',
  `LOGIN` varchar(100) NOT NULL DEFAULT '',
  `PASSWORD` varchar(100) NOT NULL DEFAULT '',
  `EMAIL` varchar(100) NOT NULL DEFAULT '',
  `COMMENTS` text,
  `ACCESS` text,
  `PRIVATE` tinyint(3) unsigned NOT NULL DEFAULT '0',
  `EMAIL_ORDERS` tinyint(3) unsigned NOT NULL DEFAULT '0',
  `EMAIL_INVENTORY` tinyint(3) unsigned NOT NULL DEFAULT '0',
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM AUTO_INCREMENT=2 DEFAULT CHARSET=utf8;

/*Data for the table `admin_users` */

insert  into `admin_users`(`ID`,`NAME`,`LOGIN`,`PASSWORD`,`EMAIL`,`COMMENTS`,`ACCESS`,`PRIVATE`,`EMAIL_ORDERS`,`EMAIL_INVENTORY`) values (1,'Administrator','admin','21232f297a57a5a743894a0e4a801fc3','webmaster@domain.com','','control_modules,control_access,master,cms_docs,news,statistic,newsletter,backup,edit_templates,newslist,saverestore,skins,settings,dateselect,thumb,footercode,holdingpage,dashboard,events,users,terminals,mediabrowser,player,commands,classes,history,locations,methods,properties,objects,pvalues,shoutbox,shoutrooms,jobs,btdevices,weather,usbdevices,app_mediabrowser,app_products,app_tdwiki,app_weather,layouts,scripts,rss_channels,languages,pinghosts,watchfolders,app_player,app_gpstrack,webvars,patterns,onewire,app_calendar,xray',0,0,0);

/*Table structure for table `app_nut_devices` */

DROP TABLE IF EXISTS `app_nut_devices`;

CREATE TABLE `app_nut_devices` (
  `ID` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `HOST` varchar(255) NOT NULL DEFAULT 'localhost',
  `PORT` int(10) unsigned NOT NULL DEFAULT '3493',
  `UPS` varchar(255) NOT NULL DEFAULT '',
  `USERNAME` varchar(255) NOT NULL DEFAULT '',
  `PASSWORD` varchar(255) NOT NULL DEFAULT '',
  `TITLE` varchar(255) NOT NULL DEFAULT '',
  `CMDNOTE` text NOT NULL,
  `SCRIPT_ID` int(10) NOT NULL DEFAULT '0',
  `CODE` text,
  `CHECK_LATEST` datetime DEFAULT NULL,
  `CHECK_NEXT` datetime DEFAULT NULL,
  `INTERVAL` int(10) NOT NULL DEFAULT '0',
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

/*Data for the table `app_nut_devices` */

/*Table structure for table `app_nut_params` */

DROP TABLE IF EXISTS `app_nut_params`;

CREATE TABLE `app_nut_params` (
  `ID` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `DEVICEID` int(10) NOT NULL DEFAULT '0',
  `TITLE` varchar(255) NOT NULL DEFAULT '',
  `NOTE` varchar(255) NOT NULL DEFAULT '',
  `VALUE` varchar(255) NOT NULL DEFAULT '',
  `LINKED_OBJECT` varchar(255) NOT NULL DEFAULT '',
  `LINKED_PROPERTY` varchar(255) NOT NULL DEFAULT '',
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

/*Data for the table `app_nut_params` */

/*Table structure for table `app_quotes` */

DROP TABLE IF EXISTS `app_quotes`;

CREATE TABLE `app_quotes` (
  `ID` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `BODY` text,
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM AUTO_INCREMENT=558 DEFAULT CHARSET=utf8;

/*Data for the table `app_quotes` */

insert  into `app_quotes`(`ID`,`BODY`) values (1,'﻿...Лучше знать лишнее, чем ничего не знать. Сенека\r');
insert  into `app_quotes`(`ID`,`BODY`) values (2,'...надо стараться выяснить - не кто знает больше, а кто знает лучше. Мишель Монтень\r');
insert  into `app_quotes`(`ID`,`BODY`) values (3,'<Размышляй о смерти!> - Кто говорит так, тот велит нам размышлять о свободе. Кто научился смерти, тот разучился быть рабом. Он выше всякой власти и уж наверное вне всякой власти. Сенека\r');
insert  into `app_quotes`(`ID`,`BODY`) values (4,'Бедность - уничтожение всех наших дарований. Я. Княжнин\r');
insert  into `app_quotes`(`ID`,`BODY`) values (5,'Бедные готовы отдать последнее здоровье ради денег, богатые - последние деньги ради здоровья. Равиль Алеев\r');
insert  into `app_quotes`(`ID`,`BODY`) values (6,'Без доброты невозможна истинная радость. Томас Карлейль\r');
insert  into `app_quotes`(`ID`,`BODY`) values (7,'Без пользы жить - безвременная смерть. И. Гете\r');
insert  into `app_quotes`(`ID`,`BODY`) values (8,'Без элемента неизвестности жизненная игра теряет смысл. Дж. Голсуорси\r');
insert  into `app_quotes`(`ID`,`BODY`) values (9,'Бездомность - это не то состояние, когда человеку не хватает для счастья кирпичей, скрепленных известкой, а то, когда человека никто не любит и не хочет видеть. Мать Тереза\r');
insert  into `app_quotes`(`ID`,`BODY`) values (10,'Берегите время: это - ткань, из которой сделана жизнь. Ричардсон\r');
insert  into `app_quotes`(`ID`,`BODY`) values (11,'Бессмертие души - в продолжении после смерти влияния человека на окружавший его мир, которое так же объективно, как влияние мира на живущего человека. В. Е. Михальцев\r');
insert  into `app_quotes`(`ID`,`BODY`) values (12,'Благодарение Богу за то, что я всегда желаю большего, чем могу достичь. Микеланджело Буонаротти\r');
insert  into `app_quotes`(`ID`,`BODY`) values (13,'Благодарность - признак благородства души. Эзоп\r');
insert  into `app_quotes`(`ID`,`BODY`) values (14,'Благоприятная возможность скрывается среди трудностей и проблем. Альберт Эйнштейн\r');
insert  into `app_quotes`(`ID`,`BODY`) values (15,'Благоразумный видит беду, и укрывается; а неопытные идут вперед и наказываются. Царь Соломон, Притчи\r');
insert  into `app_quotes`(`ID`,`BODY`) values (16,'Благородный муж живет в согласии со всеми, а низкий ищет себе подобных. Конфуций\r');
insert  into `app_quotes`(`ID`,`BODY`) values (17,'Благородный муж ни от кого не ожидает обмана, но когда его обманывают, он первый замечает это. Конфуций\r');
insert  into `app_quotes`(`ID`,`BODY`) values (18,'Благородный муж стойко переносит беды, а низкий человек в беде распускается. Конфуций\r');
insert  into `app_quotes`(`ID`,`BODY`) values (19,'Благотворение только тогда благотворение, когда оно жертва. Лев Николаевич Толстой\r');
insert  into `app_quotes`(`ID`,`BODY`) values (20,'Богат тот, кто считает себя таким с тем, что у него есть. Пьер Буаст\r');
insert  into `app_quotes`(`ID`,`BODY`) values (21,'Богатство от суетности истощается, а собирающий трудами умножает его. Царь Соломон, Притчи\r');
insert  into `app_quotes`(`ID`,`BODY`) values (22,'Боится презрения лишь тот, кто его заслуживает. Франсуа де Ларошфуко\r');
insert  into `app_quotes`(`ID`,`BODY`) values (23,'Боль, которую мы чувствуем, не пройдет никогда, но пережить ее нам поможет работа. Страдание не может ранить уставшего человека. Пауло Коэльо\r');
insert  into `app_quotes`(`ID`,`BODY`) values (24,'Большая ошибка мечтать о себе больше, чем следует, и ценить себя ниже, чем стоишь. Иоганн Вольфганг Гете\r');
insert  into `app_quotes`(`ID`,`BODY`) values (25,'Большинство людей перед смертью с ужасом обнаруживают, что они никогда по-настоящему не жили. Генри Дэвид Торо\r');
insert  into `app_quotes`(`ID`,`BODY`) values (26,'Большой талант всегда сопровождает великодушное сердце. Теофиль Готье\r');
insert  into `app_quotes`(`ID`,`BODY`) values (27,'Будь бережлив и готовься к завтрашнему дню. Эзоп\r');
insert  into `app_quotes`(`ID`,`BODY`) values (28,'Будь верен себе, и тогда столь же верно, как ночь сменяет день, последует за этим верность другим людям. Вильям Шекспир\r');
insert  into `app_quotes`(`ID`,`BODY`) values (29,'Будь всегда искренен, даже если у тебя на уме совсем другое. Гарри Трумэн\r');
insert  into `app_quotes`(`ID`,`BODY`) values (30,'Будь у героев время подумать, героизма вовсе бы не было. Питер Устинов\r');
insert  into `app_quotes`(`ID`,`BODY`) values (31,'Будьте внимательны к своим мыслям, - они начало поступков. Лао-Цзы\r');
insert  into `app_quotes`(`ID`,`BODY`) values (32,'Будьте самоучками - не ждите, чтобы вас научила жизнь. Ежи Лец\r');
insert  into `app_quotes`(`ID`,`BODY`) values (33,'Быть бедным плохо уже потому, что это занимает все ваше время. Виллем де Конинг\r');
insert  into `app_quotes`(`ID`,`BODY`) values (34,'Быть добрым очень легко, быть справедливым - вот что трудно. Гюго\r');
insert  into `app_quotes`(`ID`,`BODY`) values (35,'Быть разумной, будучи красивой - трудно, но быть при этом еще и доброй удается только редким... В. Е. Михальцев\r');
insert  into `app_quotes`(`ID`,`BODY`) values (36,'Быть слишком недовольным собой есть слабость, быть слишком довольным - глупость. Бернард Шоу\r');
insert  into `app_quotes`(`ID`,`BODY`) values (37,'Быть умным, означает делать большие деньги. Быть глупым - просто хотеть этого. Дж. К. Честертон\r');
insert  into `app_quotes`(`ID`,`BODY`) values (38,'В борьбе с соблазнительными мыслями бывает полезно искать общества людей более добродетельных, чем ты сам, или вспоминать поучения мудрых людей. Эпиктет\r');
insert  into `app_quotes`(`ID`,`BODY`) values (39,'В дружбе нет никаких иных расчетов и соображений, кроме нее самой. Монтень\r');
insert  into `app_quotes`(`ID`,`BODY`) values (40,'В жизни бывают времена, когда Бог требует от нас послушания. Но порой Он призывает нас к борьбе, чтобы испытать нашу волю. Пауло Коэльо\r');
insert  into `app_quotes`(`ID`,`BODY`) values (41,'В индустриальном веке все, что нам было нужно, - это хорошая работа. В Информационном веке нам понадобятся две профессии. Первая поможет нам делать деньги, а вторая - инвестировать их. Для получения второй профессии финансовая грамотность обязательна. Роберт Кийосаки\r');
insert  into `app_quotes`(`ID`,`BODY`) values (42,'В каждом положении отыщется что-нибудь утешительное, если хорошо поискать. Даниель Дефо\r');
insert  into `app_quotes`(`ID`,`BODY`) values (43,'В ревности больше самолюбия, чем любви. Франсуа де Ларошфуко\r');
insert  into `app_quotes`(`ID`,`BODY`) values (44,'В серьезных делах следует заботиться не столько о том, чтобы создавать благоприятные возможности, сколько о том, чтобы их не упускать. Франсуа де Ларошфуко\r');
insert  into `app_quotes`(`ID`,`BODY`) values (45,'В чем смысл жизни? Служить другим и делать добро. Аристотель\r');
insert  into `app_quotes`(`ID`,`BODY`) values (46,'Важно вовремя понять, что один этап твоей жизни подошел к концу. Если ты захочешь задержаться больше положенного срока, то лишишься радости и смысла жизни. И рискуешь быть наказанным Богом. - Господь суров. Пауло Коэльо\r');
insert  into `app_quotes`(`ID`,`BODY`) values (47,'Ваши желания соответствуют Вашему таланту. Ваши способности - это закономерная часть Вашего таланта. Ирина Чудова\r');
insert  into `app_quotes`(`ID`,`BODY`) values (48,'Вежливость - это желание всегда встречать вежливое обращение и слыть обходительным человеком. Франсуа де Ларошфуко\r');
insert  into `app_quotes`(`ID`,`BODY`) values (49,'Великая наука жить счастливо состоит в том, чтобы жить только в настоящем. Пифагор\r');
insert  into `app_quotes`(`ID`,`BODY`) values (50,'Великие дела вершатся не сверхусилиями, а упорством. Елена Петровна Блаватская\r');
insert  into `app_quotes`(`ID`,`BODY`) values (51,'Великие люди на отсутствие удачи не жалуются. Ральф Уолдо Эмерсон\r');
insert  into `app_quotes`(`ID`,`BODY`) values (52,'Великие мысли исходят из сердца. Люк де Клапье Вовенарг\r');
insert  into `app_quotes`(`ID`,`BODY`) values (53,'Великий человек идет впереди своего времени, умный идет рядом с ним, хитрый старается использовать его, глупый становится ему поперек дороги. Э. Бауэрнфельд\r');
insert  into `app_quotes`(`ID`,`BODY`) values (54,'Великодушного человека отличает то, что он не ищет выгоды для себя, но с готовностью делает добро другим. Аристотель\r');
insert  into `app_quotes`(`ID`,`BODY`) values (55,'Великое искусство творится самыми простыми средствами. Ле Карбюзье\r');
insert  into `app_quotes`(`ID`,`BODY`) values (56,'Величайшая красота, сила и богатство в действительности бесполезны; но доброе сердце превосходит все на свете. Бенджамин Франклин\r');
insert  into `app_quotes`(`ID`,`BODY`) values (57,'Величайшее добро, какое ты можешь сделать для другого, это не просто поделиться с ним своими богатствами, но и открыть для него его собственные богатства. Бенджамин Дизраэли\r');
insert  into `app_quotes`(`ID`,`BODY`) values (58,'Величайший грех человека - это не ненависть, а равнодушие к своим братьям. Мать Тереза\r');
insert  into `app_quotes`(`ID`,`BODY`) values (59,'Величие человека есть его способность мыслить. Паскаль\r');
insert  into `app_quotes`(`ID`,`BODY`) values (60,'Вера - это состояние разума, которого ты можешь достичь: нужно только очистить ум от плохого и приготовить его к восприятию хорошего. Владимир Довгань\r');
insert  into `app_quotes`(`ID`,`BODY`) values (61,'Вера есть знание смысла человеческой жизни, вследствие которого человек не уничтожает себя, а живет. Вера есть сила жизни. Если человек живет, то он во что-нибудь да верит. Если б он не верил, что для чего-нибудь надо жить, то он бы не жил. Л. Толстой\r');
insert  into `app_quotes`(`ID`,`BODY`) values (62,'Верь, чтобы понимать. Античный афоризм\r');
insert  into `app_quotes`(`ID`,`BODY`) values (63,'Видеть несправедливость и молчать - это значит, самому участвовать в ней. Ж. Ж. Руссо\r');
insert  into `app_quotes`(`ID`,`BODY`) values (64,'Вместо того, чтобы сетовать, что роза имеет шипы, я радуюсь тому, что среди шипов растет роза. Ж. Жубер\r');
insert  into `app_quotes`(`ID`,`BODY`) values (65,'Во всем, как хотите, чтобы с вами поступали люди, так поступайте и вы с ними, ибо в этом закон. Библия, Левит\r');
insert  into `app_quotes`(`ID`,`BODY`) values (66,'Во всяком творении гения мы узнаем собственные отвергнутые мысли. Ральф Уолдо Эмерсон\r');
insert  into `app_quotes`(`ID`,`BODY`) values (67,'Во сне мне привиделась действительность. С каким облегчением я пробудился. Ежи Лец\r');
insert  into `app_quotes`(`ID`,`BODY`) values (68,'Воздавать должное своим достоинствам наедине с собою столь же разумно, сколь смехотворно превозносить их в присутствии других. Франсуа де Ларошфуко\r');
insert  into `app_quotes`(`ID`,`BODY`) values (69,'Воля - это то, что заставляет тебя побеждать, когда твой рассудок говорит тебе, что ты повержен. Карлос Кастанеда\r');
insert  into `app_quotes`(`ID`,`BODY`) values (70,'Вопреки устоявшемуся мнению двоечники приходят к финишу первыми. Малькольм Форбс\r');
insert  into `app_quotes`(`ID`,`BODY`) values (71,'Воспитывайте детей, не делая им замечаний. Охраняйте детство от замечаний и упреков. Воспитание без замечаний - лучшее, что вы можете дать своим детям. С. Л. Соловейчик\r');
insert  into `app_quotes`(`ID`,`BODY`) values (72,'Вреднее всего желание предохранить себя от ошибок. Георг Вильгельм Фридрих Гегель\r');
insert  into `app_quotes`(`ID`,`BODY`) values (73,'Время укрепляет дружбу, но ослабляет любовь. Лабрюйер\r');
insert  into `app_quotes`(`ID`,`BODY`) values (74,'Все в руках человека! Поэтому их нужно мыть чаще. Ежи Лец\r');
insert  into `app_quotes`(`ID`,`BODY`) values (75,'Все жалуются на свою память, но никто не жалуется на свой разум. Франсуа де Ларошфуко\r');
insert  into `app_quotes`(`ID`,`BODY`) values (76,'Все можно отнять у человека, за исключением одного: последней частицы человеческой свободы - свободы выбирать свою установку в любых данных условиях, выбирать свой собственный путь. В. Франкл\r');
insert  into `app_quotes`(`ID`,`BODY`) values (77,'Все мы находимся за чертой бедности, только по разные ее стороны. Дж. Тодд\r');
insert  into `app_quotes`(`ID`,`BODY`) values (78,'Все мысли, которые имеют огромные последствия, всегда просты. Л. Толстой\r');
insert  into `app_quotes`(`ID`,`BODY`) values (79,'Все проходит... Чтобы жизнь сделать радостнее, старайся хорошее задерживать в памяти дольше, чем плохое. В. Е. Михальцев\r');
insert  into `app_quotes`(`ID`,`BODY`) values (80,'Все, что перестает удаваться, перестает и привлекать. Франсуа де Ларошфуко\r');
insert  into `app_quotes`(`ID`,`BODY`) values (81,'Всем нам, кем бы вы ни были - мясниками ли, пекарями или королями, восседающими на тронах, - всем нам нравятся люди, которые восхищаются нами. Дейл Карнеги\r');
insert  into `app_quotes`(`ID`,`BODY`) values (82,'Вспыльчивость - сплошной убыток. Японская поговорка\r');
insert  into `app_quotes`(`ID`,`BODY`) values (83,'Всю жизнь последовательно идти к цели можно, если она постоянно отодвигается. Ежи Лец\r');
insert  into `app_quotes`(`ID`,`BODY`) values (84,'Всякий гений носит маску. Ницше\r');
insert  into `app_quotes`(`ID`,`BODY`) values (85,'Всякое произведение гения неизбежно является результатом энтузиазма. Бенджамин Дизраэли\r');
insert  into `app_quotes`(`ID`,`BODY`) values (86,'Вторник и четверг - самые энергичные дни недели. А. И. Маренков\r');
insert  into `app_quotes`(`ID`,`BODY`) values (87,'Вы намного лучше, чем казались себе раньше. Пауло Коэльо\r');
insert  into `app_quotes`(`ID`,`BODY`) values (88,'Вы не сможете обменяться рукопожатиями со сжатыми в кулаки руками. Indira Gandhi\r');
insert  into `app_quotes`(`ID`,`BODY`) values (89,'Вы ослеплены золотом, сверкающим в доме богатых; вы, конечно, видите, что они имеют, но вы не видите, чего им недостает. Аврелий Августин\r');
insert  into `app_quotes`(`ID`,`BODY`) values (90,'Выбор! Выбор - это ключ ко всему. У вас есть возможности. Вы не обязаны проводить жизнь, погрязнув в неудачах, невежестве, горестях, бедности, стыде и жалости к себе. Можно жить лучше. Ог Мандино\r');
insert  into `app_quotes`(`ID`,`BODY`) values (91,'Выигравший никогда не скажет: <Это всего лишь игра>. Глория Коупленд\r');
insert  into `app_quotes`(`ID`,`BODY`) values (92,'Высшая ловкость состоит в том, чтобы всему знать истинную цену. Франсуа де Ларошфуко\r');
insert  into `app_quotes`(`ID`,`BODY`) values (93,'Обычно счастье приходит к счастливому, а несчастье - к несчастному. Ларошфуко\r');
insert  into `app_quotes`(`ID`,`BODY`) values (94,'Где есть уверенность, там кончается слепота. Гюго\r');
insert  into `app_quotes`(`ID`,`BODY`) values (95,'Гений есть терпение мысли, сосредоточенной в известном направлении. Ньютон\r');
insert  into `app_quotes`(`ID`,`BODY`) values (96,'Герой делает то, что можно сделать. Другие этого не делают. Ромен Роллан\r');
insert  into `app_quotes`(`ID`,`BODY`) values (97,'Главная жизненная задача человека - дать жизнь самому себе, стать тем, чем он является потенциально. Самый важный плод его усилий - его собственная личность. Э. Фромм\r');
insert  into `app_quotes`(`ID`,`BODY`) values (98,'Главное - мудрость: приобретай мудрость и всем имением твоим приобретай разум. Высоко цени ее, и она возвысит тебя. Царь Соломон, Притчи\r');
insert  into `app_quotes`(`ID`,`BODY`) values (99,'Главной опасностью в жизни является то, что вы предпринимаете слишком много мер предосторожности. Альфред Адлер\r');
insert  into `app_quotes`(`ID`,`BODY`) values (100,'Глупости свойственно видеть чужие пороки, а о своих забывать. Цицерон\r');
insert  into `app_quotes`(`ID`,`BODY`) values (101,'Говори правду, и тогда не прийдется ничего запоминать. Марк Твен\r');
insert  into `app_quotes`(`ID`,`BODY`) values (102,'Голые сучья, кажущиеся зимой спящими, тайно работают, готовясь к своей весне. Джалаледдин Руми\r');
insert  into `app_quotes`(`ID`,`BODY`) values (103,'Горе людям, не знающим смысла своей жизни. Паскаль\r');
insert  into `app_quotes`(`ID`,`BODY`) values (104,'Да не устанем мы, творя добро. Плутарх\r');
insert  into `app_quotes`(`ID`,`BODY`) values (105,'Давайте стараться жить так, чтобы, когда мы умрем, опечалился даже гробовщик. Марк Твен\r');
insert  into `app_quotes`(`ID`,`BODY`) values (106,'Даже лучшим людям свойственны эгоистические мысли. Гюго\r');
insert  into `app_quotes`(`ID`,`BODY`) values (107,'Дар принять тому, дано уменье, кто готов понять весь смысл даренья. Рабиндранат Тагор\r');
insert  into `app_quotes`(`ID`,`BODY`) values (108,'Делай все, что в твоих силах, чтобы жизнь других людей стала хоть немного лучше. Клод Денсон Пеппер\r');
insert  into `app_quotes`(`ID`,`BODY`) values (109,'Делай добро украдкой и стыдись выставлять его напоказ. Александр Поуп\r');
insert  into `app_quotes`(`ID`,`BODY`) values (110,'Делайте свою работу; но не только свою работу и ничего сверх, а чуть более того, - этим вы покажете щедрость, ибо сей малый избыток зачастую стоит большего, нежели все остальное. Дин Бриггс\r');
insert  into `app_quotes`(`ID`,`BODY`) values (111,'Демократия - это не власть большинства, а защита меньшинства. Камю\r');
insert  into `app_quotes`(`ID`,`BODY`) values (112,'Деньги потерять - ничего не потерять, время потерять - много потерять, энергию потерять - все потерять. Виньи\r');
insert  into `app_quotes`(`ID`,`BODY`) values (113,'Для себя человеку довольно одного верного друга; и то уже много, что удалось его сыскать. Но сколько бы ни было друзей, все мало, если хочешь помочь другим. Лабрюйер\r');
insert  into `app_quotes`(`ID`,`BODY`) values (114,'Для того чтобы быть свободным человеком, не следует желать зря всего того, что только придет в голову. Напротив, свободный человек должен выучиться желать и принимать все то, что с ним случается. Эпиктет\r');
insert  into `app_quotes`(`ID`,`BODY`) values (115,'Для успеха необходим досуг. Нужно время, которое безраздельно принадлежит только вам. Джордж Сорос\r');
insert  into `app_quotes`(`ID`,`BODY`) values (116,'До тех пор, пока человек не совладал с желанием, он не совладал ни с чем. Альбер Камю\r');
insert  into `app_quotes`(`ID`,`BODY`) values (117,'Добро - это не намерение действовать, а само действие. Дж. Фаулз\r');
insert  into `app_quotes`(`ID`,`BODY`) values (118,'Добродетель отважна, и добро никогда не испытывает страха. Вильям Шекспир\r');
insert  into `app_quotes`(`ID`,`BODY`) values (119,'Доброе желание извиняет и плохое исполнение. Вильям Шекспир\r');
insert  into `app_quotes`(`ID`,`BODY`) values (120,'Доброта не всегда вызывает ответную доброту, но зло обычно порождает зло. В. Е. Михальцев\r');
insert  into `app_quotes`(`ID`,`BODY`) values (121,'Доверия без правды не может быть так же, как правды без доверия. В. Е. Михальцев\r');
insert  into `app_quotes`(`ID`,`BODY`) values (122,'Доказательств дружбы и любви требует не любящий, а эгоист. Совпадение этих качеств часто, но вовсе не обязательно. В. Е. Михальцев\r');
insert  into `app_quotes`(`ID`,`BODY`) values (123,'Долготерпеливый лучше храброго, и владеющий собою лучше завоевателя города. Царь Соломон, Притчи\r');
insert  into `app_quotes`(`ID`,`BODY`) values (124,'Другом является такой человек, с которым я могу быть искренним. В его присутствии я могу думать вслух. Эмерсон\r');
insert  into `app_quotes`(`ID`,`BODY`) values (125,'Дружба - это такое святое, сладостное, прочное и постоянное чувство, что его можно сохранить на всю жизнь, если, конечно, не пытаться просить денег взаймы. Марк Твен\r');
insert  into `app_quotes`(`ID`,`BODY`) values (126,'Думать - самая трудная работа; вот, вероятно, почему этим занимаются столь не многие. Генри Форд\r');
insert  into `app_quotes`(`ID`,`BODY`) values (127,'Душа - отражение борьбы чувства и разума. В. Е. Михальцев\r');
insert  into `app_quotes`(`ID`,`BODY`) values (128,'Единственная награда за добродетель - это сама добродетель; единственный способ иметь друзей - самому быть другом. Ральф Уолдо Эмерсон\r');
insert  into `app_quotes`(`ID`,`BODY`) values (129,'Единственный способ определить границы возможного - выйти за эти границы, в невозможное. Артур Кларк\r');
insert  into `app_quotes`(`ID`,`BODY`) values (130,'Если Вы бросаете дело, не достигнув цели, то скорее всего Вы просто лентяй. Лентяй никогда не победит, а победитель не может быть ленивым. Наполеон Хилл\r');
insert  into `app_quotes`(`ID`,`BODY`) values (131,'Если бы рекламодатели тратили на улучшение своей продукции те деньги, которые они тратят на рекламу, их продукция не нуждалась бы в рекламе. Уилл Роджерс\r');
insert  into `app_quotes`(`ID`,`BODY`) values (132,'Если вас никто не любит, будьте уверены, - это ваша вина. Ф. Добридж\r');
insert  into `app_quotes`(`ID`,`BODY`) values (133,'Если вы достигнете вершин в том, чем занимаетесь, ничто не сможет помешать вам получать больше денег и быстрее продвигаться по службе. Дэн Кеннеди\r');
insert  into `app_quotes`(`ID`,`BODY`) values (134,'Если вы не довольны тем местом, которое вы занимаете, смените его! Вы же не дерево! Джим Рон\r');
insert  into `app_quotes`(`ID`,`BODY`) values (135,'Если вы требуете от кого-нибудь, чтобы он отдал свое время и энергию для дела, то позаботьтесь, чтобы он не испытывал финансовых трудностей. Генри Форд\r');
insert  into `app_quotes`(`ID`,`BODY`) values (136,'Если вы хотите, чтобы жизнь улыбалась вам, подарите ей сначала свое хорошее настроение. Бенедикт Спиноза\r');
insert  into `app_quotes`(`ID`,`BODY`) values (137,'Если дорога, по которой ты идешь, легка, значит это не твоя дорога. Автор неизвестен\r');
insert  into `app_quotes`(`ID`,`BODY`) values (138,'Если запастись терпением и проявить старание, то посеянные семена знания непременно дадут добрые всходы. Ученья корень горек, да плод сладок. Леонардо Да Винчи\r');
insert  into `app_quotes`(`ID`,`BODY`) values (139,'Если мысль нельзя выразить простыми словами, значит она ничтожна и надо ее отбросить. Л. Вовенарг\r');
insert  into `app_quotes`(`ID`,`BODY`) values (140,'Если не желаешь многого, то и немногое будет казаться тебе многим. Демокрит\r');
insert  into `app_quotes`(`ID`,`BODY`) values (141,'Если нет дальнейшего роста, значит, близок закат. Сенека\r');
insert  into `app_quotes`(`ID`,`BODY`) values (142,'Если потерпите неудачу - будете огорчены; если опустите руки - обречены. Биверли Силлз\r');
insert  into `app_quotes`(`ID`,`BODY`) values (143,'Если тебя интересует, любишь ли, спроси себя, о чем ты больше думаешь, вспоминая любимого человека, - о том, как мне с ним хорошо, или о том, как ему со мной хорошо. В. Е. Михальцев\r');
insert  into `app_quotes`(`ID`,`BODY`) values (144,'Если ты способен выдумать что-то, ты можешь и сделать это. Уолт Дисней\r');
insert  into `app_quotes`(`ID`,`BODY`) values (145,'Если ты хочешь перемену в будущем - стань этой переменой в настоящем. Махатма Ганди\r');
insert  into `app_quotes`(`ID`,`BODY`) values (146,'Если у ваших клиентов новых идей больше, чем у вас самих, или наймите их, или ищите другую работу. Кьелл А. Нордстрем & Йонас Риддерстрале, <Бизнес в стиле Фанк>\r');
insert  into `app_quotes`(`ID`,`BODY`) values (147,'Если у человека есть преданный друг - у него есть как бы две жизни для осуществления своих желаний. Фрэнсис Бэкон\r');
insert  into `app_quotes`(`ID`,`BODY`) values (148,'Если хотите иметь успех, Вы должны выглядеть так, как будто Вы его имеете. Томас Мор\r');
insert  into `app_quotes`(`ID`,`BODY`) values (149,'Если хочешь быть умным, научись разумно спрашивать, внимательно слушать, спокойно отвечать и перестань говорить, когда нечего больше сказать. Л. Н. Толстой\r');
insert  into `app_quotes`(`ID`,`BODY`) values (150,'Если хочешь, чтобы тебя любили, учись чувству меры. Эмерсон\r');
insert  into `app_quotes`(`ID`,`BODY`) values (151,'Если человек хочет прийти к самому себе, его путь лежит через мир. В. Франкл\r');
insert  into `app_quotes`(`ID`,`BODY`) values (152,'Если я рассуждаю логично, это значит только то, что я не сумасшедший, но вовсе не доказывает, что я прав. Иван Петрович Павлов\r');
insert  into `app_quotes`(`ID`,`BODY`) values (153,'Есть три рода невежества: совсем не знать ничего; знать дурно то, что все знают; знать не то, что следует знать. Дюкло\r');
insert  into `app_quotes`(`ID`,`BODY`) values (154,'Жалок тот ученик, который не превосходит своего учителя. Леонардо Да Винчи\r');
insert  into `app_quotes`(`ID`,`BODY`) values (155,'Желание - это тысяча возможностей, а нежелание - это тысяча причин! Автор неизвестен\r');
insert  into `app_quotes`(`ID`,`BODY`) values (156,'Железо ржавеет, не находя себе применения, стоячая вода гниет или на холоде замерзает, а ум человека, не находя себе применения, чахнет. Леонардо Да Винчи\r');
insert  into `app_quotes`(`ID`,`BODY`) values (157,'Живет свободно только тот, кто находит радость в исполнении своего долга. Цицерон\r');
insert  into `app_quotes`(`ID`,`BODY`) values (158,'Жизнь - загадка, которую надо уметь принять и не мучить себя постоянным вопросом: <В чем смысл моей жизни?>. Лучше самим наполнить жизнь смыслом и важными для вас вещами. П. Коэльо\r');
insert  into `app_quotes`(`ID`,`BODY`) values (159,'Жизнь - это процесс постоянного выбора. В каждый момент человек имеет выбор: или отступление, или продвижение к цели. Либо движение к еще большей боязни, страхам, защите, либо выбор цели и рост духовных сил. Выбрать развитие вместо страха раз десять в день - значит десять раз продвинуться к самореализации. А. Маслоу\r');
insert  into `app_quotes`(`ID`,`BODY`) values (160,'Жизнь имеет в точности ту ценность, которой мы хотим ее наделить. И. Бергман\r');
insert  into `app_quotes`(`ID`,`BODY`) values (161,'Жизнь на десять процентов состоит из того, что вы в ней делаете, а на девяносто - из того, как вы ее принимаете. Моэм\r');
insert  into `app_quotes`(`ID`,`BODY`) values (162,'Жизнь отдельного человека имеет смысл лишь в той степени, насколько она помогает сделать жизни других людей красивее и благороднее. А. Эйнштейн\r');
insert  into `app_quotes`(`ID`,`BODY`) values (163,'Жизнь соткана не из желаний, а из поступков каждого человека. Пауло Коэльо\r');
insert  into `app_quotes`(`ID`,`BODY`) values (164,'Жизнь. Понимаю ее все меньше и меньше и люблю ее все больше и больше! Ренар\r');
insert  into `app_quotes`(`ID`,`BODY`) values (165,'Жить нужно так, как если бы пришествие Христа ожидалось сегодня вечером. Джимми Картер\r');
insert  into `app_quotes`(`ID`,`BODY`) values (166,'Заботься об имени, ибо оно пребудет с тобою долее, нежели многие тысячи золота. Приписывается Иисусу\r');
insert  into `app_quotes`(`ID`,`BODY`) values (167,'Завтра ты будешь тем, о чем думаешь сегодня. Владимир Довгань\r');
insert  into `app_quotes`(`ID`,`BODY`) values (168,'Звание свободного человека дороже всего. Еврипид\r');
insert  into `app_quotes`(`ID`,`BODY`) values (169,'Знаете, что объединяет всех успешных предпринимателей? Невероятное упорство. Они никогда не сдаются. Наполеон Хилл\r');
insert  into `app_quotes`(`ID`,`BODY`) values (170,'Знание устраняет двух врагов создания благосостояния: риск и страх. Чарльз Гивенс\r');
insert  into `app_quotes`(`ID`,`BODY`) values (171,'И в мыслях даже не вмещается, чтобы было когда-нибудь время, когда никакого времени не было. Цицерон\r');
insert  into `app_quotes`(`ID`,`BODY`) values (172,'И чтобы начать сомневаться, нужно принять решение. Ежи Лец\r');
insert  into `app_quotes`(`ID`,`BODY`) values (173,'Идея собственной исключительности ненормальна, в своем развитии она может привести к болезни. В. Е. Михальцев\r');
insert  into `app_quotes`(`ID`,`BODY`) values (174,'Из всех знаний самые полезные те, которые дают нам правильные сведения о нас самих и учат нас управлять самими собою. Клавдий\r');
insert  into `app_quotes`(`ID`,`BODY`) values (175,'Изучай все не из тщеславия, а ради практической пользы. Лихтенберг\r');
insert  into `app_quotes`(`ID`,`BODY`) values (176,'Инвестируя время сейчас, я выигрываю время в будущем. Роберт Кийосаки\r');
insert  into `app_quotes`(`ID`,`BODY`) values (177,'Иногда нужно нахальство, чтобы доказать свою деликатность. Ежи Лец\r');
insert  into `app_quotes`(`ID`,`BODY`) values (178,'Искренна скорбь того, кто плачет втайне. Джордж Гордон Байрон\r');
insert  into `app_quotes`(`ID`,`BODY`) values (179,'Искренность со всеми и во всем - роскошь (в наше время), доступная лишь сумасшедшим или пьяным - в обоих случаях серьезно ее никто не принимает. В. Е. Михальцев\r');
insert  into `app_quotes`(`ID`,`BODY`) values (180,'Искусство слушать почти равносильно искусству хорошо говорить. Буаст\r');
insert  into `app_quotes`(`ID`,`BODY`) values (181,'Истина в конце концов не остается скрытой. Леонардо да Винчи\r');
insert  into `app_quotes`(`ID`,`BODY`) values (182,'Истинная любовь есть нравственное творчество. М. М. Пришвин\r');
insert  into `app_quotes`(`ID`,`BODY`) values (183,'Истинно могуч тот, кто побеждает самого себя. Восточная мудрость\r');
insert  into `app_quotes`(`ID`,`BODY`) values (184,'Истинное счастье состоит не в множестве друзей, а в достоинстве и свободе выбора. Бенджамин Джонсон\r');
insert  into `app_quotes`(`ID`,`BODY`) values (185,'Истинные лидеры - это не те, кто занимает высокие посты или имеет власть, а те, кто владеет сердцами и умами людей. Кьелл А. Нордстрем & Йонас Риддерстрале, \r');
insert  into `app_quotes`(`ID`,`BODY`) values (186,'Каждое потерянное мгновение - потерянное дело, потерянная польза. Честерфилд\r');
insert  into `app_quotes`(`ID`,`BODY`) values (187,'Каждый ребенок - художник. Трудность в том, чтобы остаться художником, выйдя из детского возраста. Пабло Пикассо\r');
insert  into `app_quotes`(`ID`,`BODY`) values (188,'Каждый человек - алмаз, который может очистить себя. В той мере, в какой он очищен, через него светит вечный свет. Стало быть, дело человека - не стараться светить, но стараться очищать себя. Л. Н. Толстой\r');
insert  into `app_quotes`(`ID`,`BODY`) values (189,'Как крепкая скала не может быть сдвинута ветром, так мудрецы непоколебимы среди хулений и похвал. Дхаммапада\r');
insert  into `app_quotes`(`ID`,`BODY`) values (190,'Как можно меньше грешить - вот закон для человека. Совсем не грешить - это мечта ангела. Все земное подвластно греху. Грех обладает силой притяжения. Гюго\r');
insert  into `app_quotes`(`ID`,`BODY`) values (191,'Как ни редко встречается настоящая любовь, настоящая дружба встречается еще реже. Ларошфуко\r');
insert  into `app_quotes`(`ID`,`BODY`) values (192,'Как теплая одежда защищает от стужи, так выдержка защищает от обиды. Умножай терпение и спокойствие духа, и обида, как бы горька ни была, тебя не коснется. Леонардо Да Винчи\r');
insert  into `app_quotes`(`ID`,`BODY`) values (193,'Какая разница между модой и славой? Мода никогда не бывает посмертной. Посмертной бывает только слава... М. А. Светлов\r');
insert  into `app_quotes`(`ID`,`BODY`) values (194,'Качество вашей жизни будет определяться тем, насколько глубоко вы посвятили себя совершенству, - независимо от того, какое поле деятельности было вами выбрано. Винс Ломбарди\r');
insert  into `app_quotes`(`ID`,`BODY`) values (195,'Ключ к успеху в бизнесе в личных отношениях. Автор неизвестен\r');
insert  into `app_quotes`(`ID`,`BODY`) values (196,'Когда вы учите других, вы узнаете вдвое больше. Автор неизвестен\r');
insert  into `app_quotes`(`ID`,`BODY`) values (197,'Когда дух работы в команде свободный и доброжелательный, это дает великую энергию, которая передается каждому. Владимир Довгань\r');
insert  into `app_quotes`(`ID`,`BODY`) values (198,'Когда много спрашивают - мало думают и плохо помнят. А. М. Горький\r');
insert  into `app_quotes`(`ID`,`BODY`) values (199,'Когда одна дверь счастья закрывается, открывается другая; но мы часто не замечаем ее, уставившись взглядом в закрытую дверь. Хелен Келлер\r');
insert  into `app_quotes`(`ID`,`BODY`) values (200,'Когда тебя настигает поражение, не теряй времени, считая потери. Считай свои достижения: увидишь, что они перевешивают потерянное. Владимир Довгань\r');
insert  into `app_quotes`(`ID`,`BODY`) values (201,'Когда ты явился на свет, ты плакал, а кругом все радовались; сделай же так, чтобы, когда ты будешь покидать свет, все плакали, а ты один улыбался. Индийское изречение\r');
insert  into `app_quotes`(`ID`,`BODY`) values (202,'Когда человек говорит, что деньги могут все, знайте: у него их нет и никогда не было. Эдгар Хау\r');
insert  into `app_quotes`(`ID`,`BODY`) values (203,'Когда я делаю добро, я чувствую себя хорошо. Когда я поступаю плохо, я чувствую себя плохо. Вот моя религия. Линкольн\r');
insert  into `app_quotes`(`ID`,`BODY`) values (204,'Крайняя бедность народа почти всегда является преступлением его вождей. Буаст\r');
insert  into `app_quotes`(`ID`,`BODY`) values (205,'Кратчайший и вернейший способ составить себе состояние - это дать людям понять, что им выгодно делать вам добро. Лабрюйер\r');
insert  into `app_quotes`(`ID`,`BODY`) values (206,'Крепкие слова не могут быть сильным доказательством. Василий Ключевский\r');
insert  into `app_quotes`(`ID`,`BODY`) values (207,'Крупный успех составляется из множества предусмотренных и обдуманных мелочей. Василий Ключевский\r');
insert  into `app_quotes`(`ID`,`BODY`) values (208,'Кто в деле смел, тот слов не устрашится. Софокл\r');
insert  into `app_quotes`(`ID`,`BODY`) values (209,'Кто делает вид, что много знает и ко всему способен, тот ничего не знает и ни к чему не способен. Лао-Цзы\r');
insert  into `app_quotes`(`ID`,`BODY`) values (210,'Кто не знает цену времени, тот не рожден для славы. Вовенарг\r');
insert  into `app_quotes`(`ID`,`BODY`) values (211,'Кто никогда не совершал безрассудств, тот не так мудр, как ему кажется. Франсуа де Ларошфуко\r');
insert  into `app_quotes`(`ID`,`BODY`) values (212,'Кто осторожнее в своих обещаниях, тот точнее в их исполнении. Жан Жак Руссо\r');
insert  into `app_quotes`(`ID`,`BODY`) values (213,'Кто предугадал ход событий на 24 часа раньше толпы заурядностей, тот все 24 часа слывет человеком, лишенным самого заурядного здравого смысла. Антуан де Ривароль\r');
insert  into `app_quotes`(`ID`,`BODY`) values (214,'Кто сам считает себя несчастным, тот становится несчастным. Гельвеций\r');
insert  into `app_quotes`(`ID`,`BODY`) values (215,'Кто слишком долго думает о том, чтобы делать добро, тому нет времени быть добрым. Р. Тагор\r');
insert  into `app_quotes`(`ID`,`BODY`) values (216,'Кто способен все претерпеть, тому дано на все дерзнуть. Люк де Клапье Вовенарг\r');
insert  into `app_quotes`(`ID`,`BODY`) values (217,'Куда несчастнее тот, кому никто не нравится, чем тот, кто не нравится никому. Франсуа де Ларошфуко\r');
insert  into `app_quotes`(`ID`,`BODY`) values (218,'Лгать самому себе для своей выгоды - подделка; лгать для выгоды другого - подлог; лгать для того, чтобы навредить, - клевета; это худший вред лжи. Руссо\r');
insert  into `app_quotes`(`ID`,`BODY`) values (219,'Легче встретить людей, обладающих умом, нежели способностью употреблять его в дело, ценить ум в других и находить ему полезное применение. Лабрюйер\r');
insert  into `app_quotes`(`ID`,`BODY`) values (220,'Ленивые всегда собираются что-то сделать. Вовенарг\r');
insert  into `app_quotes`(`ID`,`BODY`) values (221,'Лень делает всякое дело трудным. Франклин\r');
insert  into `app_quotes`(`ID`,`BODY`) values (222,'Лидерство - это стиль жизни, девиз которой: <Если не я, то кто?> Автор неизвестен\r');
insert  into `app_quotes`(`ID`,`BODY`) values (223,'Лишь тот достоин жизни и свободы, кто каждый день за них идет на бой. И. Гете\r');
insert  into `app_quotes`(`ID`,`BODY`) values (224,'Лучше полезть в карман за словом, чем за деньгами. Владимир Брынцалов\r');
insert  into `app_quotes`(`ID`,`BODY`) values (225,'Лучший способ защититься - не уподобляться. Марк Аврелий\r');
insert  into `app_quotes`(`ID`,`BODY`) values (226,'Любая деятельность становится творческой тогда, когда человек стремится выполнять свое дело правильнее и лучше. Апдайк\r');
insert  into `app_quotes`(`ID`,`BODY`) values (227,'Любите, если это не причиняет вреда. Мать Тереза\r');
insert  into `app_quotes`(`ID`,`BODY`) values (228,'Любовь - взаимна, иначе это преклонение. В. Е. Михальцев\r');
insert  into `app_quotes`(`ID`,`BODY`) values (229,'Любовь вызывает чувство защищенности, в особенности у женщин. К любви восприимчив и любви достоин прежде всего человек незащищенный. В. Е. Михальцев\r');
insert  into `app_quotes`(`ID`,`BODY`) values (230,'Любовь и искренность неразделимы. В. Е. Михальцев\r');
insert  into `app_quotes`(`ID`,`BODY`) values (231,'Любовь может сопровождаться заблуждением, но оно всегда искренне. В. Е. Михальцев\r');
insert  into `app_quotes`(`ID`,`BODY`) values (232,'Любые невзгоды следует превозмогать терпением. Вергилий Марок Публий\r');
insert  into `app_quotes`(`ID`,`BODY`) values (233,'Людей делят на праведников, которые считают себя грешниками, и грешников, которые считают себя праведниками. Паскаль\r');
insert  into `app_quotes`(`ID`,`BODY`) values (234,'Люди - хозяева своей судьбы. Шекспир\r');
insert  into `app_quotes`(`ID`,`BODY`) values (235,'Люди дурные живут для того, чтобы есть и пить, люди добродетельные едят и пьют для того, чтобы жить. Сократ\r');
insert  into `app_quotes`(`ID`,`BODY`) values (236,'Люди не любят хвалить и никогда не хвалят бескорыстно. Похвала - это искусная, скрытая, изящная лесть, приятная и тому, кто льстит, и тому, кому льстят: один принимает ее как награду за свои достоинства, другой преподносит, чтобы доказать свою справедливость и проницательность. Франсуа де Ларошфуко\r');
insert  into `app_quotes`(`ID`,`BODY`) values (237,'Люди обычно называют дружбой совместное времяпровождение, взаимную помощь в делах, обмен услугами - одним словом, такие отношения, где себялюбие надеется что-нибудь выгадать. Франсуа де Ларошфуко\r');
insert  into `app_quotes`(`ID`,`BODY`) values (238,'Люди тратят значительно больше слов, чтобы скрыть свои мысли, чем чтобы высказать их. Э. Севрус\r');
insert  into `app_quotes`(`ID`,`BODY`) values (239,'Люди, которым всегда некогда, обыкновенно ничего не делают. Г. Лихтенберг\r');
insert  into `app_quotes`(`ID`,`BODY`) values (240,'Мало обладать выдающимися качествами, надо еще уметь ими пользоваться. Франсуа де Ларошфуко\r');
insert  into `app_quotes`(`ID`,`BODY`) values (241,'Месть, как всякое зло, вредит прежде всего тому, кто ее осуществляет. В. Е. Михальцев\r');
insert  into `app_quotes`(`ID`,`BODY`) values (242,'Мечты - не уход от действительности, а средство приблизиться к ней. Моэм\r');
insert  into `app_quotes`(`ID`,`BODY`) values (243,'Милосердие имеет восемь ступеней. Высшая из них - помогать человеку оказывать помощь себе самому. Маймонид\r');
insert  into `app_quotes`(`ID`,`BODY`) values (244,'Мир житейский - это часы, гири которых - деньги, а маятник - женщина. Лессинг\r');
insert  into `app_quotes`(`ID`,`BODY`) values (245,'Мировоззрение - это парус, под которым мы плывем по жизни. Как настроим парус, туда и приплывем. Джим Рон\r');
insert  into `app_quotes`(`ID`,`BODY`) values (246,'Мнение не бывает ни истинным и ни ложным, а лишь полезным в жизни или бесполезным. Шри Ауробиндо\r');
insert  into `app_quotes`(`ID`,`BODY`) values (247,'Многие, думая, что они смогут все купить за свои богатства, сами прежде всего продали себя. Фрэнсис Бэкон\r');
insert  into `app_quotes`(`ID`,`BODY`) values (248,'Мое богатство состоит в том, что я делаю, а не в том, что я имею. Томас Карлейль\r');
insert  into `app_quotes`(`ID`,`BODY`) values (249,'Можно сопротивляться вторжению армий, вторжению идей сопротивляться невозможно. В. Гюго\r');
insert  into `app_quotes`(`ID`,`BODY`) values (250,'Мои герои - это люди, которые способны видеть сердцем и которые работают ради того, чтобы сделать лучше жизнь других людей. Карл А. Хэммершлаг\r');
insert  into `app_quotes`(`ID`,`BODY`) values (251,'Молодости, которая ничего себе не прощает, прощается все; а старости, которая все себе прощает, ничего не прощается. Бернард Шоу\r');
insert  into `app_quotes`(`ID`,`BODY`) values (252,'Моя цель - превратить конкретные советы в конкретные результаты. Есть учителя, которые обучают других различным образовательным дисциплинам. Это не я. А есть учителя, которые обучают других тому, как добиться конкретных результатов. Это я. Джим Рон\r');
insert  into `app_quotes`(`ID`,`BODY`) values (253,'Мудрец - тот, кто способен в нужный момент арестовать самого себя. Гюго\r');
insert  into `app_quotes`(`ID`,`BODY`) values (254,'Мужествен не только тот, кто побеждает врагов, но и тот, кто господствует над своими удовольствиями. Демокрит\r');
insert  into `app_quotes`(`ID`,`BODY`) values (255,'Мужчина в любимой обычно видит возлюбленную, а женщина, часто подсознательно, - отца будущего ребенка, поэтому она чаще более разборчива. В. Е. Михальцев\r');
insert  into `app_quotes`(`ID`,`BODY`) values (256,'Мы браним себя только для того, чтобы нас похвалили. Франсуа де Ларошфуко\r');
insert  into `app_quotes`(`ID`,`BODY`) values (257,'Мы всегда любим тех, кто восхищается нами, но не всегда любим тех, кем восхищаемся мы. Франсуа де Ларошфуко\r');
insert  into `app_quotes`(`ID`,`BODY`) values (258,'Мы должны благодарить тех, которые указывают нам наши недостатки. Паскаль\r');
insert  into `app_quotes`(`ID`,`BODY`) values (259,'Мы легко забываем свои ошибки, когда они известны лишь нам одним. Франсуа де Ларошфуко\r');
insert  into `app_quotes`(`ID`,`BODY`) values (260,'Мы не имеем права потреблять счастье, не производя его. Б. Шоу\r');
insert  into `app_quotes`(`ID`,`BODY`) values (261,'Мы не можем сделать все, но мы можем сделать намного больше, чем мы обычно делаем. Трагизм в том, как мало мы это осознаем. Дж. Бюджентал\r');
insert  into `app_quotes`(`ID`,`BODY`) values (262,'Мы обладаем только тем счастьем, которое способны понять. М. Метерлинк\r');
insert  into `app_quotes`(`ID`,`BODY`) values (263,'Мы так любим критиковать, что теряем способность глубоко чувствовать поистине прекрасные творения. Лабрюйер\r');
insert  into `app_quotes`(`ID`,`BODY`) values (264,'Мы хотим быть источником всех радостей или, если это невозможно, всех несчастий того, кого мы любим. Лабрюйер\r');
insert  into `app_quotes`(`ID`,`BODY`) values (265,'Мы часто утешаемся пустяками, ибо пустяки нас и огорчают. Паскаль\r');
insert  into `app_quotes`(`ID`,`BODY`) values (266,'Мысль - вот первоначальный источник всякого богатства, всякого успеха, всякого материального блага, всех великих открытий и изобретений, а также всех достижений. Клод М. Бристол\r');
insert  into `app_quotes`(`ID`,`BODY`) values (267,'На войне не доверяя, проверяй; в торговле доверяя, проверяй; в любви доверяя, не проверяй (иначе превратишь любовь в торговлю или войну). В. Е. Михальцев\r');
insert  into `app_quotes`(`ID`,`BODY`) values (268,'На день надо смотреть как на маленькую жизнь. М. Горький\r');
insert  into `app_quotes`(`ID`,`BODY`) values (269,'На свете мало недостижимых вещей; будь у нас больше настойчивости, мы могли бы отыскать путь почти к любой цели. Франсуа де Ларошфуко\r');
insert  into `app_quotes`(`ID`,`BODY`) values (270,'Наблюдайте за вашим телом, если хотите, чтобы ваш ум работал правильно. Декарт\r');
insert  into `app_quotes`(`ID`,`BODY`) values (271,'Надо поспешно делать то, что не так важно, чтобы делать не спеша то, что важно. Китайская пословица\r');
insert  into `app_quotes`(`ID`,`BODY`) values (272,'Наиболее точно и быстро мысль может быть передана без слов, но такое общение доступно немногим. В. Е. Михальцев\r');
insert  into `app_quotes`(`ID`,`BODY`) values (273,'Наконец-то я понял, почему Господь в Своей любви сотворил людей ответственными друг за друга и одарил их добродетелью надежды. Ибо так все люди стали посланниками единого Бога, и в руках каждого человека - спасение всех. Антуан де Сент-Экзюпери\r');
insert  into `app_quotes`(`ID`,`BODY`) values (274,'Нам нравятся люди, которые смело говорят нам, что думают, при условии, что они думают так же, как мы. Марк Твен\r');
insert  into `app_quotes`(`ID`,`BODY`) values (275,'Настоящая дружба не знает зависти, а настоящая любовь - кокетства. Ларошфуко\r');
insert  into `app_quotes`(`ID`,`BODY`) values (276,'Настоящий друг с тобой, когда ты не прав. Когда ты прав, всякий будет с тобой. Марк Твен\r');
insert  into `app_quotes`(`ID`,`BODY`) values (277,'Научиться доверять себе, оказывается, очень трудно. С. Л. Соловейчик\r');
insert  into `app_quotes`(`ID`,`BODY`) values (278,'Наш страх перед катастрофой лишь увеличивает ее вероятность. Б. Рассел\r');
insert  into `app_quotes`(`ID`,`BODY`) values (279,'Наше раскаяние - это обычно не столько сожаление о зле, которое совершили мы, сколько боязнь зла, которое могут причинить нам в ответ. Франсуа де Ларошфуко\r');
insert  into `app_quotes`(`ID`,`BODY`) values (280,'Не бедность невыносима, а презрение. Я могу обходиться без всего, но я хочу, чтоб об этом не знали. Вольтер\r');
insert  into `app_quotes`(`ID`,`BODY`) values (281,'Не бойся высоких жизненных целей: даже если они слишком высоки, твои достижения всегда будут следовать за ними. Владимир Довгань\r');
insert  into `app_quotes`(`ID`,`BODY`) values (282,'Не бойтесь будущего. Вглядывайтесь в него, не обманывайтесь на его счет, но не бойтесь. Вчера я поднялся на капитанский мостик и увидел огромные, как горы, волны и нос корабля, который уверенно их резал. И я спросил себя, почему корабль побеждает волны, хотя их так много, а он один? И понял - причина в том, что у корабля есть цель, а у волн - нет. Если у нас есть цель, мы всегда придем туда, куда хотим. Уинстон Черчилль\r');
insert  into `app_quotes`(`ID`,`BODY`) values (283,'Не будь у нас недостатков, нам было бы не так приятно подмечать их у ближних. Франсуа де Ларошфуко\r');
insert  into `app_quotes`(`ID`,`BODY`) values (284,'Не быть любимым - это всего лишь неудача, не любить - вот несчастье. Камю\r');
insert  into `app_quotes`(`ID`,`BODY`) values (285,'Не все то искусство, что искренне, но не искусство то, что не искренне. В. Е. Михальцев\r');
insert  into `app_quotes`(`ID`,`BODY`) values (286,'Не гоняйся за счастьем: оно всегда находится в тебе самом. Пифагор\r');
insert  into `app_quotes`(`ID`,`BODY`) values (287,'Не думай - я должен, а думай - хочу, и жизнь будет не рабством, а игрою. В. Е. Михальцев\r');
insert  into `app_quotes`(`ID`,`BODY`) values (288,'Не может измениться предназначение того или иного предмета только потому, что Вы не умеете им пользоваться или не желаете этого делать. Ирина Чудова\r');
insert  into `app_quotes`(`ID`,`BODY`) values (289,'Не надо страшиться ничего, кроме самого страха. Франклин Д. Рузвельт\r');
insert  into `app_quotes`(`ID`,`BODY`) values (290,'Не плачь, потому что это закончилось. Улыбнись потому что это было. Г. Маркес\r');
insert  into `app_quotes`(`ID`,`BODY`) values (291,'Не принимай благодеяний, без которых ты можешь обойтись. Кант\r');
insert  into `app_quotes`(`ID`,`BODY`) values (292,'Не раздражайтесь. Достигайте собственного умиротворения, ибо в спокойном состоянии дело улаживается само собой. Л. Н. Толстой\r');
insert  into `app_quotes`(`ID`,`BODY`) values (293,'Не следует робеть из опасения наделать ошибок. Самая большая ошибка - это лишать себя опытности. Вовенарг\r');
insert  into `app_quotes`(`ID`,`BODY`) values (294,'Не сможет тот великим стать, в ком нет величия души. Рудаки Абу Абдаллах Джафар\r');
insert  into `app_quotes`(`ID`,`BODY`) values (295,'Не стремись знать все, чтобы не стать во всем невеждой. Демокрит\r');
insert  into `app_quotes`(`ID`,`BODY`) values (296,'Не теряйте голову! А вдруг жизнь захочет вас еще по ней погладить? Ежи Лец\r');
insert  into `app_quotes`(`ID`,`BODY`) values (297,'Не требуйте от жизни невозможного! Почему? Ведь ее возможности безграничны. Ежи Лец\r');
insert  into `app_quotes`(`ID`,`BODY`) values (298,'Не хозяин платит зарплату - он лишь выдает деньги. Зарплату платит продукт. Генри Форд\r');
insert  into `app_quotes`(`ID`,`BODY`) values (299,'Неблагодарность - одно из худших свойств, отличающих человека от большинства животных. В. Е. Михальцев\r');
insert  into `app_quotes`(`ID`,`BODY`) values (300,'Невозможно работать для других, не работая для себя. Руссо\r');
insert  into `app_quotes`(`ID`,`BODY`) values (301,'Недостаток успеха никогда не означает утрату смысла. В. Франкл\r');
insert  into `app_quotes`(`ID`,`BODY`) values (302,'Некоторые люди аккумулируют деньги для того, чтобы конвертировать их в деньги, но более мудрые люди аккумулируют счастье для того, чтобы раздать его другим и все же иметь в изобилии. Владимир Довгань\r');
insert  into `app_quotes`(`ID`,`BODY`) values (303,'Нелегко разглядеть, чем вызван честный, искренний, благородный поступок - порядочностью или дальновидным расчетом. Франсуа де Ларошфуко\r');
insert  into `app_quotes`(`ID`,`BODY`) values (304,'Нельзя требовать от свободы справедливости. Свобода несправедлива - можно требовать справедливости от тюремного надзирателя, разливающего баланду. Померанец\r');
insert  into `app_quotes`(`ID`,`BODY`) values (305,'Ненависть - это гнев слабых. Доде\r');
insert  into `app_quotes`(`ID`,`BODY`) values (306,'Непознанная жизнь не стоит того, чтобы быть прожитой. Сократ\r');
insert  into `app_quotes`(`ID`,`BODY`) values (307,'Нередко нам пришлось бы стыдиться своих самых благородных поступков, если бы окружающим были известны наши побуждения. Франсуа де Ларошфуко\r');
insert  into `app_quotes`(`ID`,`BODY`) values (308,'Несчастные не имеют друзей. Драйден\r');
insert  into `app_quotes`(`ID`,`BODY`) values (309,'Нет на свете излишества прекраснее, чем излишек благодарности. Лабрюйер\r');
insert  into `app_quotes`(`ID`,`BODY`) values (310,'Нет ничего столь совершенного, чтобы быть свободным от всяких упреков. Эзоп\r');
insert  into `app_quotes`(`ID`,`BODY`) values (311,'Нет такого момента, когда можно сказать: <Ну что ж, теперь я добился успеха. Можно и вздремнуть.> Кэрри Фишер\r');
insert  into `app_quotes`(`ID`,`BODY`) values (312,'Нет такой мысли, которую нельзя было бы изменить. Влад Клевцов\r');
insert  into `app_quotes`(`ID`,`BODY`) values (313,'Неудача - это план природы подготовить тебя к большей ответственности. Владимир Довгань\r');
insert  into `app_quotes`(`ID`,`BODY`) values (314,'Ни в чем так не открываются ум и глупость, как в оценках. С. Л. Соловейчик\r');
insert  into `app_quotes`(`ID`,`BODY`) values (315,'Нигде не найти покоя тому, кто не нашел его в самом себе. Ларошфуко\r');
insert  into `app_quotes`(`ID`,`BODY`) values (316,'Никакое притворство не поможет долго скрывать любовь, когда она есть, или изображать - когда ее нет. Франсуа де Ларошфуко\r');
insert  into `app_quotes`(`ID`,`BODY`) values (317,'Никогда не вступайте в борьбу со свиньей. Только перепачкаетесь, а свинья получит удовольствие. Другими словами: не тратьте время на ссоры с людьми, которые любят спор ради самого спора. МакКормак\r');
insert  into `app_quotes`(`ID`,`BODY`) values (318,'Ничто не может занять места упорства. Талант не сможет этого сделать; мир полон талантливых неудачников. Гений тоже не сможет; непризнанный гений - это уже как пословица. Образование само по себе тоже не сможет это сделать; мир полон образованных изгоев. Только упорство и целеустремленность всемогущи. Кэлвин Кулидж\r');
insert  into `app_quotes`(`ID`,`BODY`) values (319,'Ничто так не мешает быть естественным, как желание им казаться. Франсуа де Ларошфуко\r');
insert  into `app_quotes`(`ID`,`BODY`) values (320,'Ничто, входящее в человека извне, не может осквернить его; но что исходит из него, то оскверняет человека. Библия, Марк 7:15\r');
insert  into `app_quotes`(`ID`,`BODY`) values (321,'Нравы портятся легче, чем исправляются. Л. Вовенарг\r');
insert  into `app_quotes`(`ID`,`BODY`) values (322,'Нужно стать известным человеком, чтобы позволить себе выступать инкогнито. Ежи Лец\r');
insert  into `app_quotes`(`ID`,`BODY`) values (323,'О некоторых сердцах можно сказать, что они свойства непромокаемого, а потому слезы ближних не пробивают их, скользя по ним. П. А. Вяземский\r');
insert  into `app_quotes`(`ID`,`BODY`) values (324,'Обещай медленно, выполняй быстро. Английская пословица\r');
insert  into `app_quotes`(`ID`,`BODY`) values (325,'Одна из несомненных и чистых радостей есть отдых после труда. Кант\r');
insert  into `app_quotes`(`ID`,`BODY`) values (326,'Одни хотели бы понимать то, во что верят, а другие - поверить в то, что понимают. Ежи Лец\r');
insert  into `app_quotes`(`ID`,`BODY`) values (327,'Одно дело успевать в делах - другое спешить. Марк Порций Катон\r');
insert  into `app_quotes`(`ID`,`BODY`) values (328,'Однообразие рождает скуку. В. Е. Михальцев\r');
insert  into `app_quotes`(`ID`,`BODY`) values (329,'Опозоренные жаждут уважения. Гюго\r');
insert  into `app_quotes`(`ID`,`BODY`) values (330,'Ораторы должны всегда предлагать самое лучшее, а не самое легкое. Демосфен\r');
insert  into `app_quotes`(`ID`,`BODY`) values (331,'Осмельтесь мыслить самостоятельно. Вольтер\r');
insert  into `app_quotes`(`ID`,`BODY`) values (332,'От наших родителей мы получили величайший и бесценный дар - жизнь. Они вскормили и взрастили нас, не жалея ни сил, ни любви. И теперь, когда они стары и больны, наш долг - вылечить и выходить их! Леонардо Да Винчи\r');
insert  into `app_quotes`(`ID`,`BODY`) values (333,'Отсутствие мотивации - величайшая трагедия, разрушающая все жизненные устои. Неизлечимо больной человек, переживший свои желания; миллиардер, для которого дальнейшее увеличение богатства бессмысленно; пресыщенный искатель наслаждений или <прирожденный пенсионер>, не имеющий охоты подняться выше сравнительно сносного уровня существования, - все они одинаково несчастливы. Ганс Селье\r');
insert  into `app_quotes`(`ID`,`BODY`) values (334,'Отчего это - хромой человек нас не раздражает, а умственно хромающий раздражает? Оттого, что хромой сознает, что мы ходим прямо, а умственно хромающий утверждает, что не он, а мы хромаем. Паскаль\r');
insert  into `app_quotes`(`ID`,`BODY`) values (335,'Ощущение возраста человека связано с его взглядом на мир: молодость смотрит в будущее, зрелый возраст - в настоящее, старость - в прошлое. В. Е. Михальцев\r');
insert  into `app_quotes`(`ID`,`BODY`) values (336,'Первый признак истинной любви у юноши - робость, у девушки - смелость. Гюго\r');
insert  into `app_quotes`(`ID`,`BODY`) values (337,'Пессимист видит трудности при каждой возможности; оптимист в каждой трудности видит возможности. Уинстон Черчилль\r');
insert  into `app_quotes`(`ID`,`BODY`) values (338,'Плохой учитель преподносит истину, хороший учит ее находить. Дистервег\r');
insert  into `app_quotes`(`ID`,`BODY`) values (339,'Победа должна приходить не иногда; она обязана приходить всегда. Винс Ломбарди\r');
insert  into `app_quotes`(`ID`,`BODY`) values (340,'Повелевать собою - величайшая власть. Сенека\r');
insert  into `app_quotes`(`ID`,`BODY`) values (341,'Пожалуй, единственная вещь, которая приходит к нам без усилий - это старость. Gloria Pitzer\r');
insert  into `app_quotes`(`ID`,`BODY`) values (342,'Позитивные стороны <Я> развиваются по мере того, как человек встречается с тревогой, двигается сквозь нее и преодолевает вызывающие тревогу переживания. Р. Мэй\r');
insert  into `app_quotes`(`ID`,`BODY`) values (343,'Поистине ловок тот, кто умеет скрывать свою ловкость. Франсуа де Ларошфуко\r');
insert  into `app_quotes`(`ID`,`BODY`) values (344,'Показная простота - это утонченное лицемерие. Ларошфуко\r');
insert  into `app_quotes`(`ID`,`BODY`) values (345,'Помните, у человека нет другого выбора - он должен быть человеком! Ежи Лец\r');
insert  into `app_quotes`(`ID`,`BODY`) values (346,'Порицать молодого человека за то, что он влюблен, все равно что упрекать кого-нибудь в том, что он болен. Дюкло\r');
insert  into `app_quotes`(`ID`,`BODY`) values (347,'Порядочная женщина - это скрытое от всех сокровище; найдя его, человек разумный не станет им хвалиться. Франсуа де Ларошфуко\r');
insert  into `app_quotes`(`ID`,`BODY`) values (348,'Посредственность - изучает известное, талант - вспоминает забытое, гений - сообщает новое. В. Е. Михальцев\r');
insert  into `app_quotes`(`ID`,`BODY`) values (349,'Поступай так, как велит тебе долг человека. Цицерон\r');
insert  into `app_quotes`(`ID`,`BODY`) values (350,'Потому говорю вам: все, чего ни будете просить в молитве, верьте, что получите, - и будет вам. И когда стоите на молитве, прощайте, если что имеете на кого, дабы и Отец ваш Небесный простил вам согрешения ваши. Библия, Марк 11:24-25\r');
insert  into `app_quotes`(`ID`,`BODY`) values (351,'Походка человека - физиономия его тела. Бальзак\r');
insert  into `app_quotes`(`ID`,`BODY`) values (352,'Почему мы запоминаем во всех подробностях то, что с нами случилось, но неспособны запомнить, сколько раз мы рассказывали об этом одному и тому же лицу? Франсуа де Ларошфуко\r');
insert  into `app_quotes`(`ID`,`BODY`) values (353,'Правдива или лжива людская молва, она часто играет в жизни человека, и особенно в дальнейшей его судьбе, не менее важную роль, чем его поступки. Гюго\r');
insert  into `app_quotes`(`ID`,`BODY`) values (354,'Праздность - утеха глупых. Честерфилд\r');
insert  into `app_quotes`(`ID`,`BODY`) values (355,'Предварительное знание того, что хочешь сделать, дает смелость и легкость. Дидро\r');
insert  into `app_quotes`(`ID`,`BODY`) values (356,'Прелесть таланта в том, что он делает то, чего я не могу. М. А. Светлов\r');
insert  into `app_quotes`(`ID`,`BODY`) values (357,'При наличии энтузиазма вы можете достичь всего. Энтузиазм - это закваска, заставляющая ваши надежды взлететь до небес. Энтузиазм - это блеск ваших глаз, стремительность походки, крепость рукопожатия, непреодолимый прилив энергии и воли для претворения в жизнь ваших идей. Энтузиасты - это борцы. Энтузиазм - краеугольный камень всего прогресса! Только с ним возможен успех. Без него у вас есть только возможности. Генри Форд\r');
insert  into `app_quotes`(`ID`,`BODY`) values (358,'Прибыль должно дать более искусное руководство делом: побольше мозга в вашей работе - мозга и еще раз мозга. Генри Форд\r');
insert  into `app_quotes`(`ID`,`BODY`) values (359,'Примирение с врагами говорит лишь об усталости от борьбы, о боязни поражения и о желании занять более выгодную позицию. Франсуа де Ларошфуко\r');
insert  into `app_quotes`(`ID`,`BODY`) values (360,'Приобретать познания еще недостаточно для человека, надо уметь отдавать их в рост. Гете\r');
insert  into `app_quotes`(`ID`,`BODY`) values (361,'Причина того, что люди так мало запоминают прочитанное, заключается в том, что они слишком мало думают сами. Лихтенберг\r');
insert  into `app_quotes`(`ID`,`BODY`) values (362,'Приятен старик, который приветлив и серьезен. Демокрит\r');
insert  into `app_quotes`(`ID`,`BODY`) values (363,'Проблема не любит смеха. Так что смейтесь или хотя бы улыбайтесь! Автор неизвестен\r');
insert  into `app_quotes`(`ID`,`BODY`) values (364,'Проси совета у того, кто умеет одерживать победы над самим собою. Леонардо Да Винчи\r');
insert  into `app_quotes`(`ID`,`BODY`) values (365,'Простота есть главное условие красоты моральной. Лев Николаевич Толстой\r');
insert  into `app_quotes`(`ID`,`BODY`) values (366,'Проявление воли по отношению к себе обычно дает удовлетворение не во время действия, а после. В. Е. Михальцев\r');
insert  into `app_quotes`(`ID`,`BODY`) values (367,'Пусть на тебя никогда не ляжет ответственность за убийство новой идеи. Автор неизвестен\r');
insert  into `app_quotes`(`ID`,`BODY`) values (368,'Пять вещей составляют совершенную добродетель: серьезность, щедрость души, искренность, усердие и доброта. Конфуций\r');
insert  into `app_quotes`(`ID`,`BODY`) values (369,'Работай постоянно, не почитай работу для себя бедствием и не желай себе за это похвалы. Марк Аврелий\r');
insert  into `app_quotes`(`ID`,`BODY`) values (370,'Радости и горе суть гвозди, которыми скрепляются душа и тело. Плутарх\r');
insert  into `app_quotes`(`ID`,`BODY`) values (371,'Разве смеяться - дурно? И разве нельзя смеяться, сохраняя полную серьезность?.. Смех лучше сохраняет нам разум, нежели досада и огорчения. Лессинг\r');
insert  into `app_quotes`(`ID`,`BODY`) values (372,'Развлечения в жизни - как сласти в пище: когда их много, они становятся противны. В. Е. Михальцев\r');
insert  into `app_quotes`(`ID`,`BODY`) values (373,'Разлука ослабляет легкое увлечение, но усиливает большую страсть, подобно тому как ветер гасит свечу, но раздувает пожар. Ларошфуко\r');
insert  into `app_quotes`(`ID`,`BODY`) values (374,'Раскрытие своего <я> другу производит два противоположных действия, ибо оно удваивает радости и делит горести пополам. Бэкон\r');
insert  into `app_quotes`(`ID`,`BODY`) values (375,'Ребенок может научить взрослого трем вещам: радоваться без всякой причины, всегда находить себе занятие и настаивать на своем. Пауло Коэльо\r');
insert  into `app_quotes`(`ID`,`BODY`) values (376,'С другом и говорить, и молчать легко. В. Е. Михальцев\r');
insert  into `app_quotes`(`ID`,`BODY`) values (377,'Самая главная формула успеха - знание, как обращаться с людьми. Т. Рузвельт\r');
insert  into `app_quotes`(`ID`,`BODY`) values (378,'Самое большое честолюбие прячется и становится незаметным, как только его притязания наталкиваются на непреодолимые преграды. Франсуа де Ларошфуко\r');
insert  into `app_quotes`(`ID`,`BODY`) values (379,'Самое страшное неверие - это неверие в самого себя. Томас Карлейль\r');
insert  into `app_quotes`(`ID`,`BODY`) values (380,'Самые лучшие вожди те, существование которых народ не замечает. Лао-Цзы\r');
insert  into `app_quotes`(`ID`,`BODY`) values (381,'Самый смертельный враг любви - привычка. Вольтер\r');
insert  into `app_quotes`(`ID`,`BODY`) values (382,'Свеча не теряет ни единой частицы света, если зажечь от нее другую свечу. Келлер\r');
insert  into `app_quotes`(`ID`,`BODY`) values (383,'Свобода не в том, чтоб не сдерживать себя, а в том, чтоб владеть собой. Ф. М. Достоевский\r');
insert  into `app_quotes`(`ID`,`BODY`) values (384,'Свободомыслящий. Достаточно - просто <мыслящий>. Ренар\r');
insert  into `app_quotes`(`ID`,`BODY`) values (385,'Своими успехами в бизнесе я обязан прежде всего способности сосредоточиться на перспективных целях, не поддаваясь соблазну решать сиюминутные задачи. Выступая в роли лидера, вы должны постоянно спрашивать себя: не устареет ли в скором времени разработанная мною технология? Надолго ли установлены отношения с этим партнером? Перспективна ли выбранная стратегия дистрибуции? Окажется ли в долгосрочном плане эффективной принятая в компании система оплаты труда и стимулирования сотрудников? Наиболее сложной стороной менеджмента, особенно в том случае, когда дела идут хорошо, является умение распознать необходимость перемен и пока еще есть возможность, провести их в жизнь. Билл Гейтс\r');
insert  into `app_quotes`(`ID`,`BODY`) values (386,'Семья есть самая аристократическая форма жизни. В. В. Розанов\r');
insert  into `app_quotes`(`ID`,`BODY`) values (387,'Серьезное разрушается смехом, смех - серьезным. Аристотель\r');
insert  into `app_quotes`(`ID`,`BODY`) values (388,'Силы знания должны быть направлены на самое нужное человеку: на его нравственное самосовершенствование. Л. Н. Толстой\r');
insert  into `app_quotes`(`ID`,`BODY`) values (389,'Скажи мне, с кем ты знаком, и я скажу тебе, кто ты. Если я знаю, чем ты занимаешься, я скажу тебе, что из тебя выйдет. Гете\r');
insert  into `app_quotes`(`ID`,`BODY`) values (390,'Сколько раз я должен напоминать тебе, что работа не сделает тебя богатым? Сколько раз я должен напоминать тебе, что богатыми становятся в свободное от работы время? Роберт Кийосаки\r');
insert  into `app_quotes`(`ID`,`BODY`) values (391,'Следует стремиться увидеть в каждой вещи то, чего еще никто не видел и над чем еще никто не думал. Лихтенберг\r');
insert  into `app_quotes`(`ID`,`BODY`) values (392,'Слова - это слова, объяснения - это объяснения, обещания - это обещания, а значение имеет только исполнение. Гарольд Джинн\r');
insert  into `app_quotes`(`ID`,`BODY`) values (393,'Слово <трудность> совершенно не должно существовать для творческого ума. Лихтенберг\r');
insert  into `app_quotes`(`ID`,`BODY`) values (394,'Случайные открытия делают только подготовленные умы. Паскаль\r');
insert  into `app_quotes`(`ID`,`BODY`) values (395,'Смелость - начало победы. Плутарх\r');
insert  into `app_quotes`(`ID`,`BODY`) values (396,'Смех - это солнце: оно прогоняет с человеческого лица зиму. Гюго\r');
insert  into `app_quotes`(`ID`,`BODY`) values (397,'Смысл должен быть найден, но не может быть создан. В. Франкл\r');
insert  into `app_quotes`(`ID`,`BODY`) values (398,'Снисходительное отношение к глупости присуще каждому умному человеку. Абу-Ль-Фарадж\r');
insert  into `app_quotes`(`ID`,`BODY`) values (399,'Совершенство складывается из мелочей. Микеланджело\r');
insert  into `app_quotes`(`ID`,`BODY`) values (400,'Совесть может быть определена как интуитивная способность человека находить смысл ситуации. В. Франкл\r');
insert  into `app_quotes`(`ID`,`BODY`) values (401,'Сомнения в процессе творчества обязательны, но они не должны мешать принимать единственное свободное решение. В. Е. Михальцев\r');
insert  into `app_quotes`(`ID`,`BODY`) values (402,'Спасая одного человека, спасаешь целый мир. Автор неизвестен\r');
insert  into `app_quotes`(`ID`,`BODY`) values (403,'Способность предполагается заранее, но она должна стать умением. Иоганн Вольфганг Гете\r');
insert  into `app_quotes`(`ID`,`BODY`) values (404,'Спроси себя, счастлив ли ты, и ты перестанешь быть счастлив. Дж. Милль\r');
insert  into `app_quotes`(`ID`,`BODY`) values (405,'Старики потому так любят давать хорошие советы, что уже не способны подавать дурные примеры. Франсуа де Ларошфуко\r');
insert  into `app_quotes`(`ID`,`BODY`) values (406,'Страх перед возможностью ошибки не должен отвращать нас от поисков истины. Гельвеций\r');
insert  into `app_quotes`(`ID`,`BODY`) values (407,'Стремясь к успеху, надо стремиться и к совершенству. Элизабет Доул\r');
insert  into `app_quotes`(`ID`,`BODY`) values (408,'Стройная фигура, правильный профиль и хороший цвет лица отмечается всеми (в том числе и недалекими, поверхностными людьми), отчего у человека, обладающего внешней красотой, вырабатывается сознание своей врожденной исключительности и часто пропадает стимул совершенствования красоты внутренней. В. Е. Михальцев\r');
insert  into `app_quotes`(`ID`,`BODY`) values (409,'Сущность всякой веры состоит в том, что она придает жизни такой смысл, который не уничтожается смертью. Л. Толстой\r');
insert  into `app_quotes`(`ID`,`BODY`) values (410,'Счастлив тот, кто открывает в себе внутреннее богатство. Шопенгауэр\r');
insert  into `app_quotes`(`ID`,`BODY`) values (411,'Счастливей всех тот, кто без тревоги ждет завтрашнего дня: он уверен, что принадлежит сам себе. Сенека\r');
insert  into `app_quotes`(`ID`,`BODY`) values (412,'Счастье - как здоровье: когда его не замечаешь, значит, оно есть. И. С. Тургенев\r');
insert  into `app_quotes`(`ID`,`BODY`) values (413,'Счастье не в счастье, а лишь в его достижении. Ф. М. Достоевский\r');
insert  into `app_quotes`(`ID`,`BODY`) values (414,'Счастье подобно бабочке. Чем больше ловишь его, тем больше оно ускользает. Но если вы перенесете свое внимание на другие вещи, оно придет и тихонько сядет вам на плечо. В. Франкл\r');
insert  into `app_quotes`(`ID`,`BODY`) values (415,'Такт, как и деликатность, - это уважение мнения, состояния, настроения другого человека, которые могут не соответствовать или даже противоречить твоим. В. Е. Михальцев\r');
insert  into `app_quotes`(`ID`,`BODY`) values (416,'Талант - это то, чем Вы можете служить людям. Это то, что у Вас получается лучше всего. Это то, чем Вы приобретаете для себя все потребное для жизни. Это не украшение, а тот инструмент, благодаря которому материализуются все планы и желания сердца. Любое доброе дело устраивается талантами людей. Ирина Чудова\r');
insert  into `app_quotes`(`ID`,`BODY`) values (417,'Твердый характер должен сочетаться с гибкостью разума. Люк де Клапье Вовенарг\r');
insert  into `app_quotes`(`ID`,`BODY`) values (418,'Творчество - поиск единственного. В. Е. Михальцев\r');
insert  into `app_quotes`(`ID`,`BODY`) values (419,'Те, у кого мы учимся, правильно называются нашими учителями, но не всякий, кто учит нас, заслуживает это имя. Гете\r');
insert  into `app_quotes`(`ID`,`BODY`) values (420,'Тебя заботит будущее? Строй сегодня. Ты можешь изменить все. На бесплодной равнине вырастить кедровый лес. Но важно, чтобы ты не конструировал кедры, а сажал семена. А. де Сент-Экзюпери\r');
insert  into `app_quotes`(`ID`,`BODY`) values (421,'Терять время - это постепенно совершать самоубийство. Сафир\r');
insert  into `app_quotes`(`ID`,`BODY`) values (422,'Только растрачивая себя человек становится богатым. Бернар\r');
insert  into `app_quotes`(`ID`,`BODY`) values (423,'Только те, кто предпринимает абсурдные попытки, смогут достичь невозможного. Эйнштейн\r');
insert  into `app_quotes`(`ID`,`BODY`) values (424,'Только тот способен на великое деяние, кто живет так, словно он бессмертен. Л. де Клапье де Вовенарг\r');
insert  into `app_quotes`(`ID`,`BODY`) values (425,'Торжество разума в том и состоит, чтобы уживаться с людьми, не имеющими его. Вольтер\r');
insert  into `app_quotes`(`ID`,`BODY`) values (426,'Тот человек, которого ты любишь во мне, конечно, лучше меня: я не такой. Но ты люби, и я постараюсь быть лучше себя. М. М. Пришвин\r');
insert  into `app_quotes`(`ID`,`BODY`) values (427,'Тот, кто добр, - свободен, даже если он раб; тот, кто зол, - раб, даже если он король. Августин Блаженный\r');
insert  into `app_quotes`(`ID`,`BODY`) values (428,'Тот, кто считает себя недостойным своего места, будет его недостоин. Джордж Сэвил Галифакс\r');
insert  into `app_quotes`(`ID`,`BODY`) values (429,'Труд - это отец удовольствия. Стендаль\r');
insert  into `app_quotes`(`ID`,`BODY`) values (430,'Трудись для того, чтобы наслаждаться. Руссо\r');
insert  into `app_quotes`(`ID`,`BODY`) values (431,'Ты не продашь их пока не полюбишь. Автор неизвестен\r');
insert  into `app_quotes`(`ID`,`BODY`) values (432,'Тысяча мышей не заменят одного слона. Китайская пословица\r');
insert  into `app_quotes`(`ID`,`BODY`) values (433,'У детей нет ни прошлого, ни будущего, зато в отличие от нас, взрослых, они умеют пользоваться настоящим. Лабрюйер\r');
insert  into `app_quotes`(`ID`,`BODY`) values (434,'У каждого человека с младенчества есть имя, но важно суметь найти имя для своей жизни - слово, которое должно сообщить этой жизни смысл. Пауло Коэльо\r');
insert  into `app_quotes`(`ID`,`BODY`) values (435,'У кого хорошая память, тому легче о многом забыть. Ежи Лец\r');
insert  into `app_quotes`(`ID`,`BODY`) values (436,'У нас не хватает силы характера, чтобы покорно следовать всем велениям рассудка. Франсуа де Ларошфуко\r');
insert  into `app_quotes`(`ID`,`BODY`) values (437,'Убеждения - это наши собственные мнения; предрассудки - убеждения других. Леонард Луис Левинсон\r');
insert  into `app_quotes`(`ID`,`BODY`) values (438,'Уважай себя, если хочешь, чтобы тебя уважали. Грасиан\r');
insert  into `app_quotes`(`ID`,`BODY`) values (439,'Удача - это когда возможность произрастает на подготовленной почве. Владимир Довгань\r');
insert  into `app_quotes`(`ID`,`BODY`) values (440,'Удивительно устроен человек: он огорчается, когда теряет богатство, и равнодушен к тому, что безвозвратно уходят дни его жизни. Абу-Ль-Фарадж\r');
insert  into `app_quotes`(`ID`,`BODY`) values (441,'Уединение пробуждает любовь к людям, неназойливый интерес к ним. Руссо\r');
insert  into `app_quotes`(`ID`,`BODY`) values (442,'Ум человека можно определить по тщательности, с которой он учитывает будущее или исход дела. Лихтенберг\r');
insert  into `app_quotes`(`ID`,`BODY`) values (443,'Умение обращаться с людьми - это товар, который мы можем купить точно так же, как мы покупаем сахар или кофе. И я заплачу за такое умение больше, чем за что либо другое на свете. Джон Д. Рокфеллер\r');
insert  into `app_quotes`(`ID`,`BODY`) values (444,'Уметь выносить одиночество и получать от него удовольствие - великий дар. Бернард Шоу\r');
insert  into `app_quotes`(`ID`,`BODY`) values (445,'Управлять одним человеком иной раз труднее, чем целым народом. Вовенарг\r');
insert  into `app_quotes`(`ID`,`BODY`) values (446,'Усилие есть необходимое условие нравственного совершенствования. Л. Н. Толстой\r');
insert  into `app_quotes`(`ID`,`BODY`) values (447,'Успех - это способность идти от неудачи к неудаче, не теряя энтузиазма. У. Черчиль\r');
insert  into `app_quotes`(`ID`,`BODY`) values (448,'Успешные люди делают те вещи, которые не любят делать неудачники. Владимир Довгань\r');
insert  into `app_quotes`(`ID`,`BODY`) values (449,'Учи тому, что знаешь, лучше - что умеешь, еще лучше - тому, что делаешь. Делай так, как учишь. В. Е. Михальцев\r');
insert  into `app_quotes`(`ID`,`BODY`) values (450,'Учиться - все равно что плыть против течения: остановился - и тебя отнесло назад. Китайская пословица\r');
insert  into `app_quotes`(`ID`,`BODY`) values (451,'Философы - не более чем кузнецы, кующие плуги. После них многое еще должно быть сделано, чтобы получился хлеб. Карл Людвиг Берне\r');
insert  into `app_quotes`(`ID`,`BODY`) values (452,'Характер человека никогда нельзя понять вернее, чем по той шутке, на которую он обижается. Лихтенберг\r');
insert  into `app_quotes`(`ID`,`BODY`) values (453,'Хороший ученик видит ошибки своего учителя, но молчит о них почтительно, ибо самые эти ошибки служат ему в пользу и наставляют его на прямой путь. Русское изречение\r');
insert  into `app_quotes`(`ID`,`BODY`) values (454,'Хорошо слушать и хорошо отвечать - это одно из великих совершенств, какое только возможно в разговоре. Ларошфуко\r');
insert  into `app_quotes`(`ID`,`BODY`) values (455,'Хотите подчинить себе других - начинайте с себя. Вовенарг\r');
insert  into `app_quotes`(`ID`,`BODY`) values (456,'Храбрость - это делание того, чего вы боитесь делать. Не может быть храбрости, пока вы не испуганы. Eddie Rickenbacker\r');
insert  into `app_quotes`(`ID`,`BODY`) values (457,'Храбрые всегда упрямы. Пауло Коэльо\r');
insert  into `app_quotes`(`ID`,`BODY`) values (458,'Цель жизни - самовыражение. Проявить во всей полноте свою сущность - вот для чего мы живем. О. Уайльд\r');
insert  into `app_quotes`(`ID`,`BODY`) values (459,'Циник знает всему цену, но не знает ценности. О. Уайльд\r');
insert  into `app_quotes`(`ID`,`BODY`) values (460,'Часть всего заработанного нужно откладывать, а если вы не умеете экономить деньги, то в вас не заложены семена величия. У. Клемент-Стоун\r');
insert  into `app_quotes`(`ID`,`BODY`) values (461,'Человек должен делать выбор - в этом и состоит его сила - в могуществе его решений. Пауло Коэльо\r');
insert  into `app_quotes`(`ID`,`BODY`) values (462,'Человек имеет и то преимущество над машинами, что способен себя продать сам. Ежи Лец\r');
insert  into `app_quotes`(`ID`,`BODY`) values (463,'Человек любит общество, будь это даже общество одиноко горящей свечки. Лихтенберг\r');
insert  into `app_quotes`(`ID`,`BODY`) values (464,'Человек отличается от обезьяны наличием своей точки зрения. Фейербах\r');
insert  into `app_quotes`(`ID`,`BODY`) values (465,'Человек растет по мере того, как растут его цели. Шиллер\r');
insert  into `app_quotes`(`ID`,`BODY`) values (466,'Человек с ясной целью будет продвигаться даже по самой тяжкой дороге. Человек безо всякой цели не продвинется и по самой гладкой дороге. Томас Карлейль\r');
insert  into `app_quotes`(`ID`,`BODY`) values (467,'Человек так создан, что он отдыхает от одной работы лишь взявшись за другую. Франс\r');
insert  into `app_quotes`(`ID`,`BODY`) values (468,'Человек, занятый делом, всегда эгоистичен. Ему надо или помогать, или не мешать! В. В. Шахиджанян\r');
insert  into `app_quotes`(`ID`,`BODY`) values (469,'Человек, сделавший хотя бы шаг к цели, сразу становится мишенью для всех отставших. Автор неизвестен\r');
insert  into `app_quotes`(`ID`,`BODY`) values (470,'Человеку нередко кажется, что он владеет собой, тогда как на самом деле что-то владеет им; пока разумом он стремится к одной цели, сердце незаметно увлекает его к другой. Ларошфуко\r');
insert  into `app_quotes`(`ID`,`BODY`) values (471,'Чем больше у компании администрации, тем хуже идут у нее дела. Джеймс Голдсмит\r');
insert  into `app_quotes`(`ID`,`BODY`) values (472,'Чем реже встречаются ошибки, тем они ценнее. Ежи Лец\r');
insert  into `app_quotes`(`ID`,`BODY`) values (473,'Чем умнее человек, тем более он находит оригинальных людей. Заурядные личности не находят разницы между людьми. Паскаль\r');
insert  into `app_quotes`(`ID`,`BODY`) values (474,'Чем упорнее я работаю, тем счастливее становлюсь. Джеймс Тербер\r');
insert  into `app_quotes`(`ID`,`BODY`) values (475,'Через 20 лет вы будете больше разочарованы теми вещами, которые вы не сделали, чем теми, которые вы сделали. Так отчальте от тихой пристани, почувствуйте попутный ветер в вашем парусе. Двигайтесь вперед! Мечтайте! Открывайте! Марк Твен\r');
insert  into `app_quotes`(`ID`,`BODY`) values (476,'Честность - есть простейшее выражение принципа правды. Смайлс\r');
insert  into `app_quotes`(`ID`,`BODY`) values (477,'Честь наша состоит в том, чтобы следовать лучшему и улучшать худшее, если оно еще может стать совершеннее. Платон\r');
insert  into `app_quotes`(`ID`,`BODY`) values (478,'Чрезмерная поспешность в расплате за оказанную услугу есть своего рода неблагодарность. Франсуа де Ларошфуко\r');
insert  into `app_quotes`(`ID`,`BODY`) values (479,'Чтение делает человека знающим, беседа - находчивым, а привычка записывать - точным. Бэкон\r');
insert  into `app_quotes`(`ID`,`BODY`) values (480,'Что пользы в том, что ты многое знал, раз ты не умел применять твои знания к твоим нуждам. Франческо Петрарка\r');
insert  into `app_quotes`(`ID`,`BODY`) values (481,'Чтобы быть лидером, у человека должны быть последователи. А чтобы были последователи, они должны быть уверенны в этом человеке. Таким образом, главным качеством лидера является неоспоримая честность. Без нее настоящий успех просто невозможен. Дуайт Дейвид Эйзенхауэр\r');
insert  into `app_quotes`(`ID`,`BODY`) values (482,'Чтобы искать смысл жизни - не говоря уже о том, чтобы найти его, - надо прежде всего остановиться, сосредоточиться и ни о чем не хлопотать. С. Л. Франк\r');
insert  into `app_quotes`(`ID`,`BODY`) values (483,'Чтобы помочь себе, прежде помоги другим. Автор неизвестен\r');
insert  into `app_quotes`(`ID`,`BODY`) values (484,'Чтобы узнать, какая дорога впереди, спроси тех, кто по ней возвращается. Китайская пословица\r');
insert  into `app_quotes`(`ID`,`BODY`) values (485,'Шутка никогда не бывает похожа на истину, а истина бывает похожа на самую злую шутку. Паскаль\r');
insert  into `app_quotes`(`ID`,`BODY`) values (486,'Юношам часто кажется, что они естественны, тогда как на самом деле они просто невоспитанны и грубы. Франсуа де Ларошфуко\r');
insert  into `app_quotes`(`ID`,`BODY`) values (487,'Я буду делать сегодня то, что большинство не будет делать, поэтому завтра я буду иметь то, что большинство не будет иметь. Рэнди Гейдж\r');
insert  into `app_quotes`(`ID`,`BODY`) values (488,'Я видел смысл своей жизни в том, чтобы помогать другим увидеть смысл в своей жизни. В. Франкл\r');
insert  into `app_quotes`(`ID`,`BODY`) values (489,'Я должен создать Систему, в противном случае я буду порабощен другими людьми. Уильям Блейк\r');
insert  into `app_quotes`(`ID`,`BODY`) values (490,'Я не нахожу в бедности ничего привлекательного или поучительного. Она меня ничему не научила и лишь извратила мое представление о ценностях жизни, внушив мне неоправданое уважение к добродетелям и талантам богатых и так называемых высших классов общества. Чарльз Спенсер Чаплин\r');
insert  into `app_quotes`(`ID`,`BODY`) values (491,'Я обращаю мало внимания на критиков. В мире есть два вида людей: те, кто может, и те, кто критикует. Рональд Рейган\r');
insert  into `app_quotes`(`ID`,`BODY`) values (492,'Я побеждаю своих врагов тем, что превращаю их в друзей. Линкольн\r');
insert  into `app_quotes`(`ID`,`BODY`) values (493,'Я предпочитаю смерть усталости. Я никогда не устаю служить другим. Леонардо Да Винчи\r');
insert  into `app_quotes`(`ID`,`BODY`) values (494,'Я хочу освободиться от скрытого желания быть недостойным. Я достоин всего самого лучшего в жизни, и я разрешаю себе принять это с любовью! Луиза Хей\r');
insert  into `app_quotes`(`ID`,`BODY`) values (495,'Победа - это еще не все, а вот желание быть подготовленным к победе - это все\".  Винс Ломбарди (Vince Lombardi)\r');
insert  into `app_quotes`(`ID`,`BODY`) values (496,'Я говорил это и раньше, скажу и сейчас: \"Нет видения, нет и действий. Нет видения, нет и решения. Нет видения, нет и сделки\". Джим Кемп\r');
insert  into `app_quotes`(`ID`,`BODY`) values (497,'Ваша самая сильная сторона является одновременно вашей наибольшей слабостью\". Эмерсон (Emerson)\r');
insert  into `app_quotes`(`ID`,`BODY`) values (498,'Чем яснее ваше видение проблемы другой стороны, тем проще процесс принятия решения\". Джим Кемп\r');
insert  into `app_quotes`(`ID`,`BODY`) values (499,'Величайшей вашей презентацией будет та, которую ваш оппонент никогда не видел\". Джим Кемп\r');
insert  into `app_quotes`(`ID`,`BODY`) values (500,'Чем образованнее человек, тем красочнее его карта жизни. Леонид С. Сухоруков\r');
insert  into `app_quotes`(`ID`,`BODY`) values (501,'Если высыпать содержимое кошелька себе в голову, его уже никто у вас не отнимет. Бенджамин Франклин\r');
insert  into `app_quotes`(`ID`,`BODY`) values (502,'Каждый день, в который вы не пополнили своего образования хотя бы маленьким, но новым для вас куском знания: считайте бесплодно и невозвратно для себя погибшим. Константин Станиславский\r');
insert  into `app_quotes`(`ID`,`BODY`) values (503,'Кто утверждает, что деньги могут сделать все, вполне вероятно, сам может сделать все ради денег. Бенджамин Франклин\r');
insert  into `app_quotes`(`ID`,`BODY`) values (504,'Видеть легко, трудно предвидеть. Бенджамин Франклин\r');
insert  into `app_quotes`(`ID`,`BODY`) values (505,'Тот, кто дожидается удачи, никогда не знает, будет ли он сегодня ужинать. Бенджамин Франклин\r');
insert  into `app_quotes`(`ID`,`BODY`) values (506,'Во всяком деле 80 процентов успеха зависит от руководителя и только 20 процентов - от подчиненных. Американская пословица\r');
insert  into `app_quotes`(`ID`,`BODY`) values (507,'Все управление в конечном счете сводится к стимулированию активности других людей. Ли Якокка\r');
insert  into `app_quotes`(`ID`,`BODY`) values (508,'Если у вас дельные, хорошо обученные сотрудники, а вы не привлекаете их к совместному принятию решений, вы понапрасну теряете свое собственное время. Из постулатов менеджмента\r');
insert  into `app_quotes`(`ID`,`BODY`) values (509,'Не в том дело, решите вы задачу или нет, а в том, на кого возложите ответственность. Из постулатов менеджмента\r');
insert  into `app_quotes`(`ID`,`BODY`) values (510,'И всякий из нас, кто предполагает, что может руководить другими, должен постоянно и напряженно учиться. А.В. Луначарский\r');
insert  into `app_quotes`(`ID`,`BODY`) values (511,'Истинная роль главного руководителя состоит в том, чтобы управлять ценностными установками организации. Р. Уотермен\r');
insert  into `app_quotes`(`ID`,`BODY`) values (512,'К каждому подбирать отмычку. В том искусство управлять людьми. Балътасар Грасиан-и-Моралес\r');
insert  into `app_quotes`(`ID`,`BODY`) values (513,'Каждый человек, которого я встречаю, меня в чем-то превосходит, и в этом смысле я могу у него поучиться. Ральф Уолдо Эмерсон\r');
insert  into `app_quotes`(`ID`,`BODY`) values (514,'Талант руководителя состоит в том, чтобы быстро принять решение и найти человека, который сделает всю работу. Дж.Г. Поллард\r');
insert  into `app_quotes`(`ID`,`BODY`) values (515,'Умение обращаться с людьми - это товар, который можно купить точно так же, как мы покупаем сахар или кофе... И я заплачу за такое умение больше, чем за что-либо другое на свете. Д. Рокфеллер\r');
insert  into `app_quotes`(`ID`,`BODY`) values (516,'Дело подобно автомобилю: само по себе оно будет двигаться только под гору. Заповедь американских менеджеров\r');
insert  into `app_quotes`(`ID`,`BODY`) values (517,'Трудолюбие - душа бизнеса и краеугольный камень процветания. Диккенс\r');
insert  into `app_quotes`(`ID`,`BODY`) values (518,'Лучших результатов добивается не обязательно тот, у кого самая умная голова, а скорее тот, кто лучше всех умеет координировать работу своих умных и талантливых коллег. Джонс\r');
insert  into `app_quotes`(`ID`,`BODY`) values (519,'Деньги, потраченные для развития ума, никогда не потрачены зря. Пословица\r');
insert  into `app_quotes`(`ID`,`BODY`) values (520,'Ответственность - это то, чего больше всего боятся люди. Тем не менее, это именно то, что помогает нам расти в этом мире. Крэйн\r');
insert  into `app_quotes`(`ID`,`BODY`) values (521,'Люди редко могут совершенствоваться, если кроме себя не имеют других образцов для подражания. Голдсмит\r');
insert  into `app_quotes`(`ID`,`BODY`) values (522,'Многие хотят обладать знаниями, но сравнительно немногие готовы заплатить за них требуемую цену. Ювенал\r');
insert  into `app_quotes`(`ID`,`BODY`) values (523,'Знания подобны деньгам: чем больше Вы их имеете, тем еще больше Вам хочется их иметь. Биллингс\r');
insert  into `app_quotes`(`ID`,`BODY`) values (524,'Советы получают многие, но только мудрые извлекают из них пользу. Сайрус\r');
insert  into `app_quotes`(`ID`,`BODY`) values (525,'Искусство победы над конкурентом состоит в том, чтобы изумлять его там, где он лучше. Альтенберг Петер\r');
insert  into `app_quotes`(`ID`,`BODY`) values (526,'Весь секрет бизнеса в том, чтобы знать что-то такое, чего не знает больше никто. Аристотель Онассис\r');
insert  into `app_quotes`(`ID`,`BODY`) values (527,'Свет принципов управления, как и свет маяков, является путеводным лишь для тех, кто знает вход в гавань. Голый принцип без средств его осуществления ничего не значит. Анри Файоль\r');
insert  into `app_quotes`(`ID`,`BODY`) values (528,'Хорошая организация при бедном оборудовании даст лучшие результаты, чем отличное оборудование при плохой организации. Ф.У. Тейлор\r');
insert  into `app_quotes`(`ID`,`BODY`) values (529,'Управлять - значит предвидеть, а предвидеть значит - много знать. Марк Туллий Цицерон\r');
insert  into `app_quotes`(`ID`,`BODY`) values (530,'Правильное решение должно оказаться не только изящным, но и простым. Дж. Уотсон\r');
insert  into `app_quotes`(`ID`,`BODY`) values (531,'Не делай никогда того, чего не знаешь. Но научись всему, что следует знать. Пифагор\r');
insert  into `app_quotes`(`ID`,`BODY`) values (532,'Тот, кто задает вопрос, глупец в течение пяти минут, тот, кто его не задает, глупец всю свою жизнь. Китайская поговорка\r');
insert  into `app_quotes`(`ID`,`BODY`) values (533,'Информация, в отличие от ресурсов, задумана, чтобы ею делились. Роберт Киосаки\r');
insert  into `app_quotes`(`ID`,`BODY`) values (534,'Не бывает двух более разных людей, чем один и тот же человек, когда он еще только претендует на какое-то место и когда он уже его занял. Джордж Савил Галифакс\r');
insert  into `app_quotes`(`ID`,`BODY`) values (535,'Между человеком образованным и необразованным такая же разница, как между живым и мертвым. Аристотель\r');
insert  into `app_quotes`(`ID`,`BODY`) values (536,'Образование стоит денег. Невежество тоже. Клаус Мозер\r');
insert  into `app_quotes`(`ID`,`BODY`) values (537,'Кто, предпринимая дело, спешит наскоро достичь результата, тот ничего не сделает. Кто осторожно оканчивает свое дело, как начал, тот не потерпит неудачи. Лао-Цзы (Ли Эр)\r');
insert  into `app_quotes`(`ID`,`BODY`) values (538,'Никакая цель не высока настолько, чтобы оправдывала недостойные средства для ее достижения. Альберт Эйнштейн\r');
insert  into `app_quotes`(`ID`,`BODY`) values (539,'Я уважаю людей, которые точно знают, чего хотят. Большая часть бед во всем мире происходит от того, что люди недостаточно точно понимают свои цели. Начиная возводить здание, они тратят на фундамент слишком мало усилий, чтобы могла выстоять башня. Иоганн Вольфганг Гёте\r');
insert  into `app_quotes`(`ID`,`BODY`) values (540,'Залог успешного руководства - видеть многовариантность будущего, умение предусматривать самые мрачные сценарии. Уильям Шекспир\r');
insert  into `app_quotes`(`ID`,`BODY`) values (541,'БИЗНЕС - увлекательнейшая игра, в которой максимум азарта сочетается с минимумом правил. Билл Гейтс\r');
insert  into `app_quotes`(`ID`,`BODY`) values (542,'Дружба, основанная на бизнесе, лучше, чем бизнес, основанный на дружбе. Джон Рокфеллер\r');
insert  into `app_quotes`(`ID`,`BODY`) values (543,'Иной порой откусывает больше, чем может прожевать. Но любой чего-то стоящий начальник всегда предпочитает иметь дело с людьми, которые замахиваются на лишнее, чем с теми, которые стараются сделать поменьше. Ли Якокка\r');
insert  into `app_quotes`(`ID`,`BODY`) values (544,'Успех бизнесмена на 15% зависит от его профессиональных навыков и на 85% - от умения общаться с людьми. Неизвестный автор\r');
insert  into `app_quotes`(`ID`,`BODY`) values (545,'Вовсе не обязательно принимать каждое рационализаторское предложение, но если не воскликнуть \"Отлично придумано!\" и не похлопать придумавшего по спине, он уже никогда ничего вам больше не предложит. Такого рода реакция показывает человеку - он что-то значит. Ли Якокка\r');
insert  into `app_quotes`(`ID`,`BODY`) values (546,'Кто умеет владеть собою, тот может повелевать людьми. Вольтер (Мари Франсуа Аруэ)\r');
insert  into `app_quotes`(`ID`,`BODY`) values (547,'МЕНЕДЖЕР - человек, который никогда не откладывает на завтра то, что он может заставить других сделать сегодня. Эван Эзар\r');
insert  into `app_quotes`(`ID`,`BODY`) values (548,'Кто не умеет управлять, тот всегда становится узурпатором. Карло Бини\r');
insert  into `app_quotes`(`ID`,`BODY`) values (549,'Никогда не доверяй подчиненному, который не находит недостатков у своего начальника. Джон Чэртон Коллинз\r');
insert  into `app_quotes`(`ID`,`BODY`) values (550,'Успехи \"Дженерал Моторс\" объясняются не столько организацией концерна, системой планирования и финансового контроля, но прежде всего, систематической подготовкой управленческих кадров. Гарольд Вольф\r');
insert  into `app_quotes`(`ID`,`BODY`) values (551,'Уже сегодня делать то, о чем другие будут думать завтра. Уинстон Черчилль\r');
insert  into `app_quotes`(`ID`,`BODY`) values (552,'Величайший прогресс в развитии производительной силы труда и значительная доля искусства, умения и сообразительности, с каким он направляется и прилагается, явились, по-видимому, следствием разделения труда. Адам Смит\r');
insert  into `app_quotes`(`ID`,`BODY`) values (553,'Вы никогда не решите проблему, пока не признаете, что она у вас есть. Харви Маккей\r');
insert  into `app_quotes`(`ID`,`BODY`) values (554,'Укрепляй веру подчиненного в важность порученного ему дела, и он сделает невозможное возможным. Неизвестный автор\r');
insert  into `app_quotes`(`ID`,`BODY`) values (555,'Организовать - это значит сначала оценить возможность, а уже потом ставить задачу. Неизвестный автор\r');
insert  into `app_quotes`(`ID`,`BODY`) values (556,'Вопрос \"Кто должен быть руководителем?\" напоминает вопрос \"Кто должен быть тенором в квартете?\". Конечно же, человек, который может петь тенором. Генри Форд\r');
insert  into `app_quotes`(`ID`,`BODY`) values (557,'Ученик никогда не превзойдет учителя, если видит в нем образец, а не соперника. Виссарион Григорьевич Белинский');

/*Table structure for table `blockly_code` */

DROP TABLE IF EXISTS `blockly_code`;

CREATE TABLE `blockly_code` (
  `ID` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `SYSTEM_NAME` varchar(255) NOT NULL DEFAULT '',
  `CODE_TYPE` int(3) NOT NULL DEFAULT '0',
  `CODE` text,
  `XML` text,
  `UPDATED` datetime DEFAULT NULL,
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM AUTO_INCREMENT=83 DEFAULT CHARSET=utf8;

/*Data for the table `blockly_code` */

insert  into `blockly_code`(`ID`,`SYSTEM_NAME`,`CODE_TYPE`,`CODE`,`XML`,`UPDATED`) values (1,'script14',0,'','','2014-09-03 12:28:53');
insert  into `blockly_code`(`ID`,`SYSTEM_NAME`,`CODE_TYPE`,`CODE`,`XML`,`UPDATED`) values (2,'method87',0,'//$params[\'t\']\r\n $this->setProperty(\"updated\",time());\r\n $this->setProperty(\"updatedTime\",date(\"H:i\",time()));\r\n $this->setProperty(\"alive\",1); \r\n \r\n$ot=$this->object_title;\r\n$alive_timeout=(int)$this->getProperty(\"aliveTimeOut\");\r\nif (!$alive_timeout) {\r\n $alive_timeout=30*60;\r\n}\r\nclearTimeOut($ot.\"_alive\");\r\nsetTimeOut($ot.\"_alive\",\"sg(\'\".$ot.\".alive\',0);\",$alive_timeout); \r\n\r\nif (!isset($params[\'h\'])) {\r\n return;\r\n}\r\n\r\n\r\n$old_temp=$this->getProperty(\'humidity\');\r\n$t=round($params[\'h\'],1);\r\n\r\nif ($t>100) return;\r\n\r\n$this->setProperty(\'humidity\',$t);\r\nif ($params[\'uptime\']) {\r\n $this->setProperty(\'uptime\',$params[\'uptime\']);\r\n}\r\n\r\nif ($t>$old_temp) {\r\n $d=1;\r\n} elseif ($t<$old_temp) {\r\n $d=-1;\r\n} else {\r\n $d=0;\r\n}\r\n$this->setProperty(\'direction\',$d);\r\n\r\n$linked_room=$this->getProperty(\"LinkedRoom\");\r\nif ($linked_room) {\r\n setGlobal($linked_room.\'.Humidity\',$t);\r\n}','','2014-09-03 13:51:53');
insert  into `blockly_code`(`ID`,`SYSTEM_NAME`,`CODE_TYPE`,`CODE`,`XML`,`UPDATED`) values (7,'script16',0,'// got data\r\n$sensor=$params[\'sensor\'];\r\nif (!$sensor) return 0;\r\n\r\n$hum=(int)str_replace(\'-\',\'\',$params[\'other_params\'][6]);\r\nif ($hum>0 && $hum<=100) {\r\n callMethod(\'hum\'.$sensor.\'.humChanged\',array(\'h\'=>$hum));\r\n}\r\n\r\n//$temp=((int)str_replace(\'-\',\'\',$params[\'other_params\'][4]))/10;\r\n$b1 =(int)str_replace(\'-\',\'\',$params[\'other_params\'][4]);\r\n$b2 =(int)str_replace(\'-\',\'\',$params[\'other_params\'][5]);\r\n$y_temp=256*($b2 & 15)+$b1;\r\nif  (($b2 & 8) != 0 ) { // отритцательное значение температуры\r\n $y_temp=4096-$y_temp;\r\n $temp = -1*($y_temp)/10;\r\n} else { // положительное значение температуры\r\n $temp = $y_temp/10;\r\n}\r\n\r\nif ($temp>-30 && $temp<=100) {\r\n callMethod(\'temp\'.$sensor.\'.tempChanged\',array(\'t\'=>$temp));\r\n}','','2014-09-03 16:07:57');
insert  into `blockly_code`(`ID`,`SYSTEM_NAME`,`CODE_TYPE`,`CODE`,`XML`,`UPDATED`) values (10,'method88',0,'$rooms=getObjectsByClass(\"Rooms\");\r\n$total=count($rooms);\r\nfor($i=0;$i<$total;$i++) {\r\n $rooms[$i][\'room\']=getGlobal($rooms[$i][\'TITLE\'].\'.Title\');\r\n if (!$rooms[$i][\'room\']) {\r\n  $rooms[$i][\'room\']=$rooms[$i][\'TITLE\'];\r\n } \r\n $rooms[$i][\'active\']=getGlobal($rooms[$i][\'TITLE\'].\'.SomebodyHere\');\r\n $rooms[$i][\'time\']=getGlobal($rooms[$i][\'TITLE\'].\'.LatestActivity\'); \r\n $rooms[$i][\'diff\']=time()-$rooms[$i][\'time\'];\r\n} \r\n\r\nfunction cmp($a, $b)\r\n{\r\n    if ($a[\'diff\'] == $b[\'diff\']) {\r\n        return 0;\r\n    }\r\n    return ($a[\'diff\'] < $b[\'diff\']) ? -1 : 1;\r\n}\r\nusort($rooms,\"cmp\");\r\n\r\nif (!$rooms[0][\'active\']) {\r\n $somebodyHomeText=\"Никого нет дома. Были в \".date(\'H:i\',$rooms[0][\'time\']).\" (\".$rooms[0][\'room\'].\")\";\r\n} else {\r\n $res_rooms=array();\r\n for($i=0;$i<$total;$i++) {\r\n  if ($rooms[$i][\'active\']) {\r\n   $res_rooms[]=$rooms[$i][\'room\'];\r\n  } \r\n }\r\n $somebodyHomeText=\"Кто-то дома: \".implode(\", \",$res_rooms); \r\n}\r\nsetGlobal(\'somebodyHomeText\',$somebodyHomeText);\r\n//echo \"Updated\";','','2014-09-04 16:05:37');
insert  into `blockly_code`(`ID`,`SYSTEM_NAME`,`CODE_TYPE`,`CODE`,`XML`,`UPDATED`) values (9,'method66',0,'$latestActivity=$this->getProperty(\'LatestActivity\');\r\n$this->setProperty(\'LatestActivity\',time());\r\n$this->setProperty(\'LatestActivityTime\',date(\'H:i\'));\r\n\r\n$this->setProperty(\'SomebodyHere\',1);\r\n$ot=$this->object_title;\r\nif ($this->getProperty(\"IdleDelay\")) {\r\n $activity_timeout=(int)$this->getProperty(\"IdleDelay\");\r\n} else {\r\n $activity_timeout=10*60;\r\n}\r\nclearTimeOut($ot.\"_activity_timeout\");\r\nsetTimeOut($ot.\"_activity_timeout\",\"callMethod(\'\".$ot.\".onIdle\');\",$activity_timeout);\r\n$this->callMethod(\"updateActivityStatus\");\r\n','','2014-09-04 16:05:03');
insert  into `blockly_code`(`ID`,`SYSTEM_NAME`,`CODE_TYPE`,`CODE`,`XML`,`UPDATED`) values (11,'method89',0,'$cmdline=\'\"c:\\Program Files\\nooLite\\nooLite.exe\" -api \'.$params[\'command\'];\r\n$last_called=gg(\'NoolightCommandSend\');\r\n$min_delay=3;\r\n$now=time();\r\nif (($now-$last_called)>$min_delay) {\r\n //safe_exec($cmdline);\r\n $last_callled=$now; \r\n sg(\'NoolightCommandSend\',$last_called);\r\n DebMes(\"Noolite instant exec: \".$cmdline);\r\n system($cmdline);\r\n //exec($cmdline);\r\n} else {\r\n if ($last_callled<$now) {\r\n  $last_callled=$now;\r\n }\r\n $last_called+=$min_delay;\r\n sg(\'NoolightCommandSend\',$last_called);\r\n DebMes(\"Noolite scheduled job for \".date(\'H:i:s\',$last_called));\r\n AddScheduledJob(\"noolight\".md5($cmdline),\"safe_exec(\'\".$cmdline.\"\');\",$last_called);\r\n}\r\n\r\n','','2014-09-04 16:11:33');
insert  into `blockly_code`(`ID`,`SYSTEM_NAME`,`CODE_TYPE`,`CODE`,`XML`,`UPDATED`) values (12,'method90',0,'$this->setProperty(\"status\",0);\r\n//safe_exec(\'\"c:\\Program Files\\nooLite\\noolite.exe\" -api -off_ch\'.$this->getProperty(\"channel\"));\r\n$this->callMethod(\"sendCommand\",array(\'command\'=>\'-off_ch\'.$this->getProperty(\"channel\")));','','2014-09-04 16:12:35');
insert  into `blockly_code`(`ID`,`SYSTEM_NAME`,`CODE_TYPE`,`CODE`,`XML`,`UPDATED`) values (13,'method91',0,'$this->setProperty(\"status\",1);\r\n$this->callMethod(\"sendCommand\",array(\'command\'=>\'-on_ch\'.$this->getProperty(\"channel\")));','','2014-09-04 16:13:08');
insert  into `blockly_code`(`ID`,`SYSTEM_NAME`,`CODE_TYPE`,`CODE`,`XML`,`UPDATED`) values (14,'method92',0,'','','2014-09-04 16:26:02');
insert  into `blockly_code`(`ID`,`SYSTEM_NAME`,`CODE_TYPE`,`CODE`,`XML`,`UPDATED`) values (15,'method93',0,'','','2014-09-04 16:26:13');
insert  into `blockly_code`(`ID`,`SYSTEM_NAME`,`CODE_TYPE`,`CODE`,`XML`,`UPDATED`) values (16,'method94',0,'','','2014-09-04 16:26:24');
insert  into `blockly_code`(`ID`,`SYSTEM_NAME`,`CODE_TYPE`,`CODE`,`XML`,`UPDATED`) values (17,'method95',0,'','','2014-09-04 16:26:34');
insert  into `blockly_code`(`ID`,`SYSTEM_NAME`,`CODE_TYPE`,`CODE`,`XML`,`UPDATED`) values (18,'method96',0,'','','2014-09-04 16:27:00');
insert  into `blockly_code`(`ID`,`SYSTEM_NAME`,`CODE_TYPE`,`CODE`,`XML`,`UPDATED`) values (72,'object17_method59',0,'$details=array();\r\n$red_state=0;\r\n$yellow_state=0;\r\n\r\n$cycles=array(\'states\'=>\'states\',\'main\'=>\'main\',\'execs\'=>\'exec\',\'scheduler\'=>\'scheduler\');\r\nforeach($cycles as $k=>$v) {\r\n $tm=getGlobal(\'ThisComputer.cycle_\'.$k.\'Run\');\r\n if (time()-$tm>5*60) {\r\n  $red_state=1;\r\n  $details[]=$v.\" \".LANG_GENERAL_CYCLE.\" \".LANG_GENERAL_STOPPED.\".\";\r\n }\r\n}\r\n\r\n$cycles=array(\'ping\'=>\'ping\',\'webvars\'=>\'webvars\',\'watchfolders\'=>\'watch folders\',\'rss\'=>\'RSS\');\r\nforeach($cycles as $k=>$v) {\r\n $tm=getGlobal(\'ThisComputer.cycle_\'.$k.\'Run\');\r\n if (time()-$tm>10*60) {\r\n  $yellow_state=1;\r\n  $details[]=$v.\" \".LANG_GENERAL_CYCLE.\" \".LANG_GENERAL_STOPPED.\".\";  \r\n }\r\n}\r\n\r\nif ($red_state) {\r\n $state=\'red\';\r\n $state_title=LANG_GENERAL_RED; \r\n} elseif ($yellow_state) {\r\n $state=\'yellow\';\r\n $state_title=LANG_GENERAL_YELLOW;  \r\n} else {\r\n $state=\'green\';\r\n $state_title=LANG_GENERAL_GREEN;   \r\n}\r\n\r\n$new_details=implode(\". \",$details);\r\nif ($this->getProperty(\"stateDetails\")!=$new_details) {\r\n $this->setProperty(\'stateDetails\',$new_details);\r\n}\r\n\r\nif ($this->getProperty(\'stateColor\')!=$state) {\r\n $this->setProperty(\'stateColor\',$state);\r\n $this->setProperty(\'stateTitle\',$state_title);\r\n if ($state!=\'green\') {\r\n  say(LANG_GENERAL_SYSTEM_STATE.\" \".LANG_GENERAL_CHANGED_TO.\" \".$state_title.\".\");\r\n  say(implode(\". \",$details));\r\n } else {\r\n  say(LANG_GENERAL_SYSTEM_STATE.\" \".LANG_GENERAL_RESTORED_TO.\" \".$state_title);\r\n }\r\n $this->callMethod(\'stateChanged\');\r\n}','','2014-10-31 15:08:11');
insert  into `blockly_code`(`ID`,`SYSTEM_NAME`,`CODE_TYPE`,`CODE`,`XML`,`UPDATED`) values (74,'pattern6',0,'','','2014-10-31 15:22:41');
insert  into `blockly_code`(`ID`,`SYSTEM_NAME`,`CODE_TYPE`,`CODE`,`XML`,`UPDATED`) values (75,'pattern5',0,'','','2014-10-31 15:22:55');
insert  into `blockly_code`(`ID`,`SYSTEM_NAME`,`CODE_TYPE`,`CODE`,`XML`,`UPDATED`) values (73,'object18_method59',0,'$details=array();\r\n$red_state=0;\r\n$yellow_state=0;\r\n\r\nif (!isOnline(\'Internet\')) {\r\n $yellow_state=1;\r\n $details[]=LANG_GENERAL_NO_INTERNET_ACCESS;\r\n}\r\n\r\nif ($red_state) {\r\n $state=\'red\';\r\n $state_title=LANG_GENERAL_RED; \r\n} elseif ($yellow_state) {\r\n $state=\'yellow\';\r\n $state_title=LANG_GENERAL_YELLOW;  \r\n} else {\r\n $state=\'green\';\r\n $state_title=LANG_GENERAL_GREEN;   \r\n}\r\n\r\n$new_details=implode(\". \",$details);\r\nif ($this->getProperty(\"stateDetails\")!=$new_details) {\r\n $this->setProperty(\'stateDetails\',$new_details);\r\n}\r\n\r\nif ($this->getProperty(\'stateColor\')!=$state) {\r\n $this->setProperty(\'stateColor\',$state);\r\n $this->setProperty(\'stateTitle\',$state_title);\r\n if ($state!=\'green\') {\r\n  say(LANG_GENERAL_COMMUNICATION_STATE.\" \".LANG_GENERAL_CHANGED_TO.\" \".$state_title.\".\");\r\n  say(implode(\". \",$details));\r\n } else {\r\n  say(LANG_GENERAL_COMMUNICATION_STATE.\" \".LANG_GENERAL_RESTORED_TO.\" \".$state_title);\r\n }\r\n $this->callMethod(\'stateChanged\');\r\n}','','2014-10-31 15:10:21');
insert  into `blockly_code`(`ID`,`SYSTEM_NAME`,`CODE_TYPE`,`CODE`,`XML`,`UPDATED`) values (60,'script15',0,'$weather.=\"Сегодня ожидается \".str_replace(\'&deg;\',\' \',getGlobal(\'weatherToday\'));\r\n$weather.=\". Завтра \".str_replace(\'&deg;\',\' \',getGlobal(\'weatherTomorrow\'));\r\n$weather.=\". Сейчас на улице \".getGlobal(\'TempOutside\').\'.\';\r\n$weather=str_replace(\'&deg;\',\'\',$weather);\r\nsay($weather,2);','','2014-10-30 15:32:00');
insert  into `blockly_code`(`ID`,`SYSTEM_NAME`,`CODE_TYPE`,`CODE`,`XML`,`UPDATED`) values (24,'method97',0,'$this->setProperty(\'updated\',time());\r\n$this->setProperty(\'updatedTime\',date(\'H:i\'));','','2014-09-04 17:34:10');
insert  into `blockly_code`(`ID`,`SYSTEM_NAME`,`CODE_TYPE`,`CODE`,`XML`,`UPDATED`) values (26,'object72_method97',0,'say(\"Нажата на пульте кнопка Цэ!\",2);','','2014-09-04 17:38:10');
insert  into `blockly_code`(`ID`,`SYSTEM_NAME`,`CODE_TYPE`,`CODE`,`XML`,`UPDATED`) values (27,'object70_method97',0,'say(\"Нажата на пульте кнопка А!\",2);','','2014-09-04 17:38:30');
insert  into `blockly_code`(`ID`,`SYSTEM_NAME`,`CODE_TYPE`,`CODE`,`XML`,`UPDATED`) values (28,'object71_method97',0,'say(\"Нажата на пульте кнопка Бэ!\",2);','','2014-09-04 17:38:48');
insert  into `blockly_code`(`ID`,`SYSTEM_NAME`,`CODE_TYPE`,`CODE`,`XML`,`UPDATED`) values (61,'script17',0,'$lastRead=getGlobal(\'lastNewsRead\');\r\n$limit=10;\r\n\r\n$items=SQLSelect(\"SELECT TITLE FROM rss_items WHERE ADDED>\'\".date(\'Y-m-d H:i:s\',$lastRead).\"\' ORDER BY ADDED DESC LIMIT $limit\");\r\n$total=count($items);\r\nif ($total==0) {\r\n $items=SQLSelect(\"SELECT TITLE FROM rss_items WHERE 1 ORDER BY ADDED DESC LIMIT 2\");\r\n $total=count($items); \r\n}\r\n\r\n$res=array_reverse($items);\r\nfor($i=0;$i<$total;$i++) {\r\n say($res[$i][\'TITLE\'],2);\r\n}\r\nsetGlobal(\'lastNewsRead\',time());','','2014-10-30 15:32:13');
insert  into `blockly_code`(`ID`,`SYSTEM_NAME`,`CODE_TYPE`,`CODE`,`XML`,`UPDATED`) values (35,'object72_method98',0,'say(\"Нажата на пульте кнопка Цэ!\",2);\r\nrunScript(\'readLatestNews\');','','2014-09-04 18:04:04');
insert  into `blockly_code`(`ID`,`SYSTEM_NAME`,`CODE_TYPE`,`CODE`,`XML`,`UPDATED`) values (63,'script18',0,'// вытягиваем историю из переменной\r\n$alreadyPlayed=gg(\"AlreadyPlayedMusic\");\r\nif (!$alreadyPlayed) {\r\n $alreadyPlayed=\'0\';\r\n}\r\n\r\n// выбираем случайную папку\r\n$rec=SQLSelectOne(\"SELECT * FROM media_favorites WHERE ID NOT IN (\".$alreadyPlayed.\") ORDER BY RAND()\");\r\n\r\nif (!$rec[\'ID\']) {\r\n // папок больше не осталось, поэтому выбираем случайную и сбрасываем истоирю\r\n $rec=SQLSelectOne(\"SELECT * FROM media_favorites ORDER BY RAND()\");\r\n $alreadyPlayed=\'0\';\r\n}\r\n\r\n\r\nif ($rec[\'ID\']) {\r\n\r\n // добавляем выбранную папку в историю\r\n $alreadyPlayed.=\',\'.$rec[\'ID\'];\r\n sg(\"AlreadyPlayedMusic\",$alreadyPlayed);\r\n\r\n // запускаем на проигрывание\r\n $collection=SQLSelectOne(\"SELECT * FROM collections WHERE ID=\".(int)$rec[\'COLLECTION_ID\']);\r\n $path=$collection[\'PATH\'].$rec[\'PATH\'];\r\n playMedia($path);\r\n //setTimeOut(\'VLCPlayer_update\',\"callMethod(\'VLCPlayer.update\');\",10);\r\n\r\n}','','2014-10-30 15:32:40');
insert  into `blockly_code`(`ID`,`SYSTEM_NAME`,`CODE_TYPE`,`CODE`,`XML`,`UPDATED`) values (62,'script19',0,'getURL(\'http://localhost/rc/?command=vlc_pause\',0);','','2014-10-30 15:32:28');
insert  into `blockly_code`(`ID`,`SYSTEM_NAME`,`CODE_TYPE`,`CODE`,`XML`,`UPDATED`) values (39,'object19_method64',0,'callMethod(\'noo1.turnOff\'); // выключаем тёплый пол\r\ncallMethod(\'noo2.turnOff\'); // выключаем бойлер на кухне','','2014-09-05 11:10:07');
insert  into `blockly_code`(`ID`,`SYSTEM_NAME`,`CODE_TYPE`,`CODE`,`XML`,`UPDATED`) values (40,'object19_method65',0,'callMethod(\'noo1.turnOn\'); // включаем тёплый пол\r\ncallMethod(\'noo2.turnOn\'); // включаем бойлер на кухне','','2014-09-05 11:10:32');
insert  into `blockly_code`(`ID`,`SYSTEM_NAME`,`CODE_TYPE`,`CODE`,`XML`,`UPDATED`) values (76,'script20',0,'say(LANG_GENERAL_SETTING_UP_LIGHTS,2);\r\n// to-do','','2014-10-31 15:25:11');
insert  into `blockly_code`(`ID`,`SYSTEM_NAME`,`CODE_TYPE`,`CODE`,`XML`,`UPDATED`) values (69,'object17_method73',0,'$details=array();\r\n$red_state=0;\r\n$yellow_state=0;\r\n\r\n$cycles=array(\'states\'=>\'states cycle\',\'main\'=>\'main cycle\',\'execs\'=>\'exec cycle\',\'scheduler\'=>\'scheduler cycle\');\r\nforeach($cycles as $k=>$v) {\r\n $tm=getGlobal(\'ThisComputer.cycle_\'.$k.\'Run\');\r\n if (time()-$tm>5*60) {\r\n  $red_state=1;\r\n  $details[]=$v.\" stopped.\";\r\n }\r\n}\r\n\r\n$cycles=array(\'ping\'=>\'ping cycle\',\'webvars\'=>\'webvars cycle\',\'watchfolders\'=>\'watch folders cycle\',\'rss\'=>\'RSS cycle\');\r\nforeach($cycles as $k=>$v) {\r\n $tm=getGlobal(\'ThisComputer.cycle_\'.$k.\'Run\');\r\n if (time()-$tm>10*60) {\r\n  $yellow_state=1;\r\n  $details[]=$v.\" stopped.\";\r\n }\r\n}\r\n\r\nif ($red_state) {\r\n $state=\'red\';\r\n $state_title=\'Red\'; \r\n} elseif ($yellow_state) {\r\n $state=\'yellow\';\r\n $state_title=\'Yellow\';  \r\n} else {\r\n $state=\'green\';\r\n $state_title=\'Green\';   \r\n}\r\n\r\n$new_details=implode(\". \",$details);\r\nif ($this->getProperty(\"stateDetails\")!=$new_details) {\r\n $this->setProperty(\'stateDetails\',$new_details);\r\n}\r\n\r\nif ($this->getProperty(\'stateColor\')!=$state) {\r\n $this->setProperty(\'stateColor\',$state);\r\n $this->setProperty(\'stateTitle\',$state_title);\r\n if ($state!=\'green\') {\r\n  say(\"System state changed to \".$state_title.\".\");\r\n  say(implode(\". \",$details));\r\n } else {\r\n  say(\"System state restored to \".$state_title);\r\n }\r\n $this->callMethod(\'stateChanged\');\r\n}','','2014-10-30 15:44:01');
insert  into `blockly_code`(`ID`,`SYSTEM_NAME`,`CODE_TYPE`,`CODE`,`XML`,`UPDATED`) values (70,'object16_method75',0,'$details=array();\r\n$red_state=0;\r\n$yellow_state=0;\r\n\r\nif ($red_state) {\r\n $state=\'red\';\r\n $state_title=LANG_GENERAL_RED; \r\n} elseif ($yellow_state) {\r\n $state=\'yellow\';\r\n $state_title=LANG_GENERAL_YELLOW;  \r\n} else {\r\n $state=\'green\';\r\n $state_title=LANG_GENERAL_GREEN;   \r\n}\r\n\r\n$new_details=implode(\". \",$details);\r\nif ($this->getProperty(\"stateDetails\")!=$new_details) {\r\n $this->setProperty(\'stateDetails\',$new_details);\r\n}\r\n\r\nif ($this->getProperty(\'stateColor\')!=$state) {\r\n $this->setProperty(\'stateColor\',$state);\r\n $this->setProperty(\'stateTitle\',$state_title);\r\n if ($state!=\'green\') {\r\n  say(LANG_GENERAL_SYSTEM_STATE.\" \".LANG_GENERAL_CHANGED_TO.\" \".$state_title.\".\");\r\n  say(implode(\". \",$details));\r\n } else {\r\n  say(LANG_GENERAL_SYSTEM_STATE.\" \".LANG_GENERAL_RESTORED_TO.\" \".$state_title);\r\n }\r\n $this->callMethod(\'stateChanged\');\r\n}','','2014-10-31 14:57:24');
insert  into `blockly_code`(`ID`,`SYSTEM_NAME`,`CODE_TYPE`,`CODE`,`XML`,`UPDATED`) values (59,'script21',0,'$res=\'\';\r\n if (gg(\'Security.stateColor\')==\'green\' && gg(\'System.stateColor\')==\'green\' && gg(\'Communication.stateColor\')==\'green\') {\r\n  $res=\'Все системы работают в штатном режиме\';\r\n } else {\r\n  if (gg(\'Security.stateColor\')!=\'green\') {\r\n   $res.=\" Проблема безопасности: \".getGlobal(\'Security.stateDetails\');\r\n  }\r\n  if (gg(\'System.stateColor\')!=\'green\') {\r\n   $res.=\" Системная проблема: \".getGlobal(\'System.stateDetails\');\r\n  }  \r\n  if (gg(\'Communication.stateColor\')!=\'green\') {\r\n   $res.=\" Проблема связи: \".getGlobal(\'Communication.stateDetails\');\r\n  }  \r\n }\r\n say($res,5);','','2014-10-30 15:31:46');
insert  into `blockly_code`(`ID`,`SYSTEM_NAME`,`CODE_TYPE`,`CODE`,`XML`,`UPDATED`) values (48,'script1',0,'say(getRandomLine(\'morning\'),2);\r\n//runScript(\'readWunderTasks\');\r\nrunScript(\'readWeatherToday\');\r\nrunScript(\'reportStatus\');','<xml xmlns=\"http://www.w3.org/1999/xhtml\">\r\n  <block type=\"majordomo_say\" inline=\"false\" x=\"140\" y=\"51\">\r\n    <value name=\"TEXT\">\r\n      <block type=\"text\">\r\n        <title name=\"TEXT\">Good morning!</title>\r\n      </block>\r\n    </value>\r\n    <next>\r\n      <block type=\"controls_if\" inline=\"false\">\r\n        <value name=\"IF0\">\r\n          <block type=\"logic_negate\" inline=\"false\">\r\n            <value name=\"BOOL\">\r\n              <block type=\"majordomo_getglobal\">\r\n                <title name=\"TEXT\">ThisComputer.WeHaveGuests</title>\r\n              </block>\r\n            </value>\r\n          </block>\r\n        </value>\r\n        <statement name=\"DO0\">\r\n          <block type=\"majordomo_runscript\" inline=\"false\">\r\n            <title name=\"TEXT\">sayTodayAgenda</title>\r\n            <next>\r\n              <block type=\"majordomo_runscript\" inline=\"false\">\r\n                <title name=\"TEXT\">playFavoriteMusic</title>\r\n              </block>\r\n            </next>\r\n          </block>\r\n        </statement>\r\n      </block>\r\n    </next>\r\n  </block>\r\n</xml>','2014-09-05 12:30:58');
insert  into `blockly_code`(`ID`,`SYSTEM_NAME`,`CODE_TYPE`,`CODE`,`XML`,`UPDATED`) values (47,'script13',0,'say(getRandomLine(\'evening\'),2);\r\nrunScript(\'reportStatus\');','<xml xmlns=\"http://www.w3.org/1999/xhtml\">\r\n  <block type=\"majordomo_say\" inline=\"false\" x=\"140\" y=\"51\">\r\n    <value name=\"TEXT\">\r\n      <block type=\"text\">\r\n        <title name=\"TEXT\">Good morning!</title>\r\n      </block>\r\n    </value>\r\n    <next>\r\n      <block type=\"controls_if\" inline=\"false\">\r\n        <value name=\"IF0\">\r\n          <block type=\"logic_negate\" inline=\"false\">\r\n            <value name=\"BOOL\">\r\n              <block type=\"majordomo_getglobal\">\r\n                <title name=\"TEXT\">ThisComputer.WeHaveGuests</title>\r\n              </block>\r\n            </value>\r\n          </block>\r\n        </value>\r\n        <statement name=\"DO0\">\r\n          <block type=\"majordomo_runscript\" inline=\"false\">\r\n            <title name=\"TEXT\">sayTodayAgenda</title>\r\n            <next>\r\n              <block type=\"majordomo_runscript\" inline=\"false\">\r\n                <title name=\"TEXT\">playFavoriteMusic</title>\r\n              </block>\r\n            </next>\r\n          </block>\r\n        </statement>\r\n      </block>\r\n    </next>\r\n  </block>\r\n</xml>','2014-09-05 12:30:34');
insert  into `blockly_code`(`ID`,`SYSTEM_NAME`,`CODE_TYPE`,`CODE`,`XML`,`UPDATED`) values (52,'script12',0,'$id=$params[\'rcswitch\'];\r\nif ($id==\'12345\') {\r\n //sensor 1\r\n}','','2014-10-30 15:10:27');
insert  into `blockly_code`(`ID`,`SYSTEM_NAME`,`CODE_TYPE`,`CODE`,`XML`,`UPDATED`) values (54,'object8_method',0,'','','2014-10-30 15:29:14');
insert  into `blockly_code`(`ID`,`SYSTEM_NAME`,`CODE_TYPE`,`CODE`,`XML`,`UPDATED`) values (55,'object7_method',0,'','','2014-10-30 15:29:39');
insert  into `blockly_code`(`ID`,`SYSTEM_NAME`,`CODE_TYPE`,`CODE`,`XML`,`UPDATED`) values (56,'object6_method',0,'','','2014-10-30 15:30:05');
insert  into `blockly_code`(`ID`,`SYSTEM_NAME`,`CODE_TYPE`,`CODE`,`XML`,`UPDATED`) values (57,'object5_method',0,'','','2014-10-30 15:30:17');
insert  into `blockly_code`(`ID`,`SYSTEM_NAME`,`CODE_TYPE`,`CODE`,`XML`,`UPDATED`) values (58,'object1_method',0,'','','2014-10-30 15:30:59');
insert  into `blockly_code`(`ID`,`SYSTEM_NAME`,`CODE_TYPE`,`CODE`,`XML`,`UPDATED`) values (67,'script22',1,'runScript(\"reportStatus\", array());\r\n','<xml xmlns=\"http://www.w3.org/1999/xhtml\">\r\n  <block type=\"majordomo_script_21\" id=\"7\" inline=\"true\" x=\"148\" y=\"87\"></block>\r\n</xml>','2014-10-30 15:35:12');
insert  into `blockly_code`(`ID`,`SYSTEM_NAME`,`CODE_TYPE`,`CODE`,`XML`,`UPDATED`) values (66,'method62',0,'$this->setProperty(\'status\',$params[\'status\']); // выставляем статус сенсора\r\n$this->setProperty(\'updatedTimestamp\',time()); // выставляем время срабатывания сенсора\r\n\r\n$this->setProperty(\'alive\',1);\r\n$ot=$this->object_title;\r\n$alive_timeout=(int)$this->getProperty(\"aliveTimeOut\");\r\nif (!$alive_timeout) {\r\n $alive_timeout=24*60*60;\r\n}\r\nclearTimeOut($ot.\"_alive\");\r\nsetTimeOut($ot.\"_alive\",\"sg(\'\".$ot.\".alive\',0);\",$alive_timeout);\r\n\r\nif ($params[\'status\']) {\r\n \r\n $this->setProperty(\'motionDetected\',1);\r\n clearTimeOut($this->object_title.\'_detected\'); \r\n setTimeOut($this->object_title.\'_detected\',\"setGlobal(\'\".$this->object_title.\".motionDetected\',0);\",30);\r\n\r\n $linked_room=$this->getProperty(\'LinkedRoom\');\r\n if ($linked_room!=\'\') {\r\n  callMethod($linked_room.\'.onActivity\');\r\n }\r\n\r\n if ($this->object_title==\'sensorMovement3\' || $this->object_title==\'sensorMovementRemote1\' || $this->object_title==\'sensorMovementRemote2\') {\r\n  //|| $this->object_title==\'sensorMovement5\'\r\n  return; // не реагируем на движение в спальне, по ip-сенсорам и по сенсору на втром этаже\r\n }\r\n\r\n ClearTimeOut(\"nobodyHome\"); \r\n SetTimeOut(\"nobodyHome\",\"callMethod(\'NobodyHomeMode.activate\');\", 1*60*60); // выполняем если целый час никого не было\r\n\r\n if (getGlobal(\'NobodyHomeMode.active\')) {\r\n  callMethod(\'NobodyHomeMode.deactivate\');\r\n }\r\n\r\n $last_register=registeredEventTime(\'inhouseMovement\'); // проверяем когда в последний раз срабатывало событие \"движение внутри дома\"\r\n  registerEvent(\'inhouseMovement\',$this->name,2); // регистрируем событие \"движение внутри дома\" \r\n  if (timeBetween(\'05:00\', \'12:00\') && ((time()-$last_register)>2*60*60)) {\r\n   runScript(\'Greeting\'); // запускаем скрипт \"доброе утро\"\r\n  }\r\n}','','2014-10-30 15:34:47');
insert  into `blockly_code`(`ID`,`SYSTEM_NAME`,`CODE_TYPE`,`CODE`,`XML`,`UPDATED`) values (68,'object6_method18',0,'$h=(int)date(\'G\',time());\r\n$m=date(\'i\',time());\r\n\r\n\r\nif (isWeekDay()) {\r\n\r\n}\r\n\r\n\r\nif (($h>=8) && getGlobal(\'clockChimeEnabled\')) {\r\n if ($m==\"00\") {\r\n   say(timeNow(),1);\r\n }\r\n}\r\n\r\n\r\nsetGlobal(\'timeNow\',date(\'H:i\'));\r\n\r\n$homeStatus=date(\'H:i\');\r\nif (getGlobal(\'NobodyHomeMode.active\')) {\r\n $homeStatus.=\' Дома никого\';\r\n} else {\r\n $homeStatus.=\' Дома кто-то есть\';\r\n}\r\n\r\n$homeStatus.=\' \'.getGlobal(\'Security.stateDetails\');\r\n$homeStatus.=\' \'.getGlobal(\'System.stateDetails\');\r\n$homeStatus.=\' \'.getGlobal(\'Communication.stateDetails\');\r\nsetGlobal(\'HomeStatus\',$homeStatus);\r\n\r\n if (timeBetween(getGlobal(\'SunRiseTime\'),getGlobal(\'SunSetTime\')) && getGlobal(\'isDark\')==\"1\") {\r\n  setGlobal(\"isDark\",0);\r\n  callMethod(\'DarknessMode.deactivate\');  \r\n } elseif (!timeBetween(getGlobal(\'SunRiseTime\'),getGlobal(\'SunSetTime\')) && getGlobal(\'isDark\')!=\"1\") {\r\n  setGlobal(\"isDark\",1);\r\n  callMethod(\'DarknessMode.activate\');    \r\n }\r\n \r\n  if (timeIs(getGlobal(\'SunRiseTime\'))) {\r\n  say(\'Всходит солнце\');\r\n }\r\n if (timeIs(getGlobal(\'SunSetTime\'))) {\r\n  say(\'Солнце заходит\',2);\r\n }\r\n \r\nif (timeIs(\"23:30\") && (gg(\"EconomMode.active\")!=\"1\") && (gg(\"NobodyHomeMode.active\")==\"1\")) {\r\n say(\"Похоже никого нет сегодня, можно сэкономить немного.\");\r\n callMethod(\'EconomMode.activate\');\r\n}\r\n\r\nif (timeIs(\'20:00\')) {\r\n callMethod(\'NightMode.activate\');\r\n} elseif (timeIs(\'08:00\')) {\r\n callMethod(\'NightMode.deactivate\');\r\n}\r\n\r\nif (timeIs(\"03:00\")) {\r\n runScript(\"systemMaintenance\");\r\n}\r\n\r\nif (gg(\'ThisComputer.AlarmStatus\') && timeIs(gg(\'ThisComputer.AlarmTime\'))) {\r\n runScript(\'MorningAlarm\');\r\n}','','2014-10-30 15:38:26');
insert  into `blockly_code`(`ID`,`SYSTEM_NAME`,`CODE_TYPE`,`CODE`,`XML`,`UPDATED`) values (71,'object16_method59',0,'$details=array();\r\n$red_state=0;\r\n$yellow_state=0;\r\n\r\nif ($red_state) {\r\n $state=\'red\';\r\n $state_title=LANG_GENERAL_RED; \r\n} elseif ($yellow_state) {\r\n $state=\'yellow\';\r\n $state_title=LANG_GENERAL_YELLOW;  \r\n} else {\r\n $state=\'green\';\r\n $state_title=LANG_GENERAL_GREEN;   \r\n}\r\n\r\n$new_details=implode(\". \",$details);\r\nif ($this->getProperty(\"stateDetails\")!=$new_details) {\r\n $this->setProperty(\'stateDetails\',$new_details);\r\n}\r\n\r\nif ($this->getProperty(\'stateColor\')!=$state) {\r\n $this->setProperty(\'stateColor\',$state);\r\n $this->setProperty(\'stateTitle\',$state_title);\r\n if ($state!=\'green\') {\r\n  say(LANG_GENERAL_SECURITY_STATE.\" \".LANG_GENERAL_CHANGED_TO.\" \".$state_title.\".\");\r\n  say(implode(\". \",$details));\r\n } else {\r\n  say(LANG_GENERAL_SECURITY_STATE.\" \".LANG_GENERAL_RESTORED_TO.\" \".$state_title);\r\n }\r\n $this->callMethod(\'stateChanged\');\r\n}','','2014-10-31 15:02:09');
insert  into `blockly_code`(`ID`,`SYSTEM_NAME`,`CODE_TYPE`,`CODE`,`XML`,`UPDATED`) values (78,'object18_method74',0,'$details=array();\r\n$red_state=0;\r\n$yellow_state=0;\r\n\r\nif (!isOnline(\'Internet\')) {\r\n $yellow_state=1;\r\n $details[]=LANG_GENERAL_NO_INTERNET_ACCESS;\r\n}\r\n\r\nif ($red_state) {\r\n $state=\'red\';\r\n $state_title=LANG_GENERAL_RED; \r\n} elseif ($yellow_state) {\r\n $state=\'yellow\';\r\n $state_title=LANG_GENERAL_YELLOW;  \r\n} else {\r\n $state=\'green\';\r\n $state_title=LANG_GENERAL_GREEN;   \r\n}\r\n\r\n$new_details=implode(\". \",$details);\r\nif ($this->getProperty(\"stateDetails\")!=$new_details) {\r\n $this->setProperty(\'stateDetails\',$new_details);\r\n}\r\n\r\nif ($this->getProperty(\'stateColor\')!=$state) {\r\n $this->setProperty(\'stateColor\',$state);\r\n $this->setProperty(\'stateTitle\',$state_title);\r\n if ($state!=\'green\') {\r\n  say(LANG_GENERAL_COMMUNICATION_STATE.\" \".LANG_GENERAL_CHANGED_TO.\" \".$state_title.\".\");\r\n  say(implode(\". \",$details));\r\n } else {\r\n  say(LANG_GENERAL_COMMUNICATION_STATE.\" \".LANG_GENERAL_RESTORED_TO.\" \".$state_title);\r\n }\r\n $this->callMethod(\'stateChanged\');\r\n}','','2014-10-31 15:33:53');
insert  into `blockly_code`(`ID`,`SYSTEM_NAME`,`CODE_TYPE`,`CODE`,`XML`,`UPDATED`) values (80,'pattern8',0,'','','2014-10-31 15:38:58');
insert  into `blockly_code`(`ID`,`SYSTEM_NAME`,`CODE_TYPE`,`CODE`,`XML`,`UPDATED`) values (81,'pattern9',0,'','','2014-10-31 15:39:25');
insert  into `blockly_code`(`ID`,`SYSTEM_NAME`,`CODE_TYPE`,`CODE`,`XML`,`UPDATED`) values (82,'method61',0,'if ($params[\'status\']) {\r\n $this->setProperty(\'status\',$params[\'status\']);\r\n}\r\n$this->setProperty(\'updatedTimestamp\',time());\r\n\r\n$this->setProperty(\"alive\",1);\r\n$ot=$this->object_title;\r\n$alive_timeout=(int)$this->getProperty(\"aliveTimeOut\");\r\nif (!$alive_timeout) {\r\n $alive_timeout=12*60*60;\r\n}\r\nclearTimeOut($ot.\"_alive\");\r\nsetTimeOut($ot.\"_alive\",\"sg(\'\".$ot.\".alive\',0);\",$alive_timeout);','','2015-01-29 11:29:50');

/*Table structure for table `btdevices` */

DROP TABLE IF EXISTS `btdevices`;

CREATE TABLE `btdevices` (
  `ID` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `TITLE` varchar(255) NOT NULL DEFAULT '',
  `MAC` varchar(255) NOT NULL DEFAULT '',
  `LOG` text NOT NULL,
  `LAST_FOUND` datetime DEFAULT NULL,
  `FIRST_FOUND` datetime DEFAULT NULL,
  `USER_ID` int(10) NOT NULL DEFAULT '0',
  `SCRIPT_ID` int(10) NOT NULL DEFAULT '0',
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM AUTO_INCREMENT=2 DEFAULT CHARSET=utf8;

/*Data for the table `btdevices` */

/*Table structure for table `calendar_categories` */

DROP TABLE IF EXISTS `calendar_categories`;

CREATE TABLE `calendar_categories` (
  `ID` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `TITLE` varchar(255) NOT NULL DEFAULT '',
  `ACTIVE` int(255) NOT NULL DEFAULT '0',
  `PRIORITY` int(10) NOT NULL DEFAULT '0',
  `ICON` varchar(70) NOT NULL DEFAULT '',
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

/*Data for the table `calendar_categories` */

/*Table structure for table `calendar_events` */

DROP TABLE IF EXISTS `calendar_events`;

CREATE TABLE `calendar_events` (
  `ID` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `TITLE` varchar(255) NOT NULL DEFAULT '',
  `SYSTEM` varchar(255) NOT NULL DEFAULT '',
  `NOTES` text,
  `DUE` date DEFAULT NULL,
  `ADDED` datetime DEFAULT NULL,
  `DONE_WHEN` datetime DEFAULT NULL,
  `IS_TASK` int(3) NOT NULL DEFAULT '0',
  `IS_DONE` int(3) NOT NULL DEFAULT '0',
  `IS_NODATE` int(3) NOT NULL DEFAULT '0',
  `IS_REPEATING` int(3) NOT NULL DEFAULT '0',
  `REPEAT_TYPE` int(3) NOT NULL DEFAULT '0',
  `WEEK_DAYS` varchar(255) NOT NULL DEFAULT '',
  `IS_REPEATING_AFTER` int(3) NOT NULL DEFAULT '0',
  `REPEAT_IN` int(10) NOT NULL DEFAULT '0',
  `USER_ID` int(10) NOT NULL DEFAULT '0',
  `LOCATION_ID` int(10) NOT NULL DEFAULT '0',
  `CALENDAR_CATEGORY_ID` int(10) NOT NULL DEFAULT '0',
  `DONE_SCRIPT_ID` int(10) NOT NULL DEFAULT '0',
  `DONE_CODE` text,
  `LOG` text,
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

/*Data for the table `calendar_events` */

/*Table structure for table `classes` */

DROP TABLE IF EXISTS `classes`;

CREATE TABLE `classes` (
  `ID` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `TITLE` varchar(255) NOT NULL DEFAULT '',
  `PARENT_ID` int(10) NOT NULL DEFAULT '0',
  `SUB_LIST` text,
  `PARENT_LIST` text,
  `NOLOG` int(3) NOT NULL DEFAULT '0',
  `DESCRIPTION` text,
  PRIMARY KEY (`ID`),
  KEY `PARENT_ID` (`PARENT_ID`)
) ENGINE=MyISAM AUTO_INCREMENT=34 DEFAULT CHARSET=utf8;

/*Data for the table `classes` */

insert  into `classes`(`ID`,`TITLE`,`PARENT_ID`,`SUB_LIST`,`PARENT_LIST`,`NOLOG`,`DESCRIPTION`) values (12,'Skype',0,'12','0',0,'');
insert  into `classes`(`ID`,`TITLE`,`PARENT_ID`,`SUB_LIST`,`PARENT_LIST`,`NOLOG`,`DESCRIPTION`) values (19,'tempSensors',0,'19','0',0,'');
insert  into `classes`(`ID`,`TITLE`,`PARENT_ID`,`SUB_LIST`,`PARENT_LIST`,`NOLOG`,`DESCRIPTION`) values (7,'Timer',0,'7','0',1,'');
insert  into `classes`(`ID`,`TITLE`,`PARENT_ID`,`SUB_LIST`,`PARENT_LIST`,`NOLOG`,`DESCRIPTION`) values (18,'BlueToothDevice',0,'18','0',0,'');
insert  into `classes`(`ID`,`TITLE`,`PARENT_ID`,`SUB_LIST`,`PARENT_LIST`,`NOLOG`,`DESCRIPTION`) values (9,'USBDevice',0,'9','0',0,'');
insert  into `classes`(`ID`,`TITLE`,`PARENT_ID`,`SUB_LIST`,`PARENT_LIST`,`NOLOG`,`DESCRIPTION`) values (10,'Computer',0,'10','0',0,'');
insert  into `classes`(`ID`,`TITLE`,`PARENT_ID`,`SUB_LIST`,`PARENT_LIST`,`NOLOG`,`DESCRIPTION`) values (20,'WeatherStations',0,'20','0',0,'');
insert  into `classes`(`ID`,`TITLE`,`PARENT_ID`,`SUB_LIST`,`PARENT_LIST`,`NOLOG`,`DESCRIPTION`) values (21,'systemStates',0,'21','0',0,'');
insert  into `classes`(`ID`,`TITLE`,`PARENT_ID`,`SUB_LIST`,`PARENT_LIST`,`NOLOG`,`DESCRIPTION`) values (22,'keySensors',0,'23','0',0,'');
insert  into `classes`(`ID`,`TITLE`,`PARENT_ID`,`SUB_LIST`,`PARENT_LIST`,`NOLOG`,`DESCRIPTION`) values (23,'inhouseMovementSensors',22,'23','22',0,'');
insert  into `classes`(`ID`,`TITLE`,`PARENT_ID`,`SUB_LIST`,`PARENT_LIST`,`NOLOG`,`DESCRIPTION`) values (24,'OperationalModes',0,'24','0',0,'');
insert  into `classes`(`ID`,`TITLE`,`PARENT_ID`,`SUB_LIST`,`PARENT_LIST`,`NOLOG`,`DESCRIPTION`) values (25,'Rooms',0,'25','0',0,'');
insert  into `classes`(`ID`,`TITLE`,`PARENT_ID`,`SUB_LIST`,`PARENT_LIST`,`NOLOG`,`DESCRIPTION`) values (26,'Relays',0,'29,31','0',0,'');
insert  into `classes`(`ID`,`TITLE`,`PARENT_ID`,`SUB_LIST`,`PARENT_LIST`,`NOLOG`,`DESCRIPTION`) values (29,'RCSwitches',26,'29','26',0,'');
insert  into `classes`(`ID`,`TITLE`,`PARENT_ID`,`SUB_LIST`,`PARENT_LIST`,`NOLOG`,`DESCRIPTION`) values (30,'humiditySensors',0,'30','0',0,'Humidity Sensors');
insert  into `classes`(`ID`,`TITLE`,`PARENT_ID`,`SUB_LIST`,`PARENT_LIST`,`NOLOG`,`DESCRIPTION`) values (31,'Noolight',26,'31','26',0,'');
insert  into `classes`(`ID`,`TITLE`,`PARENT_ID`,`SUB_LIST`,`PARENT_LIST`,`NOLOG`,`DESCRIPTION`) values (32,'Users',0,'32','0',0,'');

/*Table structure for table `collections` */

DROP TABLE IF EXISTS `collections`;

CREATE TABLE `collections` (
  `ID` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `PATH` varchar(255) NOT NULL DEFAULT '',
  `TITLE` varchar(255) NOT NULL DEFAULT '',
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM AUTO_INCREMENT=10 DEFAULT CHARSET=utf8;

/*Data for the table `collections` */

/*Table structure for table `commands` */

DROP TABLE IF EXISTS `commands`;

CREATE TABLE `commands` (
  `ID` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `TITLE` varchar(255) NOT NULL DEFAULT '',
  `COMMAND` varchar(255) NOT NULL DEFAULT '',
  `URL` varchar(255) NOT NULL DEFAULT '',
  `WIDTH` int(10) NOT NULL DEFAULT '0',
  `HEIGHT` int(10) NOT NULL DEFAULT '0',
  `PARENT_ID` int(10) NOT NULL DEFAULT '0',
  `SUB_LIST` text,
  `PARENT_LIST` text,
  `PRIORITY` int(10) NOT NULL DEFAULT '0',
  `WINDOW` varchar(255) NOT NULL DEFAULT '',
  `AUTOSTART` int(3) NOT NULL DEFAULT '0',
  `TYPE` char(50) NOT NULL DEFAULT '',
  `MIN_VALUE` float NOT NULL DEFAULT '0',
  `MAX_VALUE` float NOT NULL DEFAULT '0',
  `CUR_VALUE` varchar(255) NOT NULL DEFAULT '',
  `STEP_VALUE` float NOT NULL DEFAULT '0',
  `LINKED_OBJECT` varchar(255) NOT NULL DEFAULT '',
  `LINKED_PROPERTY` varchar(255) NOT NULL DEFAULT '',
  `ONCHANGE_OBJECT` varchar(255) NOT NULL DEFAULT '',
  `ONCHANGE_METHOD` varchar(255) NOT NULL DEFAULT '',
  `ICON` varchar(50) NOT NULL DEFAULT '',
  `DATA` text,
  `SCRIPT_ID` int(10) NOT NULL DEFAULT '0',
  `AUTO_UPDATE` int(10) NOT NULL DEFAULT '0',
  `CODE` text,
  `SYSTEM` varchar(255) NOT NULL DEFAULT '',
  `EXT_ID` int(10) NOT NULL DEFAULT '0',
  `VISIBLE_DELAY` int(10) NOT NULL DEFAULT '0',
  `INLINE` int(3) NOT NULL DEFAULT '0',
  `SUB_PRELOAD` int(3) NOT NULL DEFAULT '0',
  `RENDER_TITLE` varchar(255) NOT NULL DEFAULT '',
  `RENDER_DATA` text,
  `RENDER_UPDATED` datetime DEFAULT NULL,
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM AUTO_INCREMENT=118 DEFAULT CHARSET=utf8;

/*Data for the table `commands` */

insert  into `commands`(`ID`,`TITLE`,`COMMAND`,`URL`,`WIDTH`,`HEIGHT`,`PARENT_ID`,`SUB_LIST`,`PARENT_LIST`,`PRIORITY`,`WINDOW`,`AUTOSTART`,`TYPE`,`MIN_VALUE`,`MAX_VALUE`,`CUR_VALUE`,`STEP_VALUE`,`LINKED_OBJECT`,`LINKED_PROPERTY`,`ONCHANGE_OBJECT`,`ONCHANGE_METHOD`,`ICON`,`DATA`,`SCRIPT_ID`,`AUTO_UPDATE`,`CODE`,`SYSTEM`,`EXT_ID`,`VISIBLE_DELAY`,`INLINE`,`SUB_PRELOAD`,`RENDER_TITLE`,`RENDER_DATA`,`RENDER_UPDATED`) values (1,'<#LANG_APP_MEDIA_BROWSER#>','','',0,0,0,'2,3','0',6000,'',0,'',0,0,'0',0,'','','','','1_iPhone_MUSIC_5_sm.png','',0,0,'','',0,0,0,0,'Медиа','','2015-05-15 22:53:14');
insert  into `commands`(`ID`,`TITLE`,`COMMAND`,`URL`,`WIDTH`,`HEIGHT`,`PARENT_ID`,`SUB_LIST`,`PARENT_LIST`,`PRIORITY`,`WINDOW`,`AUTOSTART`,`TYPE`,`MIN_VALUE`,`MAX_VALUE`,`CUR_VALUE`,`STEP_VALUE`,`LINKED_OBJECT`,`LINKED_PROPERTY`,`ONCHANGE_OBJECT`,`ONCHANGE_METHOD`,`ICON`,`DATA`,`SCRIPT_ID`,`AUTO_UPDATE`,`CODE`,`SYSTEM`,`EXT_ID`,`VISIBLE_DELAY`,`INLINE`,`SUB_PRELOAD`,`RENDER_TITLE`,`RENDER_DATA`,`RENDER_UPDATED`) values (2,'Browse','','/popup/app_mediabrowser.html',0,0,1,'2','1',100,'',0,'url',0,0,'0',0,'','','','','','',0,0,'','',0,0,0,0,'Browse','','2014-07-15 21:13:34');
insert  into `commands`(`ID`,`TITLE`,`COMMAND`,`URL`,`WIDTH`,`HEIGHT`,`PARENT_ID`,`SUB_LIST`,`PARENT_LIST`,`PRIORITY`,`WINDOW`,`AUTOSTART`,`TYPE`,`MIN_VALUE`,`MAX_VALUE`,`CUR_VALUE`,`STEP_VALUE`,`LINKED_OBJECT`,`LINKED_PROPERTY`,`ONCHANGE_OBJECT`,`ONCHANGE_METHOD`,`ICON`,`DATA`,`SCRIPT_ID`,`AUTO_UPDATE`,`CODE`,`SYSTEM`,`EXT_ID`,`VISIBLE_DELAY`,`INLINE`,`SUB_PRELOAD`,`RENDER_TITLE`,`RENDER_DATA`,`RENDER_UPDATED`) values (3,'Player control','','',0,0,1,'3','1',90,'',0,'custom',0,0,'0',0,'','','','','','[#module name=\"app_player\" mode=\"menu\"#]',0,0,'','',0,0,0,0,'Player control','<!-- begin of file inner_code --><!-- begin of file ./templates/app_player/app_player.html -->\r\n\r\n<!-- Frontend -->\r\n \r\n<script language=\"javascript\">\r\n function playerCommandProcessed(id, data) {\r\n  var elem=document.getElementById(\'playerStatus\');\r\n  elem.innerHTML=data;  \r\n  return false;\r\n }\r\n function playerCommand(pcmd) {\r\n  if ($(\"#selPlayTerminal\").val()==\'\') return false;\r\n  if ($(\"#hidPlayPath\").val()==\'\' && pcmd==\'refresh\') return false;\r\n  var elem=document.getElementById(\'playerStatus\');\r\n  elem.innerHTML=pcmd+\'...\';\r\n  var url=\"/popup/app_player.html?ajax=1\";\r\n  url+=\'&command=\'+pcmd;\r\n  url+=\'&play_terminal=\'+$(\"#selPlayTerminal\").val();\r\n  url+=\'&play=\'+URLencode($(\"#hidPlayPath\").val());\r\n  url+=\'&rnd=\'+URLencode($(\"#hidPlayerRnd\").val());\r\n  if (pcmd==\'volume\') {\r\n   url+=\'&volume=\'+URLencode($(\"#selVolume\").val());\r\n  }\r\n  //prompt(url, url);\r\n  AJAXRequest(url, \'playerCommandProcessed\', \'\');\r\n  return false;\r\n }\r\n</script>\r\n<table border=\"0\" cellpadding=\"0\" cellspacing=\"0\">\r\n <tr>\r\n  <form action=\"/nf.php?pd=pz_pz_YXBwbGljYXRpb246e2FjdGlvbj1tZW51fQ%3D%3Dpz_&md=app_player&inst=&\" method=\"get\" name=\"frmPlayerControl\" id=\"frmPlayerControl\">\r\n  <td align=\"right\" style=\"vertical-align:middle\">\r\n  <div style=\"display:none\">\r\n   <select name=\"play_terminal\" id=\"selPlayTerminal\">\r\n    <option value=\"\">\r\n    \r\n    <option value=\"MAIN\" selected>Server\r\n    \r\n   </select>\r\n  </div>\r\n   <div id=\'playerStatus\' style=\"color:white\"></div>\r\n\r\n  </td>\r\n  </tr><tr>\r\n  <td nowrap><select name=\"volume\" id=\'selVolume\' onChange=\"playerCommand(\'volume\')\">\r\n   \r\n   <option value=\"0\">0%\r\n   \r\n   <option value=\"5\">5%\r\n   \r\n   <option value=\"10\">10%\r\n   \r\n   <option value=\"15\">15%\r\n   \r\n   <option value=\"20\">20%\r\n   \r\n   <option value=\"25\">25%\r\n   \r\n   <option value=\"30\">30%\r\n   \r\n   <option value=\"35\">35%\r\n   \r\n   <option value=\"40\">40%\r\n   \r\n   <option value=\"45\">45%\r\n   \r\n   <option value=\"50\">50%\r\n   \r\n   <option value=\"55\">55%\r\n   \r\n   <option value=\"60\">60%\r\n   \r\n   <option value=\"65\">65%\r\n   \r\n   <option value=\"70\">70%\r\n   \r\n   <option value=\"75\">75%\r\n   \r\n   <option value=\"80\">80%\r\n   \r\n   <option value=\"85\">85%\r\n   \r\n   <option value=\"90\" selected>90%\r\n   \r\n   <option value=\"95\">95%\r\n   \r\n   <option value=\"100\">100%\r\n   \r\n  </select></td>\r\n  <td valign=\"top\">\r\n   <div style=\"float:left;width:48px;height:48px;text-align:center\"><a href=\"#\" onClick=\'return playerCommand(\"pause\");\' style=\"padding:0;margin:0;display:inline;\"><img src=\"/img/icons/playback_pause.png\" border=\"0\"></a></div>\r\n   <div style=\"float:left;width:48px;height:48px;text-align:center\"><a href=\"#\" onClick=\'return playerCommand(\"prev\");\' style=\"padding:0;margin:0;display:inline;\"><img src=\"/img/icons/playback_prev.png\" border=\"0\"></a></div>\r\n   <div style=\"float:left;width:48px;height:48px;text-align:center\"><a href=\"#\" onClick=\'return playerCommand(\"refresh\");\' style=\"padding:0;margin:0;display:inline;\"><img src=\"/img/icons/playback_play.png\" border=\"0\"></a></div> \r\n   <div style=\"float:left;width:48px;height:48px;text-align:center\"><a href=\"#\" onClick=\'return playerCommand(\"next\");\' style=\"padding:0;margin:0;display:inline;\"><img src=\"/img/icons/playback_next.png\" border=\"0\"></a></div>\r\n   <div style=\"float:left;width:48px;height:48px;text-align:center\"><a href=\"#\" onClick=\'return playerCommand(\"fullscreen\");\' style=\"padding:0;margin:0;display:inline;\"><img src=\"/img/icons/eye.png\" border=\"0\"></a></div>\r\n   <div style=\"float:left;width:48px;height:48px;text-align:center\"><a href=\"#\" onClick=\'return playerCommand(\"close\");\' style=\"padding:0;margin:0;display:inline;\"><img src=\"/img/icons/delete.png\" border=\"0\"></a></div>\r\n  </td>\r\n </tr>\r\n <input type=\"hidden\" name=\"play\" value=\"\" id=\"hidPlayPath\">\r\n <input type=\"hidden\" name=\"rnd\" value=\"\" id=\"hidPlayerRnd\">\r\n <input type=\"hidden\" name=\"pd\" value=\"pz_pz_YXBwbGljYXRpb246e2FjdGlvbj1tZW51fQ%3D%3Dpz_\">\n<input type=\"hidden\" name=\"md\" value=\"app_player\">\n<input type=\"hidden\" name=\"inst\" value=\"\">\n</FORM><!-- modified -->\r\n</table>\r\n\r\n\r\n\r\n<!-- end of file ./templates/app_player/app_player.html --><!-- end of file inner_code -->','2015-05-15 23:16:39');
insert  into `commands`(`ID`,`TITLE`,`COMMAND`,`URL`,`WIDTH`,`HEIGHT`,`PARENT_ID`,`SUB_LIST`,`PARENT_LIST`,`PRIORITY`,`WINDOW`,`AUTOSTART`,`TYPE`,`MIN_VALUE`,`MAX_VALUE`,`CUR_VALUE`,`STEP_VALUE`,`LINKED_OBJECT`,`LINKED_PROPERTY`,`ONCHANGE_OBJECT`,`ONCHANGE_METHOD`,`ICON`,`DATA`,`SCRIPT_ID`,`AUTO_UPDATE`,`CODE`,`SYSTEM`,`EXT_ID`,`VISIBLE_DELAY`,`INLINE`,`SUB_PRELOAD`,`RENDER_TITLE`,`RENDER_DATA`,`RENDER_UPDATED`) values (75,'<#LANG_MODULE_LAYOUTS#>','','',0,0,86,'75','86',1000,'',0,'custom',0,0,'0',0,'','','','','','[#module name=\"layouts\"#]',0,60,'','',0,0,0,0,'<#LANG_MODULE_LAYOUTS#>','<!-- begin of file inner_code --><!-- begin of file ./templates/layouts/layouts.html -->\r\n\r\n\r\n<!-- Frontend -->\r\n \r\n\r\n <!-- action usual -->\r\n <!-- table layouts search -->\r\n \r\n  <!-- results -->\r\n\r\n\r\n<ul data-role=\"listview\">\r\n\r\n <li>\r\n  \r\n  <a href=\"/page/8.html\" target=_blank>Добро пожаловать!</a>\r\n  \r\n  \r\n  \r\n  </li>\r\n\r\n <li>\r\n  \r\n  \r\n  \r\n  <a href=\"/popup/scenes.html\" target=_blank>Сцены</a>\r\n  \r\n  </li>\r\n\r\n <li>\r\n  \r\n  \r\n  \r\n  <a href=\"/popup/app_mediabrowser.html\" target=_blank>Медиа</a>\r\n  \r\n  </li>\r\n\r\n <li>\r\n  \r\n  \r\n  \r\n  <a href=\"/popup/app_calendar.html\" target=_blank>Календарь</a>\r\n  \r\n  </li>\r\n\r\n <li>\r\n  \r\n  \r\n  \r\n  <a href=\"/popup/app_products.html\" target=_blank>Продукты</a>\r\n  \r\n  </li>\r\n\r\n <li>\r\n  \r\n  \r\n  \r\n  <a href=\"/popup/app_gpstrack.html\" target=_blank>GPS</a>\r\n  \r\n  </li>\r\n\r\n</ul>\r\n\r\n\r\n \r\n <!-- / table layouts search -->\r\n <!-- table layouts edit -->\r\n \r\n <!-- / table layouts edit -->\r\n <!-- table layouts view --> \r\n \r\n <!-- / table layouts view -->\r\n\r\n\r\n\r\n<!-- end of file ./templates/layouts/layouts.html --><!-- end of file inner_code -->','2015-05-15 23:10:11');
insert  into `commands`(`ID`,`TITLE`,`COMMAND`,`URL`,`WIDTH`,`HEIGHT`,`PARENT_ID`,`SUB_LIST`,`PARENT_LIST`,`PRIORITY`,`WINDOW`,`AUTOSTART`,`TYPE`,`MIN_VALUE`,`MAX_VALUE`,`CUR_VALUE`,`STEP_VALUE`,`LINKED_OBJECT`,`LINKED_PROPERTY`,`ONCHANGE_OBJECT`,`ONCHANGE_METHOD`,`ICON`,`DATA`,`SCRIPT_ID`,`AUTO_UPDATE`,`CODE`,`SYSTEM`,`EXT_ID`,`VISIBLE_DELAY`,`INLINE`,`SUB_PRELOAD`,`RENDER_TITLE`,`RENDER_DATA`,`RENDER_UPDATED`) values (82,'<#LANG_GENERAL_EVENTS_LOG#>','','',0,0,0,'82','0',10,'',0,'label',0,0,'',0,'','','','','','',0,0,'','',0,0,0,0,'История событий','','2015-05-15 22:53:14');
insert  into `commands`(`ID`,`TITLE`,`COMMAND`,`URL`,`WIDTH`,`HEIGHT`,`PARENT_ID`,`SUB_LIST`,`PARENT_LIST`,`PRIORITY`,`WINDOW`,`AUTOSTART`,`TYPE`,`MIN_VALUE`,`MAX_VALUE`,`CUR_VALUE`,`STEP_VALUE`,`LINKED_OBJECT`,`LINKED_PROPERTY`,`ONCHANGE_OBJECT`,`ONCHANGE_METHOD`,`ICON`,`DATA`,`SCRIPT_ID`,`AUTO_UPDATE`,`CODE`,`SYSTEM`,`EXT_ID`,`VISIBLE_DELAY`,`INLINE`,`SUB_PRELOAD`,`RENDER_TITLE`,`RENDER_DATA`,`RENDER_UPDATED`) values (63,'%ClockChime.time%','','',0,0,66,'63','86,66',10000,'',0,'custom',0,0,'0',0,'','','','','','%ClockChime.time%<br>\r\nhello! <a href=\"/test\">test</a>',0,60,'','',0,0,0,0,'2014-10-30 14:58:00','2014-10-30 14:58:00<br>\r\nhello! <a href=\"/test\">test</a>','2014-10-30 14:58:15');
insert  into `commands`(`ID`,`TITLE`,`COMMAND`,`URL`,`WIDTH`,`HEIGHT`,`PARENT_ID`,`SUB_LIST`,`PARENT_LIST`,`PRIORITY`,`WINDOW`,`AUTOSTART`,`TYPE`,`MIN_VALUE`,`MAX_VALUE`,`CUR_VALUE`,`STEP_VALUE`,`LINKED_OBJECT`,`LINKED_PROPERTY`,`ONCHANGE_OBJECT`,`ONCHANGE_METHOD`,`ICON`,`DATA`,`SCRIPT_ID`,`AUTO_UPDATE`,`CODE`,`SYSTEM`,`EXT_ID`,`VISIBLE_DELAY`,`INLINE`,`SUB_PRELOAD`,`RENDER_TITLE`,`RENDER_DATA`,`RENDER_UPDATED`) values (66,'Demo controls','','',0,0,86,'63,67,68,69,70,71,72,73,77,78,80','86',0,'',0,'',0,0,'0',0,'','','','','','',0,0,'','',0,0,0,0,'Demo controls','','2014-07-15 12:25:40');
insert  into `commands`(`ID`,`TITLE`,`COMMAND`,`URL`,`WIDTH`,`HEIGHT`,`PARENT_ID`,`SUB_LIST`,`PARENT_LIST`,`PRIORITY`,`WINDOW`,`AUTOSTART`,`TYPE`,`MIN_VALUE`,`MAX_VALUE`,`CUR_VALUE`,`STEP_VALUE`,`LINKED_OBJECT`,`LINKED_PROPERTY`,`ONCHANGE_OBJECT`,`ONCHANGE_METHOD`,`ICON`,`DATA`,`SCRIPT_ID`,`AUTO_UPDATE`,`CODE`,`SYSTEM`,`EXT_ID`,`VISIBLE_DELAY`,`INLINE`,`SUB_PRELOAD`,`RENDER_TITLE`,`RENDER_DATA`,`RENDER_UPDATED`) values (67,'<#LANG_LABEL#>','','',0,0,66,'67','86,66',9000,'',0,'label',0,0,'0',0,'','','','','','',0,0,'','',0,0,0,0,'Подпись','','2014-09-04 16:17:08');
insert  into `commands`(`ID`,`TITLE`,`COMMAND`,`URL`,`WIDTH`,`HEIGHT`,`PARENT_ID`,`SUB_LIST`,`PARENT_LIST`,`PRIORITY`,`WINDOW`,`AUTOSTART`,`TYPE`,`MIN_VALUE`,`MAX_VALUE`,`CUR_VALUE`,`STEP_VALUE`,`LINKED_OBJECT`,`LINKED_PROPERTY`,`ONCHANGE_OBJECT`,`ONCHANGE_METHOD`,`ICON`,`DATA`,`SCRIPT_ID`,`AUTO_UPDATE`,`CODE`,`SYSTEM`,`EXT_ID`,`VISIBLE_DELAY`,`INLINE`,`SUB_PRELOAD`,`RENDER_TITLE`,`RENDER_DATA`,`RENDER_UPDATED`) values (68,'New window','','http://google.com/',600,600,66,'68','86,66',8000,'',0,'window',0,0,'0',0,'','','','','','',0,0,'','',0,0,0,0,'New window','','2014-09-04 16:17:08');
insert  into `commands`(`ID`,`TITLE`,`COMMAND`,`URL`,`WIDTH`,`HEIGHT`,`PARENT_ID`,`SUB_LIST`,`PARENT_LIST`,`PRIORITY`,`WINDOW`,`AUTOSTART`,`TYPE`,`MIN_VALUE`,`MAX_VALUE`,`CUR_VALUE`,`STEP_VALUE`,`LINKED_OBJECT`,`LINKED_PROPERTY`,`ONCHANGE_OBJECT`,`ONCHANGE_METHOD`,`ICON`,`DATA`,`SCRIPT_ID`,`AUTO_UPDATE`,`CODE`,`SYSTEM`,`EXT_ID`,`VISIBLE_DELAY`,`INLINE`,`SUB_PRELOAD`,`RENDER_TITLE`,`RENDER_DATA`,`RENDER_UPDATED`) values (69,'<#LANG_URL#>','','http://google.com/',0,0,66,'69','86,66',7000,'',0,'url',0,0,'0',0,'','','','','','',0,0,'','',0,0,0,0,'Ссылка','','2014-09-04 16:17:08');
insert  into `commands`(`ID`,`TITLE`,`COMMAND`,`URL`,`WIDTH`,`HEIGHT`,`PARENT_ID`,`SUB_LIST`,`PARENT_LIST`,`PRIORITY`,`WINDOW`,`AUTOSTART`,`TYPE`,`MIN_VALUE`,`MAX_VALUE`,`CUR_VALUE`,`STEP_VALUE`,`LINKED_OBJECT`,`LINKED_PROPERTY`,`ONCHANGE_OBJECT`,`ONCHANGE_METHOD`,`ICON`,`DATA`,`SCRIPT_ID`,`AUTO_UPDATE`,`CODE`,`SYSTEM`,`EXT_ID`,`VISIBLE_DELAY`,`INLINE`,`SUB_PRELOAD`,`RENDER_TITLE`,`RENDER_DATA`,`RENDER_UPDATED`) values (70,'Buttons','','',0,0,66,'70','86,66',6000,'',0,'button',0,0,'clicked',0,'','','','','','',0,0,'say(\"Привет\");','',0,0,0,0,'Buttons','','2014-09-04 16:17:08');
insert  into `commands`(`ID`,`TITLE`,`COMMAND`,`URL`,`WIDTH`,`HEIGHT`,`PARENT_ID`,`SUB_LIST`,`PARENT_LIST`,`PRIORITY`,`WINDOW`,`AUTOSTART`,`TYPE`,`MIN_VALUE`,`MAX_VALUE`,`CUR_VALUE`,`STEP_VALUE`,`LINKED_OBJECT`,`LINKED_PROPERTY`,`ONCHANGE_OBJECT`,`ONCHANGE_METHOD`,`ICON`,`DATA`,`SCRIPT_ID`,`AUTO_UPDATE`,`CODE`,`SYSTEM`,`EXT_ID`,`VISIBLE_DELAY`,`INLINE`,`SUB_PRELOAD`,`RENDER_TITLE`,`RENDER_DATA`,`RENDER_UPDATED`) values (71,'<#LANG_ON_OFF_SWITCH#>','','',0,0,66,'71','86,66',5000,'',0,'switch',0,0,'0',0,'','','','','','',0,0,'','',0,0,0,0,'Выключатель','','2014-09-04 16:17:08');
insert  into `commands`(`ID`,`TITLE`,`COMMAND`,`URL`,`WIDTH`,`HEIGHT`,`PARENT_ID`,`SUB_LIST`,`PARENT_LIST`,`PRIORITY`,`WINDOW`,`AUTOSTART`,`TYPE`,`MIN_VALUE`,`MAX_VALUE`,`CUR_VALUE`,`STEP_VALUE`,`LINKED_OBJECT`,`LINKED_PROPERTY`,`ONCHANGE_OBJECT`,`ONCHANGE_METHOD`,`ICON`,`DATA`,`SCRIPT_ID`,`AUTO_UPDATE`,`CODE`,`SYSTEM`,`EXT_ID`,`VISIBLE_DELAY`,`INLINE`,`SUB_PRELOAD`,`RENDER_TITLE`,`RENDER_DATA`,`RENDER_UPDATED`) values (72,'Select box','','',0,0,66,'72','86,66',4000,'',0,'selectbox',0,0,'2',0,'','','','','','1|Item 1\r\n2|Item 2\r\n3|Item 3',0,0,'','',0,0,0,0,'Select box','1|Item 1\r\n2|Item 2\r\n3|Item 3','2014-09-04 16:17:08');
insert  into `commands`(`ID`,`TITLE`,`COMMAND`,`URL`,`WIDTH`,`HEIGHT`,`PARENT_ID`,`SUB_LIST`,`PARENT_LIST`,`PRIORITY`,`WINDOW`,`AUTOSTART`,`TYPE`,`MIN_VALUE`,`MAX_VALUE`,`CUR_VALUE`,`STEP_VALUE`,`LINKED_OBJECT`,`LINKED_PROPERTY`,`ONCHANGE_OBJECT`,`ONCHANGE_METHOD`,`ICON`,`DATA`,`SCRIPT_ID`,`AUTO_UPDATE`,`CODE`,`SYSTEM`,`EXT_ID`,`VISIBLE_DELAY`,`INLINE`,`SUB_PRELOAD`,`RENDER_TITLE`,`RENDER_DATA`,`RENDER_UPDATED`) values (73,'Plus minus box','','',0,0,66,'73','86,66',3000,'',0,'plusminus',0,5,'3',1,'','','','','','',0,0,'','',0,0,0,0,'Plus minus box','','2014-09-04 16:17:08');
insert  into `commands`(`ID`,`TITLE`,`COMMAND`,`URL`,`WIDTH`,`HEIGHT`,`PARENT_ID`,`SUB_LIST`,`PARENT_LIST`,`PRIORITY`,`WINDOW`,`AUTOSTART`,`TYPE`,`MIN_VALUE`,`MAX_VALUE`,`CUR_VALUE`,`STEP_VALUE`,`LINKED_OBJECT`,`LINKED_PROPERTY`,`ONCHANGE_OBJECT`,`ONCHANGE_METHOD`,`ICON`,`DATA`,`SCRIPT_ID`,`AUTO_UPDATE`,`CODE`,`SYSTEM`,`EXT_ID`,`VISIBLE_DELAY`,`INLINE`,`SUB_PRELOAD`,`RENDER_TITLE`,`RENDER_DATA`,`RENDER_UPDATED`) values (74,'<#LANG_GENERAL_EVENTS_LOG#> (code)','','',0,0,0,'74','0',9,'',0,'custom',0,0,'0',0,'','','','','','<div style=\"text-shadow:none;font-weight:normal;\">[#module name=\"shoutbox\" limit=\"10\" reverse=\"1\" mobile=\"1\"#]</div>',0,60,'','',0,0,0,0,'История событий (code)','<!-- begin of file inner_code --><div style=\"text-shadow:none;font-weight:normal;\"><!-- begin of file ./templates/shoutbox/shoutbox.html -->\n\r\n<!-- Frontend -->\r\n \n\r\n <!-- action usual -->\r\n <!-- table shouts search -->\r\n \r\n  \r\n<!-- table shouts search -->\r\n<!-- results -->\r\n\r\n<div class=\"shout_box\">  <!-- begin shout_box -->\r\n\r\n<!-- search results (list) -->\r\n<div id=\"shoutboxContent\" class=\"shout_content\">\r\n<span>11:20 <b>Алиса</b>: Неизвестная команда...</span><br><span>11:20 <b>Admin</b>: умри</span><br><span>11:20 <b>Алиса</b>: Сегодня ожидается  +0 , пасмурно, снег. Завтра  +0 ...-2 , пасмурно. Сейчас на улице -0.8.</span><br><span>11:20 <b>Admin</b>: погода</span><br><hr size=1><b>2015-05-15</b><br><span>22:56 <b>Алиса</b>: Неизвестная команда...</span><br><span>22:56 <b>Admin</b>: say 21</span><br><span>22:56 <b>Алиса</b>: Неизвестная команда...</span><br><span>22:56 <b>Admin</b>: www</span><br><span>22:53 <b>Алиса</b>: main цикл остановлен.. exec цикл остановлен.. scheduler цикл остановлен.. ping цикл остановлен.. webvars цикл остановлен.. watch folders цикл остановлен.. RSS цикл остановлен.</span><br><span>22:53 <b>Алиса</b>: Системный статус изменился на Красный.</span><br>\r\n</div>\r\n<!-- / search results (list) -->\r\n<!-- / results -->\r\n\r\n\r\n<div class=\"shout_form\">\r\n<form action=\"/nf.php?pd=pz_pz_YXBwbGljYXRpb246e2FjdGlvbj1tZW51fQ%3D%3Dpz_&md=shoutbox&inst=&\" name=\"frmShoutBoxMsg\" method=\"get\" style=\"margin:0px\" onSubmit=\'return false;\'>\r\n<input type=\"text\" name=\"message\" class=\"shout_input\" placeholder=\"Команда\"><input type=\"submit\" name=\"submit\" value=\"Отправить\" onClick=\"return sendShoutMessage();\"  class=\"shout_button\">\r\n<input type=\"hidden\" name=\"pd\" value=\"pz_pz_YXBwbGljYXRpb246e2FjdGlvbj1tZW51fQ%3D%3Dpz_\">\n<input type=\"hidden\" name=\"md\" value=\"shoutbox\">\n<input type=\"hidden\" name=\"inst\" value=\"\">\n</FORM><!-- modified -->\r\n</div>\r\n\r\n</div> <!-- end shout_box -->\r\n<script language=\"javascript\">\r\n\r\nvar shoutTimer;\r\n\r\n function updateShoutContent() {\r\n  clearTimeout(shoutTimer);\r\n\r\n  var url=\"/popup/shoutbox.html?\";\r\n\r\n   url=url+\'&limit=10&getdata=1&reverse=1\';\r\n   $.ajax({\r\n    url: url,\r\n    }).done(function(data) { \r\n     if (data!=\'\') {\r\n      $(\'#shoutboxContent\').html(data);\r\n     }\r\n    });\r\n\r\n  \r\n  shoutTimer=setTimeout(\"updateShoutContent(\'\', \'\');\", 10000);\r\n  \r\n }\r\n\r\n function sendShoutMessage() {\r\n  if (document.frmShoutBoxMsg.message.value == \'\') return false; \r\n  var msg=URLencode(document.frmShoutBoxMsg.message.value);\r\n  document.frmShoutBoxMsg.message.value=\'\';\r\n  var url=\"/popup/shoutbox.html?\";\r\n  url=url+\'&limit=10&msg=\'+msg;\r\n  $.ajax({\r\n   url: url,\r\n   }).done(function(data) { \r\n    if (data!=\'OK\' && data!=\'\') {\r\n     $(\'#shoutboxContent\').html(data);\r\n    }\r\n   });\r\n  return false;\r\n }\r\n</script>\r\n\r\n\r\n<script language=\"javascript\">\r\n updateShoutContent();\r\n</script>\r\n\r\n \r\n <!-- / table shouts search -->\r\n <!-- table shouts edit -->\r\n \r\n <!-- / table shouts edit -->\r\n <!-- table shouts view --> \r\n \r\n <!-- / table shouts view -->\r\n\r\n\r\n\r\n<!-- end of file ./templates/shoutbox/shoutbox.html --></div><!-- end of file inner_code -->','2015-05-16 11:22:01');
insert  into `commands`(`ID`,`TITLE`,`COMMAND`,`URL`,`WIDTH`,`HEIGHT`,`PARENT_ID`,`SUB_LIST`,`PARENT_LIST`,`PRIORITY`,`WINDOW`,`AUTOSTART`,`TYPE`,`MIN_VALUE`,`MAX_VALUE`,`CUR_VALUE`,`STEP_VALUE`,`LINKED_OBJECT`,`LINKED_PROPERTY`,`ONCHANGE_OBJECT`,`ONCHANGE_METHOD`,`ICON`,`DATA`,`SCRIPT_ID`,`AUTO_UPDATE`,`CODE`,`SYSTEM`,`EXT_ID`,`VISIBLE_DELAY`,`INLINE`,`SUB_PRELOAD`,`RENDER_TITLE`,`RENDER_DATA`,`RENDER_UPDATED`) values (77,'Alarm time','','',0,0,66,'77','86,66',0,'',0,'timebox',0,0,'09:30',0,'ThisComputer','AlarmTime','','','','',0,0,'','',0,0,0,0,'Alarm time','','2014-09-04 16:17:08');
insert  into `commands`(`ID`,`TITLE`,`COMMAND`,`URL`,`WIDTH`,`HEIGHT`,`PARENT_ID`,`SUB_LIST`,`PARENT_LIST`,`PRIORITY`,`WINDOW`,`AUTOSTART`,`TYPE`,`MIN_VALUE`,`MAX_VALUE`,`CUR_VALUE`,`STEP_VALUE`,`LINKED_OBJECT`,`LINKED_PROPERTY`,`ONCHANGE_OBJECT`,`ONCHANGE_METHOD`,`ICON`,`DATA`,`SCRIPT_ID`,`AUTO_UPDATE`,`CODE`,`SYSTEM`,`EXT_ID`,`VISIBLE_DELAY`,`INLINE`,`SUB_PRELOAD`,`RENDER_TITLE`,`RENDER_DATA`,`RENDER_UPDATED`) values (78,'<#LANG_TEXT_BOX#>','','',0,0,66,'78','86,66',0,'',0,'textbox',0,0,'0',0,'ThisComputer','textBoxTest','','','','',0,10,'','',0,0,0,0,'Текстовое поле','','2014-10-30 14:58:15');
insert  into `commands`(`ID`,`TITLE`,`COMMAND`,`URL`,`WIDTH`,`HEIGHT`,`PARENT_ID`,`SUB_LIST`,`PARENT_LIST`,`PRIORITY`,`WINDOW`,`AUTOSTART`,`TYPE`,`MIN_VALUE`,`MAX_VALUE`,`CUR_VALUE`,`STEP_VALUE`,`LINKED_OBJECT`,`LINKED_PROPERTY`,`ONCHANGE_OBJECT`,`ONCHANGE_METHOD`,`ICON`,`DATA`,`SCRIPT_ID`,`AUTO_UPDATE`,`CODE`,`SYSTEM`,`EXT_ID`,`VISIBLE_DELAY`,`INLINE`,`SUB_PRELOAD`,`RENDER_TITLE`,`RENDER_DATA`,`RENDER_UPDATED`) values (80,'<#LANG_SLIDER_BOX#>','','',0,0,66,'80','86,66',0,'',0,'sliderbox',0,10,'0',1,'ThisComputer','textBoxTest','','','','',0,5,'','',0,0,0,0,'Слайдер','','2014-10-30 14:58:15');
insert  into `commands`(`ID`,`TITLE`,`COMMAND`,`URL`,`WIDTH`,`HEIGHT`,`PARENT_ID`,`SUB_LIST`,`PARENT_LIST`,`PRIORITY`,`WINDOW`,`AUTOSTART`,`TYPE`,`MIN_VALUE`,`MAX_VALUE`,`CUR_VALUE`,`STEP_VALUE`,`LINKED_OBJECT`,`LINKED_PROPERTY`,`ONCHANGE_OBJECT`,`ONCHANGE_METHOD`,`ICON`,`DATA`,`SCRIPT_ID`,`AUTO_UPDATE`,`CODE`,`SYSTEM`,`EXT_ID`,`VISIBLE_DELAY`,`INLINE`,`SUB_PRELOAD`,`RENDER_TITLE`,`RENDER_DATA`,`RENDER_UPDATED`) values (86,'<#LANG_GENERAL_SERVICE#>','','',0,0,0,'75,66,63,67,68,69,70,71,72,73,77,78,80,98,99','0',2,'',0,'',0,0,'',0,'','','','','','',0,0,'','',0,0,0,0,'Сервис','','2015-05-15 22:53:14');
insert  into `commands`(`ID`,`TITLE`,`COMMAND`,`URL`,`WIDTH`,`HEIGHT`,`PARENT_ID`,`SUB_LIST`,`PARENT_LIST`,`PRIORITY`,`WINDOW`,`AUTOSTART`,`TYPE`,`MIN_VALUE`,`MAX_VALUE`,`CUR_VALUE`,`STEP_VALUE`,`LINKED_OBJECT`,`LINKED_PROPERTY`,`ONCHANGE_OBJECT`,`ONCHANGE_METHOD`,`ICON`,`DATA`,`SCRIPT_ID`,`AUTO_UPDATE`,`CODE`,`SYSTEM`,`EXT_ID`,`VISIBLE_DELAY`,`INLINE`,`SUB_PRELOAD`,`RENDER_TITLE`,`RENDER_DATA`,`RENDER_UPDATED`) values (106,'<#LANG_GENERAL_CONTROL#>','','',0,0,0,'108','0',7000,'',0,'',0,0,'',0,'','','','','','',0,0,'','',0,0,0,1,'Управление','','2015-05-15 22:53:14');
insert  into `commands`(`ID`,`TITLE`,`COMMAND`,`URL`,`WIDTH`,`HEIGHT`,`PARENT_ID`,`SUB_LIST`,`PARENT_LIST`,`PRIORITY`,`WINDOW`,`AUTOSTART`,`TYPE`,`MIN_VALUE`,`MAX_VALUE`,`CUR_VALUE`,`STEP_VALUE`,`LINKED_OBJECT`,`LINKED_PROPERTY`,`ONCHANGE_OBJECT`,`ONCHANGE_METHOD`,`ICON`,`DATA`,`SCRIPT_ID`,`AUTO_UPDATE`,`CODE`,`SYSTEM`,`EXT_ID`,`VISIBLE_DELAY`,`INLINE`,`SUB_PRELOAD`,`RENDER_TITLE`,`RENDER_DATA`,`RENDER_UPDATED`) values (114,'Admin (status)','','',0,0,110,'114','110',950,'',0,'custom',0,0,'',0,'','','','','','%Admin.seenAt% (%Admin.CoordinatesUpdated%)\r\n<br><br>\r\n<a href=\"http://maps.google.com/maps?q=loc:%Admin.Coordinates%\" target=_blank><img src=\"http://maps.googleapis.com/maps/api/staticmap?center=%Admin.Coordinates%&size=300x300&maptype=hybrid&sensor=false&zoom=16&markers=%Admin.Coordinates%\"></a>',0,0,'','',0,0,0,0,'Admin (status)',' ()\r\n<br><br>\r\n<a href=\"http://maps.google.com/maps?q=loc:\" target=_blank><img src=\"http://maps.googleapis.com/maps/api/staticmap?center=&size=300x300&maptype=hybrid&sensor=false&zoom=16&markers=\"></a>','2014-10-30 15:40:58');
insert  into `commands`(`ID`,`TITLE`,`COMMAND`,`URL`,`WIDTH`,`HEIGHT`,`PARENT_ID`,`SUB_LIST`,`PARENT_LIST`,`PRIORITY`,`WINDOW`,`AUTOSTART`,`TYPE`,`MIN_VALUE`,`MAX_VALUE`,`CUR_VALUE`,`STEP_VALUE`,`LINKED_OBJECT`,`LINKED_PROPERTY`,`ONCHANGE_OBJECT`,`ONCHANGE_METHOD`,`ICON`,`DATA`,`SCRIPT_ID`,`AUTO_UPDATE`,`CODE`,`SYSTEM`,`EXT_ID`,`VISIBLE_DELAY`,`INLINE`,`SUB_PRELOAD`,`RENDER_TITLE`,`RENDER_DATA`,`RENDER_UPDATED`) values (91,'<#LANG_GENERAL_CLIMATE#> (<#LANG_GENERAL_OUTSIDE#>: %ThisComputer.TempOutside%°C / <#LANG_GENERAL_INSIDE#>: %Livingroom.Temperature%°C)','','',0,0,0,'92,93,104,105','0',8000,'',0,'',0,0,'',0,'','','','','','',0,60,'','',0,0,0,1,'Климат (На улице: -0.8°C / Дома: 22.4°C)','','2015-05-15 22:53:14');
insert  into `commands`(`ID`,`TITLE`,`COMMAND`,`URL`,`WIDTH`,`HEIGHT`,`PARENT_ID`,`SUB_LIST`,`PARENT_LIST`,`PRIORITY`,`WINDOW`,`AUTOSTART`,`TYPE`,`MIN_VALUE`,`MAX_VALUE`,`CUR_VALUE`,`STEP_VALUE`,`LINKED_OBJECT`,`LINKED_PROPERTY`,`ONCHANGE_OBJECT`,`ONCHANGE_METHOD`,`ICON`,`DATA`,`SCRIPT_ID`,`AUTO_UPDATE`,`CODE`,`SYSTEM`,`EXT_ID`,`VISIBLE_DELAY`,`INLINE`,`SUB_PRELOAD`,`RENDER_TITLE`,`RENDER_DATA`,`RENDER_UPDATED`) values (92,'<#LANG_GENERAL_WEATHER_FORECAST#> (code)','','',0,0,91,'92','91',1000,'',0,'custom',0,0,'',0,'','','','','','%ThisComputer.weatherFull%',0,0,'','',0,0,0,0,'Прогноз погоды (code)','\n<b>Сегодня:</b><br />\nднем: +0&deg;, пасмурно, снег, ночью: +0&deg;...-2&deg;, пасмурно, снег, ветер: З — 2-4 м/с, давление: 760 мм.рт.ст, влажность: 90%<br />\n<br />\n<b>Завтра:</b><br />\nднем: +0&deg;...-2&deg;, пасмурно, ночью: -1&deg;...-3&deg;, пасмурно, снег, ветер: C — 3-5 м/с, давление: 767 мм.рт.ст, влажность: 85%<br />\n<br />\n<br />\n','2015-05-15 22:53:14');
insert  into `commands`(`ID`,`TITLE`,`COMMAND`,`URL`,`WIDTH`,`HEIGHT`,`PARENT_ID`,`SUB_LIST`,`PARENT_LIST`,`PRIORITY`,`WINDOW`,`AUTOSTART`,`TYPE`,`MIN_VALUE`,`MAX_VALUE`,`CUR_VALUE`,`STEP_VALUE`,`LINKED_OBJECT`,`LINKED_PROPERTY`,`ONCHANGE_OBJECT`,`ONCHANGE_METHOD`,`ICON`,`DATA`,`SCRIPT_ID`,`AUTO_UPDATE`,`CODE`,`SYSTEM`,`EXT_ID`,`VISIBLE_DELAY`,`INLINE`,`SUB_PRELOAD`,`RENDER_TITLE`,`RENDER_DATA`,`RENDER_UPDATED`) values (93,'<#LANG_GENERAL_WEATHER_FORECAST#>','','',0,0,91,'93','91',1001,'',0,'label',0,0,'',0,'','','','','','',0,0,'','',0,0,0,0,'Прогноз погоды','','2015-05-15 22:53:14');
insert  into `commands`(`ID`,`TITLE`,`COMMAND`,`URL`,`WIDTH`,`HEIGHT`,`PARENT_ID`,`SUB_LIST`,`PARENT_LIST`,`PRIORITY`,`WINDOW`,`AUTOSTART`,`TYPE`,`MIN_VALUE`,`MAX_VALUE`,`CUR_VALUE`,`STEP_VALUE`,`LINKED_OBJECT`,`LINKED_PROPERTY`,`ONCHANGE_OBJECT`,`ONCHANGE_METHOD`,`ICON`,`DATA`,`SCRIPT_ID`,`AUTO_UPDATE`,`CODE`,`SYSTEM`,`EXT_ID`,`VISIBLE_DELAY`,`INLINE`,`SUB_PRELOAD`,`RENDER_TITLE`,`RENDER_DATA`,`RENDER_UPDATED`) values (104,'<#LANG_GENERAL_INSIDE#>','','',0,0,91,'104','91',2000,'',0,'label',0,0,'',0,'','','','','','',0,0,'','',0,0,0,0,'Дома','','2015-05-15 22:53:14');
insert  into `commands`(`ID`,`TITLE`,`COMMAND`,`URL`,`WIDTH`,`HEIGHT`,`PARENT_ID`,`SUB_LIST`,`PARENT_LIST`,`PRIORITY`,`WINDOW`,`AUTOSTART`,`TYPE`,`MIN_VALUE`,`MAX_VALUE`,`CUR_VALUE`,`STEP_VALUE`,`LINKED_OBJECT`,`LINKED_PROPERTY`,`ONCHANGE_OBJECT`,`ONCHANGE_METHOD`,`ICON`,`DATA`,`SCRIPT_ID`,`AUTO_UPDATE`,`CODE`,`SYSTEM`,`EXT_ID`,`VISIBLE_DELAY`,`INLINE`,`SUB_PRELOAD`,`RENDER_TITLE`,`RENDER_DATA`,`RENDER_UPDATED`) values (105,'<#LANG_GENERAL_INSIDE#> (data)','','',0,0,91,'105','91',1900,'',0,'custom',0,0,'',0,'','','','','','Livingroom: %Livingroom.Temperature%&deg;C / %Livingroom.Humidity%%',0,30,'','',0,0,0,0,'<#LANG_GENERAL_INSIDE#> (data)','Livingroom: 22.4&deg;C / 42%','2015-05-17 21:57:06');
insert  into `commands`(`ID`,`TITLE`,`COMMAND`,`URL`,`WIDTH`,`HEIGHT`,`PARENT_ID`,`SUB_LIST`,`PARENT_LIST`,`PRIORITY`,`WINDOW`,`AUTOSTART`,`TYPE`,`MIN_VALUE`,`MAX_VALUE`,`CUR_VALUE`,`STEP_VALUE`,`LINKED_OBJECT`,`LINKED_PROPERTY`,`ONCHANGE_OBJECT`,`ONCHANGE_METHOD`,`ICON`,`DATA`,`SCRIPT_ID`,`AUTO_UPDATE`,`CODE`,`SYSTEM`,`EXT_ID`,`VISIBLE_DELAY`,`INLINE`,`SUB_PRELOAD`,`RENDER_TITLE`,`RENDER_DATA`,`RENDER_UPDATED`) values (97,'State','','',0,0,0,'97','0',100010,'',0,'custom',0,0,'',0,'','','','','','<big style=\"font-size:24px\">%ThisComputer.timeNow%</big>\r\n\r\n<img src=\"/img/icons/status/lock_32_%Security.stateColor%.png\" align=\"absmiddle\"> %Security.stateDetails%\r\n<img src=\"/img/icons/status/system_32_%System.stateColor%.png\" align=\"absmiddle\"> %System.stateDetails%\r\n<img src=\"/img/icons/status/network_32_%Communication.stateColor%.png\" align=\"absmiddle\"> %Communication.stateDetails%\r\n<br/>\r\n%ThisComputer.somebodyHomeText%\r\n<br/>\r\nAdmin -- %Admin.seenAt% (%Admin.CoordinatesUpdated%)',0,10,'','',0,0,0,0,'State','<big style=\"font-size:24px\">15:00</big>\r\n\r\n<img src=\"/img/icons/status/lock_32_green.png\" align=\"absmiddle\"> \r\n<img src=\"/img/icons/status/system_32_red.png\" align=\"absmiddle\"> main цикл остановлен.. exec цикл остановлен.. scheduler цикл остановлен.. ping цикл остановлен.. webvars цикл остановлен.. watch folders цикл остановлен.. RSS цикл остановлен.\r\n<img src=\"/img/icons/status/network_32_green.png\" align=\"absmiddle\"> \r\n<br/>\r\n\r\n<br/>\r\nAdmin --  ()','2015-05-15 22:53:25');
insert  into `commands`(`ID`,`TITLE`,`COMMAND`,`URL`,`WIDTH`,`HEIGHT`,`PARENT_ID`,`SUB_LIST`,`PARENT_LIST`,`PRIORITY`,`WINDOW`,`AUTOSTART`,`TYPE`,`MIN_VALUE`,`MAX_VALUE`,`CUR_VALUE`,`STEP_VALUE`,`LINKED_OBJECT`,`LINKED_PROPERTY`,`ONCHANGE_OBJECT`,`ONCHANGE_METHOD`,`ICON`,`DATA`,`SCRIPT_ID`,`AUTO_UPDATE`,`CODE`,`SYSTEM`,`EXT_ID`,`VISIBLE_DELAY`,`INLINE`,`SUB_PRELOAD`,`RENDER_TITLE`,`RENDER_DATA`,`RENDER_UPDATED`) values (98,'<#LANG_SECTION_SETTINGS#>','','',0,0,86,'99','86',20000,'',0,'',0,0,'',0,'','','','','','',0,0,'','',0,0,0,0,'Настройки','','2014-08-25 17:04:27');
insert  into `commands`(`ID`,`TITLE`,`COMMAND`,`URL`,`WIDTH`,`HEIGHT`,`PARENT_ID`,`SUB_LIST`,`PARENT_LIST`,`PRIORITY`,`WINDOW`,`AUTOSTART`,`TYPE`,`MIN_VALUE`,`MAX_VALUE`,`CUR_VALUE`,`STEP_VALUE`,`LINKED_OBJECT`,`LINKED_PROPERTY`,`ONCHANGE_OBJECT`,`ONCHANGE_METHOD`,`ICON`,`DATA`,`SCRIPT_ID`,`AUTO_UPDATE`,`CODE`,`SYSTEM`,`EXT_ID`,`VISIBLE_DELAY`,`INLINE`,`SUB_PRELOAD`,`RENDER_TITLE`,`RENDER_DATA`,`RENDER_UPDATED`) values (99,'Говорить время','','',0,0,98,'99','86,98',1000,'',0,'switch',0,0,'1',0,'ThisComputer','clockChimeEnabled','','','','',0,0,'','',0,0,0,0,'Говорить время','','2014-08-25 17:04:33');
insert  into `commands`(`ID`,`TITLE`,`COMMAND`,`URL`,`WIDTH`,`HEIGHT`,`PARENT_ID`,`SUB_LIST`,`PARENT_LIST`,`PRIORITY`,`WINDOW`,`AUTOSTART`,`TYPE`,`MIN_VALUE`,`MAX_VALUE`,`CUR_VALUE`,`STEP_VALUE`,`LINKED_OBJECT`,`LINKED_PROPERTY`,`ONCHANGE_OBJECT`,`ONCHANGE_METHOD`,`ICON`,`DATA`,`SCRIPT_ID`,`AUTO_UPDATE`,`CODE`,`SYSTEM`,`EXT_ID`,`VISIBLE_DELAY`,`INLINE`,`SUB_PRELOAD`,`RENDER_TITLE`,`RENDER_DATA`,`RENDER_UPDATED`) values (108,'Switch 1','','',0,0,106,'108','106',0,'',0,'switch',0,0,'0',0,'','','','','','',0,300,'','',0,0,0,0,'Switch 1','','2014-10-31 15:30:26');
insert  into `commands`(`ID`,`TITLE`,`COMMAND`,`URL`,`WIDTH`,`HEIGHT`,`PARENT_ID`,`SUB_LIST`,`PARENT_LIST`,`PRIORITY`,`WINDOW`,`AUTOSTART`,`TYPE`,`MIN_VALUE`,`MAX_VALUE`,`CUR_VALUE`,`STEP_VALUE`,`LINKED_OBJECT`,`LINKED_PROPERTY`,`ONCHANGE_OBJECT`,`ONCHANGE_METHOD`,`ICON`,`DATA`,`SCRIPT_ID`,`AUTO_UPDATE`,`CODE`,`SYSTEM`,`EXT_ID`,`VISIBLE_DELAY`,`INLINE`,`SUB_PRELOAD`,`RENDER_TITLE`,`RENDER_DATA`,`RENDER_UPDATED`) values (110,'<#LANG_MODULE_USERS#>','','',0,0,0,'114,111','0',5000,'',0,'',0,0,'',0,'','','','','','',0,0,'','',0,0,0,0,'Пользователи','','2015-05-15 22:53:14');
insert  into `commands`(`ID`,`TITLE`,`COMMAND`,`URL`,`WIDTH`,`HEIGHT`,`PARENT_ID`,`SUB_LIST`,`PARENT_LIST`,`PRIORITY`,`WINDOW`,`AUTOSTART`,`TYPE`,`MIN_VALUE`,`MAX_VALUE`,`CUR_VALUE`,`STEP_VALUE`,`LINKED_OBJECT`,`LINKED_PROPERTY`,`ONCHANGE_OBJECT`,`ONCHANGE_METHOD`,`ICON`,`DATA`,`SCRIPT_ID`,`AUTO_UPDATE`,`CODE`,`SYSTEM`,`EXT_ID`,`VISIBLE_DELAY`,`INLINE`,`SUB_PRELOAD`,`RENDER_TITLE`,`RENDER_DATA`,`RENDER_UPDATED`) values (111,'Admin','','',0,0,110,'111','110',1000,'',0,'label',0,0,'',0,'','','','','','',0,0,'','',0,0,0,0,'Admin','','2014-10-30 15:40:58');

/*Table structure for table `elements` */

DROP TABLE IF EXISTS `elements`;

CREATE TABLE `elements` (
  `ID` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `SCENE_ID` int(10) NOT NULL DEFAULT '0',
  `TITLE` varchar(255) NOT NULL DEFAULT '',
  `TYPE` varchar(255) NOT NULL DEFAULT '',
  `TOP` int(10) NOT NULL DEFAULT '0',
  `LEFT` int(255) NOT NULL DEFAULT '0',
  `WIDTH` int(255) NOT NULL DEFAULT '0',
  `HEIGHT` int(255) NOT NULL DEFAULT '0',
  `CROSS_SCENE` int(3) NOT NULL DEFAULT '0',
  `BACKGROUND` int(3) NOT NULL DEFAULT '1',
  `JAVASCRIPT` text,
  `CSS` text,
  `DX` int(10) NOT NULL DEFAULT '0',
  `DY` int(10) NOT NULL DEFAULT '0',
  `LINKED_ELEMENT_ID` int(10) NOT NULL DEFAULT '0',
  `PRIORITY` int(10) NOT NULL DEFAULT '0',
  `CSS_STYLE` varchar(255) NOT NULL DEFAULT '',
  `POSITION_TYPE` int(3) NOT NULL DEFAULT '0',
  `CONTAINER_ID` int(10) NOT NULL DEFAULT '0',
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM AUTO_INCREMENT=11 DEFAULT CHARSET=utf8;

/*Data for the table `elements` */

insert  into `elements`(`ID`,`SCENE_ID`,`TITLE`,`TYPE`,`TOP`,`LEFT`,`WIDTH`,`HEIGHT`,`CROSS_SCENE`,`BACKGROUND`,`JAVASCRIPT`,`CSS`,`DX`,`DY`,`LINKED_ELEMENT_ID`,`PRIORITY`,`CSS_STYLE`,`POSITION_TYPE`,`CONTAINER_ID`) values (1,1,'Webcam Sample','html',55,392,270,210,0,1,NULL,NULL,0,0,0,0,'',0,0);
insert  into `elements`(`ID`,`SCENE_ID`,`TITLE`,`TYPE`,`TOP`,`LEFT`,`WIDTH`,`HEIGHT`,`CROSS_SCENE`,`BACKGROUND`,`JAVASCRIPT`,`CSS`,`DX`,`DY`,`LINKED_ELEMENT_ID`,`PRIORITY`,`CSS_STYLE`,`POSITION_TYPE`,`CONTAINER_ID`) values (6,1,'3453454','switch',0,0,0,0,0,0,'','',0,0,0,0,'default',0,0);
insert  into `elements`(`ID`,`SCENE_ID`,`TITLE`,`TYPE`,`TOP`,`LEFT`,`WIDTH`,`HEIGHT`,`CROSS_SCENE`,`BACKGROUND`,`JAVASCRIPT`,`CSS`,`DX`,`DY`,`LINKED_ELEMENT_ID`,`PRIORITY`,`CSS_STYLE`,`POSITION_TYPE`,`CONTAINER_ID`) values (7,1,'аааааа','container',0,35,0,0,0,0,'','',0,0,0,0,'default',0,0);
insert  into `elements`(`ID`,`SCENE_ID`,`TITLE`,`TYPE`,`TOP`,`LEFT`,`WIDTH`,`HEIGHT`,`CROSS_SCENE`,`BACKGROUND`,`JAVASCRIPT`,`CSS`,`DX`,`DY`,`LINKED_ELEMENT_ID`,`PRIORITY`,`CSS_STYLE`,`POSITION_TYPE`,`CONTAINER_ID`) values (8,1,'йцуйцуцйу','navgo',0,0,0,0,0,0,'','',0,0,0,0,'default',0,0);
insert  into `elements`(`ID`,`SCENE_ID`,`TITLE`,`TYPE`,`TOP`,`LEFT`,`WIDTH`,`HEIGHT`,`CROSS_SCENE`,`BACKGROUND`,`JAVASCRIPT`,`CSS`,`DX`,`DY`,`LINKED_ELEMENT_ID`,`PRIORITY`,`CSS_STYLE`,`POSITION_TYPE`,`CONTAINER_ID`) values (9,1,'фффыфыфыфыф','switch',0,0,0,0,0,0,'','',0,0,0,0,'light',0,7);
insert  into `elements`(`ID`,`SCENE_ID`,`TITLE`,`TYPE`,`TOP`,`LEFT`,`WIDTH`,`HEIGHT`,`CROSS_SCENE`,`BACKGROUND`,`JAVASCRIPT`,`CSS`,`DX`,`DY`,`LINKED_ELEMENT_ID`,`PRIORITY`,`CSS_STYLE`,`POSITION_TYPE`,`CONTAINER_ID`) values (10,1,'45646','button',0,400,0,0,0,0,'','',0,0,0,0,'light',0,0);

/*Table structure for table `elm_states` */

DROP TABLE IF EXISTS `elm_states`;

CREATE TABLE `elm_states` (
  `ID` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `ELEMENT_ID` int(10) NOT NULL DEFAULT '0',
  `TITLE` varchar(255) NOT NULL DEFAULT '',
  `IMAGE` varchar(255) NOT NULL DEFAULT '',
  `HTML` text,
  `IS_DYNAMIC` int(3) NOT NULL DEFAULT '0',
  `CURRENT_STATE` int(3) NOT NULL DEFAULT '0',
  `LINKED_OBJECT` varchar(255) NOT NULL DEFAULT '',
  `LINKED_PROPERTY` varchar(255) NOT NULL DEFAULT '',
  `CONDITION` int(3) NOT NULL DEFAULT '0',
  `CONDITION_VALUE` varchar(255) NOT NULL DEFAULT '',
  `CONDITION_ADVANCED` text,
  `SCRIPT_ID` int(10) NOT NULL DEFAULT '0',
  `SWITCH_SCENE` int(3) NOT NULL DEFAULT '0',
  `CURRENT_STATUS` int(3) NOT NULL DEFAULT '0',
  `ACTION_OBJECT` varchar(255) NOT NULL DEFAULT '',
  `ACTION_METHOD` varchar(255) NOT NULL DEFAULT '',
  `MENU_ITEM_ID` int(10) NOT NULL DEFAULT '0',
  `WINDOW_POSX` int(10) NOT NULL DEFAULT '0',
  `WINDOW_POSY` int(10) NOT NULL DEFAULT '0',
  `WINDOW_WIDTH` int(10) NOT NULL DEFAULT '0',
  `WINDOW_HEIGHT` int(10) NOT NULL DEFAULT '0',
  `HOMEPAGE_ID` int(10) NOT NULL DEFAULT '0',
  `EXT_URL` varchar(255) NOT NULL DEFAULT '',
  `PRIORITY` int(10) NOT NULL DEFAULT '0',
  `CODE` text,
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM AUTO_INCREMENT=11 DEFAULT CHARSET=utf8;

/*Data for the table `elm_states` */

insert  into `elm_states`(`ID`,`ELEMENT_ID`,`TITLE`,`IMAGE`,`HTML`,`IS_DYNAMIC`,`CURRENT_STATE`,`LINKED_OBJECT`,`LINKED_PROPERTY`,`CONDITION`,`CONDITION_VALUE`,`CONDITION_ADVANCED`,`SCRIPT_ID`,`SWITCH_SCENE`,`CURRENT_STATUS`,`ACTION_OBJECT`,`ACTION_METHOD`,`MENU_ITEM_ID`,`WINDOW_POSX`,`WINDOW_POSY`,`WINDOW_WIDTH`,`WINDOW_HEIGHT`,`HOMEPAGE_ID`,`EXT_URL`,`PRIORITY`,`CODE`) values (1,1,'Default','','<img src=\"http://abclocal.go.com/three/wabc/webcam/skycpk.jpg\" width=\"270\">',0,1,'','',1,'','',0,0,0,'','',0,0,0,0,0,0,'',0,NULL);
insert  into `elm_states`(`ID`,`ELEMENT_ID`,`TITLE`,`IMAGE`,`HTML`,`IS_DYNAMIC`,`CURRENT_STATE`,`LINKED_OBJECT`,`LINKED_PROPERTY`,`CONDITION`,`CONDITION_VALUE`,`CONDITION_ADVANCED`,`SCRIPT_ID`,`SWITCH_SCENE`,`CURRENT_STATUS`,`ACTION_OBJECT`,`ACTION_METHOD`,`MENU_ITEM_ID`,`WINDOW_POSX`,`WINDOW_POSY`,`WINDOW_WIDTH`,`WINDOW_HEIGHT`,`HOMEPAGE_ID`,`EXT_URL`,`PRIORITY`,`CODE`) values (4,6,'off','','3453454',1,1,'System','status',4,'1',NULL,0,0,0,'System','turnOn',0,0,0,0,0,0,'',0,NULL);
insert  into `elm_states`(`ID`,`ELEMENT_ID`,`TITLE`,`IMAGE`,`HTML`,`IS_DYNAMIC`,`CURRENT_STATE`,`LINKED_OBJECT`,`LINKED_PROPERTY`,`CONDITION`,`CONDITION_VALUE`,`CONDITION_ADVANCED`,`SCRIPT_ID`,`SWITCH_SCENE`,`CURRENT_STATUS`,`ACTION_OBJECT`,`ACTION_METHOD`,`MENU_ITEM_ID`,`WINDOW_POSX`,`WINDOW_POSY`,`WINDOW_WIDTH`,`WINDOW_HEIGHT`,`HOMEPAGE_ID`,`EXT_URL`,`PRIORITY`,`CODE`) values (5,6,'on','','3453454',1,0,'System','',1,'1','',0,0,0,'System','',0,0,0,0,0,0,'',0,'');
insert  into `elm_states`(`ID`,`ELEMENT_ID`,`TITLE`,`IMAGE`,`HTML`,`IS_DYNAMIC`,`CURRENT_STATE`,`LINKED_OBJECT`,`LINKED_PROPERTY`,`CONDITION`,`CONDITION_VALUE`,`CONDITION_ADVANCED`,`SCRIPT_ID`,`SWITCH_SCENE`,`CURRENT_STATUS`,`ACTION_OBJECT`,`ACTION_METHOD`,`MENU_ITEM_ID`,`WINDOW_POSX`,`WINDOW_POSY`,`WINDOW_WIDTH`,`WINDOW_HEIGHT`,`HOMEPAGE_ID`,`EXT_URL`,`PRIORITY`,`CODE`) values (6,7,'','','',0,1,'','',0,'','',0,0,0,'','',0,0,0,0,0,0,'',0,'');
insert  into `elm_states`(`ID`,`ELEMENT_ID`,`TITLE`,`IMAGE`,`HTML`,`IS_DYNAMIC`,`CURRENT_STATE`,`LINKED_OBJECT`,`LINKED_PROPERTY`,`CONDITION`,`CONDITION_VALUE`,`CONDITION_ADVANCED`,`SCRIPT_ID`,`SWITCH_SCENE`,`CURRENT_STATUS`,`ACTION_OBJECT`,`ACTION_METHOD`,`MENU_ITEM_ID`,`WINDOW_POSX`,`WINDOW_POSY`,`WINDOW_WIDTH`,`WINDOW_HEIGHT`,`HOMEPAGE_ID`,`EXT_URL`,`PRIORITY`,`CODE`) values (7,8,'default','','йцуйцуцйу',0,1,'','',1,'','',0,0,0,'','',0,0,0,0,0,0,'',0,'');
insert  into `elm_states`(`ID`,`ELEMENT_ID`,`TITLE`,`IMAGE`,`HTML`,`IS_DYNAMIC`,`CURRENT_STATE`,`LINKED_OBJECT`,`LINKED_PROPERTY`,`CONDITION`,`CONDITION_VALUE`,`CONDITION_ADVANCED`,`SCRIPT_ID`,`SWITCH_SCENE`,`CURRENT_STATUS`,`ACTION_OBJECT`,`ACTION_METHOD`,`MENU_ITEM_ID`,`WINDOW_POSX`,`WINDOW_POSY`,`WINDOW_WIDTH`,`WINDOW_HEIGHT`,`HOMEPAGE_ID`,`EXT_URL`,`PRIORITY`,`CODE`) values (8,9,'off','','фффыфыфыфыф',1,1,'TempSensor01','status',4,'1',NULL,0,0,0,'TempSensor01','turnOn',0,0,0,0,0,0,'',0,NULL);
insert  into `elm_states`(`ID`,`ELEMENT_ID`,`TITLE`,`IMAGE`,`HTML`,`IS_DYNAMIC`,`CURRENT_STATE`,`LINKED_OBJECT`,`LINKED_PROPERTY`,`CONDITION`,`CONDITION_VALUE`,`CONDITION_ADVANCED`,`SCRIPT_ID`,`SWITCH_SCENE`,`CURRENT_STATUS`,`ACTION_OBJECT`,`ACTION_METHOD`,`MENU_ITEM_ID`,`WINDOW_POSX`,`WINDOW_POSY`,`WINDOW_WIDTH`,`WINDOW_HEIGHT`,`HOMEPAGE_ID`,`EXT_URL`,`PRIORITY`,`CODE`) values (9,9,'on','','фффыфыфыфыф',1,0,'TempSensor01','',1,'1','',0,0,0,'TempSensor01','',0,0,0,0,0,0,'',0,'');
insert  into `elm_states`(`ID`,`ELEMENT_ID`,`TITLE`,`IMAGE`,`HTML`,`IS_DYNAMIC`,`CURRENT_STATE`,`LINKED_OBJECT`,`LINKED_PROPERTY`,`CONDITION`,`CONDITION_VALUE`,`CONDITION_ADVANCED`,`SCRIPT_ID`,`SWITCH_SCENE`,`CURRENT_STATUS`,`ACTION_OBJECT`,`ACTION_METHOD`,`MENU_ITEM_ID`,`WINDOW_POSX`,`WINDOW_POSY`,`WINDOW_WIDTH`,`WINDOW_HEIGHT`,`HOMEPAGE_ID`,`EXT_URL`,`PRIORITY`,`CODE`) values (10,10,'default','','45646',0,1,'','',1,'','',0,0,0,'','',106,198,47,500,500,0,'',0,'');

/*Table structure for table `events` */

DROP TABLE IF EXISTS `events`;

CREATE TABLE `events` (
  `ID` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `EVENT_TYPE` varchar(10) NOT NULL DEFAULT '',
  `TERMINAL_FROM` varchar(255) NOT NULL DEFAULT '',
  `TERMINAL_TO` varchar(255) NOT NULL DEFAULT '',
  `USER_FROM` varchar(255) NOT NULL DEFAULT '',
  `USER_TO` varchar(255) NOT NULL DEFAULT '',
  `WINDOW` varchar(255) NOT NULL DEFAULT '',
  `DETAILS` text,
  `ADDED` datetime DEFAULT NULL,
  `EXPIRE` datetime DEFAULT NULL,
  `PROCESSED` int(3) NOT NULL DEFAULT '0',
  `EVENT_NAME` varchar(255) NOT NULL DEFAULT '',
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM AUTO_INCREMENT=5 DEFAULT CHARSET=utf8;

/*Data for the table `events` */

insert  into `events`(`ID`,`EVENT_TYPE`,`TERMINAL_FROM`,`TERMINAL_TO`,`USER_FROM`,`USER_TO`,`WINDOW`,`DETAILS`,`ADDED`,`EXPIRE`,`PROCESSED`,`EVENT_NAME`) values (1,'system','','','','','','objects','2014-09-05 13:01:00','2014-09-07 13:01:00',1,'inhouseMovement');

/*Table structure for table `gpsactions` */

DROP TABLE IF EXISTS `gpsactions`;

CREATE TABLE `gpsactions` (
  `ID` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `LOCATION_ID` int(10) NOT NULL DEFAULT '0',
  `USER_ID` int(10) NOT NULL DEFAULT '0',
  `ACTION_TYPE` int(255) NOT NULL DEFAULT '0',
  `SCRIPT_ID` int(10) NOT NULL DEFAULT '0',
  `CODE` text,
  `LOG` text,
  `EXECUTED` datetime DEFAULT NULL,
  PRIMARY KEY (`ID`),
  KEY `LOCATION_ID` (`LOCATION_ID`),
  KEY `USER_ID` (`USER_ID`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

/*Data for the table `gpsactions` */

/*Table structure for table `gpsdevices` */

DROP TABLE IF EXISTS `gpsdevices`;

CREATE TABLE `gpsdevices` (
  `ID` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `TITLE` varchar(255) NOT NULL DEFAULT '',
  `USER_ID` int(10) NOT NULL DEFAULT '0',
  `LAT` varchar(255) NOT NULL DEFAULT '',
  `LON` varchar(255) NOT NULL DEFAULT '',
  `UPDATED` datetime DEFAULT NULL,
  `DEVICEID` varchar(255) NOT NULL DEFAULT '',
  `TOKEN` varchar(255) NOT NULL DEFAULT '',
  PRIMARY KEY (`ID`),
  KEY `USER_ID` (`USER_ID`)
) ENGINE=MyISAM AUTO_INCREMENT=3 DEFAULT CHARSET=utf8;

/*Data for the table `gpsdevices` */

/*Table structure for table `gpslocations` */

DROP TABLE IF EXISTS `gpslocations`;

CREATE TABLE `gpslocations` (
  `ID` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `TITLE` varchar(255) NOT NULL DEFAULT '',
  `LAT` float NOT NULL DEFAULT '0',
  `LON` float NOT NULL DEFAULT '0',
  `RANGE` float NOT NULL DEFAULT '0',
  `VIRTUAL_USER_ID` int(10) NOT NULL DEFAULT '0',
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM AUTO_INCREMENT=12 DEFAULT CHARSET=utf8;

/*Data for the table `gpslocations` */

insert  into `gpslocations`(`ID`,`TITLE`,`LAT`,`LON`,`RANGE`,`VIRTUAL_USER_ID`) values (11,'Location 1',52.9471,21.668,500,0);

/*Table structure for table `gpslog` */

DROP TABLE IF EXISTS `gpslog`;

CREATE TABLE `gpslog` (
  `ID` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `ADDED` datetime DEFAULT NULL,
  `LAT` float NOT NULL DEFAULT '0',
  `LON` float NOT NULL DEFAULT '0',
  `ALT` float NOT NULL DEFAULT '0',
  `PROVIDER` varchar(30) NOT NULL DEFAULT '',
  `SPEED` float NOT NULL DEFAULT '0',
  `BATTLEVEL` int(3) NOT NULL DEFAULT '0',
  `CHARGING` int(3) NOT NULL DEFAULT '0',
  `DEVICEID` varchar(255) NOT NULL DEFAULT '',
  `DEVICE_ID` int(10) NOT NULL DEFAULT '0',
  `LOCATION_ID` int(10) NOT NULL DEFAULT '0',
  `ACCURACY` float NOT NULL DEFAULT '0',
  PRIMARY KEY (`ID`),
  KEY `DEVICE_ID` (`DEVICE_ID`),
  KEY `LOCATION_ID` (`LOCATION_ID`)
) ENGINE=MyISAM AUTO_INCREMENT=2912 DEFAULT CHARSET=utf8;

/*Data for the table `gpslog` */

/*Table structure for table `history` */

DROP TABLE IF EXISTS `history`;

CREATE TABLE `history` (
  `ID` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `ADDED` datetime DEFAULT NULL,
  `OBJECT_ID` int(10) NOT NULL DEFAULT '0',
  `METHOD_ID` int(10) NOT NULL DEFAULT '0',
  `VALUE_ID` int(10) NOT NULL DEFAULT '0',
  `OLD_VALUE` varchar(255) NOT NULL DEFAULT '',
  `NEW_VALUE` varchar(255) NOT NULL DEFAULT '',
  `DETAILS` text,
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM AUTO_INCREMENT=2521 DEFAULT CHARSET=utf8;

/*Data for the table `history` */

/*Table structure for table `ignore_updates` */

DROP TABLE IF EXISTS `ignore_updates`;

CREATE TABLE `ignore_updates` (
  `ID` tinyint(3) unsigned NOT NULL AUTO_INCREMENT,
  `NAME` varchar(50) NOT NULL DEFAULT '',
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM AUTO_INCREMENT=2 DEFAULT CHARSET=utf8;

/*Data for the table `ignore_updates` */

/*Table structure for table `jobs` */

DROP TABLE IF EXISTS `jobs`;

CREATE TABLE `jobs` (
  `ID` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `TITLE` varchar(255) NOT NULL DEFAULT '',
  `COMMANDS` text NOT NULL,
  `RUNTIME` datetime DEFAULT NULL,
  `EXPIRE` datetime DEFAULT NULL,
  `PROCESSED` int(3) NOT NULL DEFAULT '0',
  `STARTED` datetime DEFAULT NULL,
  `EXPIRED` int(3) NOT NULL DEFAULT '0',
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM AUTO_INCREMENT=180729 DEFAULT CHARSET=utf8;

/*Data for the table `jobs` */

/*Table structure for table `layouts` */

DROP TABLE IF EXISTS `layouts`;

CREATE TABLE `layouts` (
  `ID` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `TITLE` varchar(255) NOT NULL DEFAULT '',
  `PRIORITY` int(10) NOT NULL DEFAULT '0',
  `TYPE` varchar(255) NOT NULL DEFAULT '',
  `CODE` text,
  `APP` varchar(255) NOT NULL DEFAULT '',
  `URL` char(255) NOT NULL DEFAULT '',
  `DETAILS` text,
  `REFRESH` int(10) NOT NULL DEFAULT '0',
  `ICON` varchar(50) NOT NULL DEFAULT '',
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM AUTO_INCREMENT=13 DEFAULT CHARSET=utf8;

/*Data for the table `layouts` */

insert  into `layouts`(`ID`,`TITLE`,`PRIORITY`,`TYPE`,`CODE`,`APP`,`URL`,`DETAILS`,`REFRESH`,`ICON`) values (6,'<#LANG_APP_PRODUCTS#>',70,'app','','app_products','','',0,'');
insert  into `layouts`(`ID`,`TITLE`,`PRIORITY`,`TYPE`,`CODE`,`APP`,`URL`,`DETAILS`,`REFRESH`,`ICON`) values (7,'<#LANG_MODULE_SCENES#>',550,'app','','scenes','','',0,'');
insert  into `layouts`(`ID`,`TITLE`,`PRIORITY`,`TYPE`,`CODE`,`APP`,`URL`,`DETAILS`,`REFRESH`,`ICON`) values (8,'<#LANG_WELCOME_GREETING#>',1000,'html','<div style=\"padding-left:50px;padding-top:30px\">\r\n<h1><#LANG_WELCOME_GREETING#></h1>\r\n&nbsp;\r\n<p style=\"font-size:14px\">\r\n<#LANG_WELCOME_TEXT#>\r\n</p>\r\n</div>','','','',0,'');
insert  into `layouts`(`ID`,`TITLE`,`PRIORITY`,`TYPE`,`CODE`,`APP`,`URL`,`DETAILS`,`REFRESH`,`ICON`) values (9,'<#LANG_APP_CALENDAR#>',100,'app','','app_calendar','','',0,'');
insert  into `layouts`(`ID`,`TITLE`,`PRIORITY`,`TYPE`,`CODE`,`APP`,`URL`,`DETAILS`,`REFRESH`,`ICON`) values (10,'<#LANG_APP_MEDIA_BROWSER#>',200,'app','','app_mediabrowser','','',0,'');
insert  into `layouts`(`ID`,`TITLE`,`PRIORITY`,`TYPE`,`CODE`,`APP`,`URL`,`DETAILS`,`REFRESH`,`ICON`) values (12,'GPS',0,'app','','app_gpstrack','','',0,'');

/*Table structure for table `locations` */

DROP TABLE IF EXISTS `locations`;

CREATE TABLE `locations` (
  `ID` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `TITLE` varchar(255) NOT NULL DEFAULT '',
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM AUTO_INCREMENT=11 DEFAULT CHARSET=utf8;

/*Data for the table `locations` */

insert  into `locations`(`ID`,`TITLE`) values (1,'Kitchen');
insert  into `locations`(`ID`,`TITLE`) values (4,'Livingroom');
insert  into `locations`(`ID`,`TITLE`) values (5,'Bedroom');
insert  into `locations`(`ID`,`TITLE`) values (6,'Hall');
insert  into `locations`(`ID`,`TITLE`) values (7,'Bathroom');
insert  into `locations`(`ID`,`TITLE`) values (8,'Toilet');
insert  into `locations`(`ID`,`TITLE`) values (10,'Child\'s bedroom');

/*Table structure for table `log4php_log` */

DROP TABLE IF EXISTS `log4php_log`;

CREATE TABLE `log4php_log` (
  `timestamp` datetime DEFAULT NULL,
  `logger` varchar(256) DEFAULT NULL,
  `level` varchar(32) DEFAULT NULL,
  `message` varchar(4000) DEFAULT NULL,
  `thread` int(11) DEFAULT NULL,
  `file` varchar(255) DEFAULT NULL,
  `line` varchar(10) DEFAULT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

/*Data for the table `log4php_log` */

/*Table structure for table `media_favorites` */

DROP TABLE IF EXISTS `media_favorites`;

CREATE TABLE `media_favorites` (
  `ID` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `PATH` varchar(255) NOT NULL DEFAULT '',
  `TITLE` varchar(255) NOT NULL DEFAULT '',
  `LIST_ID` int(10) unsigned NOT NULL DEFAULT '0',
  `COLLECTION_ID` int(10) unsigned NOT NULL DEFAULT '0',
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM AUTO_INCREMENT=3 DEFAULT CHARSET=utf8;

/*Data for the table `media_favorites` */

insert  into `media_favorites`(`ID`,`PATH`,`TITLE`,`LIST_ID`,`COLLECTION_ID`) values (2,'./music/Beyonce - Beyonce (2013)/','music/Beyonce - Beyonce (2013)',0,9);

/*Table structure for table `methods` */

DROP TABLE IF EXISTS `methods`;

CREATE TABLE `methods` (
  `ID` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `OBJECT_ID` int(10) NOT NULL DEFAULT '0',
  `CLASS_ID` int(10) NOT NULL DEFAULT '0',
  `TITLE` varchar(255) NOT NULL DEFAULT '',
  `DESCRIPTION` text,
  `CODE` text,
  `CALL_PARENT` int(3) NOT NULL DEFAULT '0',
  `SCRIPT_ID` int(10) NOT NULL DEFAULT '0',
  `EXECUTED` datetime DEFAULT NULL,
  `EXECUTED_PARAMS` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`ID`),
  KEY `OBJECT_ID` (`OBJECT_ID`),
  KEY `CLASS_ID` (`CLASS_ID`)
) ENGINE=MyISAM AUTO_INCREMENT=103 DEFAULT CHARSET=utf8;

/*Data for the table `methods` */

insert  into `methods`(`ID`,`OBJECT_ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`CODE`,`CALL_PARENT`,`SCRIPT_ID`,`EXECUTED`,`EXECUTED_PARAMS`) values (1,0,1,'KeyPressed','событие, возникающее при нажатии на кнопку','$this->setProperty(\"lastTimePressed\",time());',0,0,NULL,NULL);
insert  into `methods`(`ID`,`OBJECT_ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`CODE`,`CALL_PARENT`,`SCRIPT_ID`,`EXECUTED`,`EXECUTED_PARAMS`) values (23,0,11,'say','','echo \"notify: \".utf2win($params[\'say\']).\"<br>\";\r\n$say=utf2win($params[\'say\']);\r\n$say=str_replace(\' \',\'..\',$say);\r\necho (\'\"c:\\\\program files\\\\Growl for windows\\\\growlnotify.com\" /t:Alice \'.$say.\'\');\r\nexec(\'\"c:\\\\program files\\\\Growl for windows\\\\growlnotify.com\" /t:Alice \'.$say.\'\');',0,0,NULL,NULL);
insert  into `methods`(`ID`,`OBJECT_ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`CODE`,`CALL_PARENT`,`SCRIPT_ID`,`EXECUTED`,`EXECUTED_PARAMS`) values (14,0,7,'onNewMinute','','',0,0,'2015-02-04 15:00:00','a:4:{s:6:\"object\";s:10:\"ClockChime\";s:2:\"op\";s:1:\"m\";s:1:\"m\";s:11:\"onNewMinute\";s:21:\"ORIGINAL_OBJECT_TITLE\";s:10:\"ClockChime\";}');
insert  into `methods`(`ID`,`OBJECT_ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`CODE`,`CALL_PARENT`,`SCRIPT_ID`,`EXECUTED`,`EXECUTED_PARAMS`) values (15,0,7,'onNewHour','','',0,0,'2015-02-04 15:00:00','a:4:{s:6:\"object\";s:10:\"ClockChime\";s:2:\"op\";s:1:\"m\";s:1:\"m\";s:9:\"onNewHour\";s:21:\"ORIGINAL_OBJECT_TITLE\";s:10:\"ClockChime\";}');
insert  into `methods`(`ID`,`OBJECT_ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`CODE`,`CALL_PARENT`,`SCRIPT_ID`,`EXECUTED`,`EXECUTED_PARAMS`) values (16,0,9,'Connected','','',0,0,'2015-05-15 23:15:54','a:2:{s:5:\"STATE\";s:7:\"default\";s:21:\"ORIGINAL_OBJECT_TITLE\";s:6:\"USBDev\";}');
insert  into `methods`(`ID`,`OBJECT_ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`CODE`,`CALL_PARENT`,`SCRIPT_ID`,`EXECUTED`,`EXECUTED_PARAMS`) values (55,0,18,'Lost','','',0,0,NULL,NULL);
insert  into `methods`(`ID`,`OBJECT_ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`CODE`,`CALL_PARENT`,`SCRIPT_ID`,`EXECUTED`,`EXECUTED_PARAMS`) values (18,6,0,'onNewMinute','','$h=(int)date(\'G\',time());\r\n$m=date(\'i\',time());\r\n\r\n\r\nif (isWeekDay()) {\r\n\r\n}\r\n\r\n\r\nif (($h>=8) && getGlobal(\'clockChimeEnabled\')) {\r\n if ($m==\"00\") {\r\n   say(timeNow(),1);\r\n }\r\n}\r\n\r\n\r\nsetGlobal(\'timeNow\',date(\'H:i\'));\r\n\r\n$homeStatus=date(\'H:i\');\r\nif (getGlobal(\'NobodyHomeMode.active\')) {\r\n $homeStatus.=\' Дома никого\';\r\n} else {\r\n $homeStatus.=\' Дома кто-то есть\';\r\n}\r\n\r\n$homeStatus.=\' \'.getGlobal(\'Security.stateDetails\');\r\n$homeStatus.=\' \'.getGlobal(\'System.stateDetails\');\r\n$homeStatus.=\' \'.getGlobal(\'Communication.stateDetails\');\r\nsetGlobal(\'HomeStatus\',$homeStatus);\r\n\r\n if (timeBetween(getGlobal(\'SunRiseTime\'),getGlobal(\'SunSetTime\')) && getGlobal(\'isDark\')==\"1\") {\r\n  setGlobal(\"isDark\",0);\r\n  callMethod(\'DarknessMode.deactivate\');  \r\n } elseif (!timeBetween(getGlobal(\'SunRiseTime\'),getGlobal(\'SunSetTime\')) && getGlobal(\'isDark\')!=\"1\") {\r\n  setGlobal(\"isDark\",1);\r\n  callMethod(\'DarknessMode.activate\');    \r\n }\r\n \r\n  if (timeIs(getGlobal(\'SunRiseTime\'))) {\r\n  say(\'Всходит солнце\');\r\n }\r\n if (timeIs(getGlobal(\'SunSetTime\'))) {\r\n  say(\'Солнце заходит\',2);\r\n }\r\n \r\nif (timeIs(\"23:30\") && (gg(\"EconomMode.active\")!=\"1\") && (gg(\"NobodyHomeMode.active\")==\"1\")) {\r\n say(\"Похоже никого нет сегодня, можно сэкономить немного.\");\r\n callMethod(\'EconomMode.activate\');\r\n}\r\n\r\nif (timeIs(\'20:00\')) {\r\n callMethod(\'NightMode.activate\');\r\n} elseif (timeIs(\'08:00\')) {\r\n callMethod(\'NightMode.deactivate\');\r\n}\r\n\r\nif (timeIs(\"03:00\")) {\r\n runScript(\"systemMaintenance\");\r\n}\r\n\r\nif (gg(\'ThisComputer.AlarmStatus\') && timeIs(gg(\'ThisComputer.AlarmTime\'))) {\r\n runScript(\'MorningAlarm\');\r\n}',1,0,'2015-02-04 15:00:00','a:3:{s:6:\"object\";s:10:\"ClockChime\";s:2:\"op\";s:1:\"m\";s:1:\"m\";s:11:\"onNewMinute\";}');
insert  into `methods`(`ID`,`OBJECT_ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`CODE`,`CALL_PARENT`,`SCRIPT_ID`,`EXECUTED`,`EXECUTED_PARAMS`) values (19,4,0,'Connected','','if ($params[\'serial\']==\'\' && $params[\'devname\']!=\'\') {\r\n $params[\'serial\']=$params[\'devname\'];\r\n}\r\n\r\n$device=SQLSelectOne(\"SELECT * FROM usbdevices WHERE SERIAL LIKE \'\".$params[\'serial\'].\"\'\");\r\nif (!$device[\'ID\']) {\r\n // new device connected\r\n //say(\"Подключено новое устройство\",1);\r\n $device=array();\r\n $device[\'SERIAL\']=$params[\'serial\'];\r\n $device[\'TITLE\']=\'устройство \'.$params[\'devname\'];\r\n $device[\'FIRST_FOUND\']=date(\'Y-m-d H:i:s\');\r\n $device[\'LAST_FOUND\']=date(\'Y-m-d H:i:s\');\r\n $device[\'LOG\'].=$device[\'FIRST_FOUND\'].\' подключено (впервые)\'.\"\\n\";\r\n $device[\'ID\']=SQLInsert(\'usbdevices\',$device);\r\n} else {\r\n // device already in our database\r\n //say(\"Подключено \".$device[\'TITLE\'],1);\r\n if ($device[\'USER_ID\']) {\r\n  $user=SQLSelectOne(\"SELECT * FROM users WHERE ID=\'\".$device[\'USER_ID\'].\"\'\");\r\n  if ($user[\'ID\']) {\r\n    //$user[\'NAME\']; // теперь мы знаем имя пользователя, связанного с этим устройством\r\n  }\r\n }\r\n $device[\'LAST_FOUND\']=date(\'Y-m-d H:i:s\');\r\n $device[\'LOG\']=$device[\'LAST_FOUND\'].\' подключено\'.\"\\n\".$device[\'LOG\'];\r\n SQLUpdate(\'usbdevices\',$device);\r\n if ($device[\'SCRIPT_ID\']!=\'\') {\r\n  runScript($device[\'SCRIPT_ID\'],$params);\r\n } elseif ($device[\'SCRIPT\']!=\'\') {\r\n  eval($device[\'SCRIPT\']);\r\n }\r\n}',1,0,'2015-05-15 23:15:54','a:1:{s:5:\"STATE\";s:7:\"default\";}');
insert  into `methods`(`ID`,`OBJECT_ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`CODE`,`CALL_PARENT`,`SCRIPT_ID`,`EXECUTED`,`EXECUTED_PARAMS`) values (20,0,10,'WakedUp','','',0,0,NULL,NULL);
insert  into `methods`(`ID`,`OBJECT_ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`CODE`,`CALL_PARENT`,`SCRIPT_ID`,`EXECUTED`,`EXECUTED_PARAMS`) values (25,0,10,'onIdle','','',0,0,NULL,NULL);
insert  into `methods`(`ID`,`OBJECT_ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`CODE`,`CALL_PARENT`,`SCRIPT_ID`,`EXECUTED`,`EXECUTED_PARAMS`) values (27,0,10,'StartUp','','',0,0,'2015-02-04 14:59:49','a:4:{s:6:\"object\";s:12:\"ThisComputer\";s:2:\"op\";s:1:\"m\";s:1:\"m\";s:7:\"StartUp\";s:21:\"ORIGINAL_OBJECT_TITLE\";s:12:\"ThisComputer\";}');
insert  into `methods`(`ID`,`OBJECT_ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`CODE`,`CALL_PARENT`,`SCRIPT_ID`,`EXECUTED`,`EXECUTED_PARAMS`) values (29,0,10,'commandReceived','получение новой команды','',0,0,'2015-05-16 11:20:54','a:2:{s:7:\"command\";s:8:\"умри\";s:21:\"ORIGINAL_OBJECT_TITLE\";s:12:\"ThisComputer\";}');
insert  into `methods`(`ID`,`OBJECT_ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`CODE`,`CALL_PARENT`,`SCRIPT_ID`,`EXECUTED`,`EXECUTED_PARAMS`) values (30,7,0,'commandReceived','','$command=$params[\'command\'];\r\n\r\n$short_command=\'\';\r\n$dt=recognizeTime($command,$short_command);\r\n\r\nif (preg_match(\'/скажи сколько время/is\',$command)) {\r\n if ($dt>0) {\r\n  addScheduledJob(\"command\".$dt,\"processCommand(\'\".$short_command.\"\');\",$dt);\r\n  say(\'Задача принята\',2);\r\n  return;\r\n }\r\n global $voicemode;\r\n $voicemode=\'on\';\r\n say(\'Сейчас \'.timeNow(),2);\r\n} elseif (preg_match(\'/сколько время/is\',$command)) {\r\n if ($dt>0) {\r\n  addScheduledJob(\"command\".$dt,\"processCommand(\'\".$short_command.\"\');\",$dt);\r\n  say(\'Задача принята\');\r\n  echo $short_command;\r\n  return;\r\n }\r\n say(\'Сейчас \'.timeNow());\r\n} elseif (preg_match(\'/повтори (.+)/is\',$command,$m) || preg_match(\'/скажи (.+)/is\',$command,$m)) {\r\n if ($dt>0) {\r\n  addScheduledJob(\"command\".$dt,\"processCommand(\'\".$short_command.\"\');\",$dt);\r\n  say(\'Задача принята\',2);\r\n  return;\r\n }\r\n global $voicemode;\r\n $voicemode=\'on\';\r\n say($m[1],2);\r\n} else {\r\n say(\'Неизвестная команда...\',2);\r\n}',1,0,'2015-05-16 11:20:54','a:1:{s:7:\"command\";s:8:\"умри\";}');
insert  into `methods`(`ID`,`OBJECT_ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`CODE`,`CALL_PARENT`,`SCRIPT_ID`,`EXECUTED`,`EXECUTED_PARAMS`) values (31,0,12,'onNewMessage','','',0,0,NULL,NULL);
insert  into `methods`(`ID`,`OBJECT_ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`CODE`,`CALL_PARENT`,`SCRIPT_ID`,`EXECUTED`,`EXECUTED_PARAMS`) values (32,0,12,'onStatusChange','','',0,0,NULL,NULL);
insert  into `methods`(`ID`,`OBJECT_ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`CODE`,`CALL_PARENT`,`SCRIPT_ID`,`EXECUTED`,`EXECUTED_PARAMS`) values (33,10,0,'onStatusChange',NULL,'echo \"status received: \".$params[\'status\'];',1,0,NULL,NULL);
insert  into `methods`(`ID`,`OBJECT_ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`CODE`,`CALL_PARENT`,`SCRIPT_ID`,`EXECUTED`,`EXECUTED_PARAMS`) values (34,10,0,'onNewMessage','',' global $voicemode;\r\n $voicemode=\'off\';\r\n processCommand($params[\'message\']);',1,0,NULL,NULL);
insert  into `methods`(`ID`,`OBJECT_ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`CODE`,`CALL_PARENT`,`SCRIPT_ID`,`EXECUTED`,`EXECUTED_PARAMS`) values (45,0,10,'powerConnected','','',0,0,NULL,NULL);
insert  into `methods`(`ID`,`OBJECT_ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`CODE`,`CALL_PARENT`,`SCRIPT_ID`,`EXECUTED`,`EXECUTED_PARAMS`) values (46,0,10,'powerDisconnected','','',0,0,NULL,NULL);
insert  into `methods`(`ID`,`OBJECT_ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`CODE`,`CALL_PARENT`,`SCRIPT_ID`,`EXECUTED`,`EXECUTED_PARAMS`) values (48,7,0,'powerDisconnected',NULL,'say(\"Отключено питание\");',1,0,NULL,NULL);
insert  into `methods`(`ID`,`OBJECT_ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`CODE`,`CALL_PARENT`,`SCRIPT_ID`,`EXECUTED`,`EXECUTED_PARAMS`) values (54,0,18,'Found','','',0,0,NULL,NULL);
insert  into `methods`(`ID`,`OBJECT_ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`CODE`,`CALL_PARENT`,`SCRIPT_ID`,`EXECUTED`,`EXECUTED_PARAMS`) values (56,13,0,'Found','','// new device\r\n\r\n$tm=registeredEventTime(\'btcall\'); \r\nif ((time()-$tm)>60 || $tm<0) {\r\n registerEvent(\'btcall\'); \r\n}\r\n\r\n\r\nif ($params[\'new\']) {\r\n //say(\'Обнаружено новое блютуз устройство\');\r\n}\r\nif ($params[\'user\']!=\'\') {\r\n //say($params[\'user\'].\' где-то рядом\');\r\n}',1,0,NULL,NULL);
insert  into `methods`(`ID`,`OBJECT_ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`CODE`,`CALL_PARENT`,`SCRIPT_ID`,`EXECUTED`,`EXECUTED_PARAMS`) values (57,13,0,'Lost','','// device lost\r\n',1,1,NULL,NULL);
insert  into `methods`(`ID`,`OBJECT_ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`CODE`,`CALL_PARENT`,`SCRIPT_ID`,`EXECUTED`,`EXECUTED_PARAMS`) values (59,0,21,'checkState','',' ',0,0,'2015-05-17 21:56:36','a:1:{s:21:\"ORIGINAL_OBJECT_TITLE\";s:13:\"Communication\";}');
insert  into `methods`(`ID`,`OBJECT_ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`CODE`,`CALL_PARENT`,`SCRIPT_ID`,`EXECUTED`,`EXECUTED_PARAMS`) values (60,0,21,'stateChanged','','',0,0,'2015-05-15 22:53:15','a:2:{s:5:\"STATE\";s:3:\"red\";s:21:\"ORIGINAL_OBJECT_TITLE\";s:6:\"System\";}');
insert  into `methods`(`ID`,`OBJECT_ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`CODE`,`CALL_PARENT`,`SCRIPT_ID`,`EXECUTED`,`EXECUTED_PARAMS`) values (61,0,22,'statusChanged','','if ($params[\'status\']) {\r\n $this->setProperty(\'status\',$params[\'status\']);\r\n}\r\n$this->setProperty(\'updatedTimestamp\',time());\r\n\r\n$this->setProperty(\"alive\",1);\r\n$ot=$this->object_title;\r\n$alive_timeout=(int)$this->getProperty(\"aliveTimeOut\");\r\nif (!$alive_timeout) {\r\n $alive_timeout=12*60*60;\r\n}\r\nclearTimeOut($ot.\"_alive\");\r\nsetTimeOut($ot.\"_alive\",\"sg(\'\".$ot.\".alive\',0);\",$alive_timeout);',0,0,'0000-00-00 00:00:00','');
insert  into `methods`(`ID`,`OBJECT_ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`CODE`,`CALL_PARENT`,`SCRIPT_ID`,`EXECUTED`,`EXECUTED_PARAMS`) values (62,0,23,'statusChanged','','$this->setProperty(\'status\',$params[\'status\']); // выставляем статус сенсора\r\n$this->setProperty(\'updatedTimestamp\',time()); // выставляем время срабатывания сенсора\r\n\r\n$this->setProperty(\'alive\',1);\r\n$ot=$this->object_title;\r\n$alive_timeout=(int)$this->getProperty(\"aliveTimeOut\");\r\nif (!$alive_timeout) {\r\n $alive_timeout=24*60*60;\r\n}\r\nclearTimeOut($ot.\"_alive\");\r\nsetTimeOut($ot.\"_alive\",\"sg(\'\".$ot.\".alive\',0);\",$alive_timeout);\r\n\r\nif ($params[\'status\']) {\r\n \r\n $this->setProperty(\'motionDetected\',1);\r\n clearTimeOut($this->object_title.\'_detected\'); \r\n setTimeOut($this->object_title.\'_detected\',\"setGlobal(\'\".$this->object_title.\".motionDetected\',0);\",30);\r\n\r\n $linked_room=$this->getProperty(\'LinkedRoom\');\r\n if ($linked_room!=\'\') {\r\n  callMethod($linked_room.\'.onActivity\');\r\n }\r\n\r\n if ($this->object_title==\'sensorMovement3\' || $this->object_title==\'sensorMovementRemote1\' || $this->object_title==\'sensorMovementRemote2\') {\r\n  //|| $this->object_title==\'sensorMovement5\'\r\n  return; // не реагируем на движение в спальне, по ip-сенсорам и по сенсору на втром этаже\r\n }\r\n\r\n ClearTimeOut(\"nobodyHome\"); \r\n SetTimeOut(\"nobodyHome\",\"callMethod(\'NobodyHomeMode.activate\');\", 1*60*60); // выполняем если целый час никого не было\r\n\r\n if (getGlobal(\'NobodyHomeMode.active\')) {\r\n  callMethod(\'NobodyHomeMode.deactivate\');\r\n }\r\n\r\n $last_register=registeredEventTime(\'inhouseMovement\'); // проверяем когда в последний раз срабатывало событие \"движение внутри дома\"\r\n  registerEvent(\'inhouseMovement\',$this->name,2); // регистрируем событие \"движение внутри дома\" \r\n  if (timeBetween(\'05:00\', \'12:00\') && ((time()-$last_register)>2*60*60)) {\r\n   runScript(\'Greeting\'); // запускаем скрипт \"доброе утро\"\r\n  }\r\n}',0,0,'2014-09-05 13:00:59','a:5:{s:2:\"op\";s:1:\"m\";s:6:\"object\";s:13:\"MotionSensor4\";s:1:\"m\";s:13:\"statusChanged\";s:6:\"status\";s:1:\"1\";s:21:\"ORIGINAL_OBJECT_TITLE\";s:13:\"MotionSensor4\";}');
insert  into `methods`(`ID`,`OBJECT_ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`CODE`,`CALL_PARENT`,`SCRIPT_ID`,`EXECUTED`,`EXECUTED_PARAMS`) values (63,0,24,'modeChanged','','$this->setProperty(\"updated\",time());\r\n$this->setProperty(\"updatedTime\",date(\'H:i\'));\r\nif ($this->getProperty(\'active\')) {\r\n say(\"Режим \".$this->getProperty(\'title\').\" активирован.\");\r\n} else {\r\n say(\"Режим \".$this->getProperty(\'title\').\" выключен.\");\r\n}',0,0,'2015-01-29 12:51:00','a:4:{s:8:\"PROPERTY\";s:6:\"active\";s:9:\"NEW_VALUE\";s:1:\"0\";s:9:\"OLD_VALUE\";s:1:\"1\";s:21:\"ORIGINAL_OBJECT_TITLE\";s:12:\"DarknessMode\";}');
insert  into `methods`(`ID`,`OBJECT_ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`CODE`,`CALL_PARENT`,`SCRIPT_ID`,`EXECUTED`,`EXECUTED_PARAMS`) values (64,0,24,'activate','','$this->setProperty(\'active\',1);',0,0,'2015-01-29 08:50:00','a:1:{s:21:\"ORIGINAL_OBJECT_TITLE\";s:12:\"DarknessMode\";}');
insert  into `methods`(`ID`,`OBJECT_ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`CODE`,`CALL_PARENT`,`SCRIPT_ID`,`EXECUTED`,`EXECUTED_PARAMS`) values (65,0,24,'deactivate','','$this->setProperty(\'active\',0);',0,0,'2015-01-29 12:51:00','a:1:{s:21:\"ORIGINAL_OBJECT_TITLE\";s:12:\"DarknessMode\";}');
insert  into `methods`(`ID`,`OBJECT_ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`CODE`,`CALL_PARENT`,`SCRIPT_ID`,`EXECUTED`,`EXECUTED_PARAMS`) values (66,0,25,'onActivity','','$latestActivity=$this->getProperty(\'LatestActivity\');\r\n$this->setProperty(\'LatestActivity\',time());\r\n$this->setProperty(\'LatestActivityTime\',date(\'H:i\'));\r\n\r\n$this->setProperty(\'SomebodyHere\',1);\r\n$ot=$this->object_title;\r\nif ($this->getProperty(\"IdleDelay\")) {\r\n $activity_timeout=(int)$this->getProperty(\"IdleDelay\");\r\n} else {\r\n $activity_timeout=10*60;\r\n}\r\nclearTimeOut($ot.\"_activity_timeout\");\r\nsetTimeOut($ot.\"_activity_timeout\",\"callMethod(\'\".$ot.\".onIdle\');\",$activity_timeout);\r\n$this->callMethod(\"updateActivityStatus\");\r\n',0,0,'2014-09-05 13:01:00','a:1:{s:21:\"ORIGINAL_OBJECT_TITLE\";s:10:\"Kinderroom\";}');
insert  into `methods`(`ID`,`OBJECT_ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`CODE`,`CALL_PARENT`,`SCRIPT_ID`,`EXECUTED`,`EXECUTED_PARAMS`) values (67,0,25,'onIdle','','$this->setProperty(\'SomebodyHere\',0);',0,0,'2014-09-05 12:24:46','a:1:{s:21:\"ORIGINAL_OBJECT_TITLE\";s:10:\"Kinderroom\";}');
insert  into `methods`(`ID`,`OBJECT_ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`CODE`,`CALL_PARENT`,`SCRIPT_ID`,`EXECUTED`,`EXECUTED_PARAMS`) values (68,0,26,'refresh','','$status=$this->getProperty(\"status\");\r\nif ($status) {\r\n $this->callMethod(\'turnOn\');\r\n} else {\r\n $this->callMethod(\'turnOff\');\r\n}',0,0,'2014-09-05 11:01:41','a:3:{s:5:\"VALUE\";s:1:\"0\";s:9:\"OLD_VALUE\";s:1:\"1\";s:21:\"ORIGINAL_OBJECT_TITLE\";s:4:\"noo2\";}');
insert  into `methods`(`ID`,`OBJECT_ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`CODE`,`CALL_PARENT`,`SCRIPT_ID`,`EXECUTED`,`EXECUTED_PARAMS`) values (69,0,26,'switch','','$status=$this->getProperty(\"status\");\r\nif ($status) {\r\n $this->callMethod(\'turnOff\');\r\n} else {\r\n $this->callMethod(\'turnOn\');\r\n}',0,0,NULL,NULL);
insert  into `methods`(`ID`,`OBJECT_ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`CODE`,`CALL_PARENT`,`SCRIPT_ID`,`EXECUTED`,`EXECUTED_PARAMS`) values (70,0,26,'turnOff','','$this->setProperty(\"status\",0);',0,0,NULL,NULL);
insert  into `methods`(`ID`,`OBJECT_ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`CODE`,`CALL_PARENT`,`SCRIPT_ID`,`EXECUTED`,`EXECUTED_PARAMS`) values (71,0,26,'turnOn','','$this->setProperty(\"status\",1);',0,0,NULL,NULL);
insert  into `methods`(`ID`,`OBJECT_ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`CODE`,`CALL_PARENT`,`SCRIPT_ID`,`EXECUTED`,`EXECUTED_PARAMS`) values (72,0,19,'tempChanged','','//$params[\'t\']\r\n $this->setProperty(\"updated\",time());\r\n $this->setProperty(\"updatedTime\",date(\"H:i\",time()));\r\n $this->setProperty(\"alive\",1); \r\n \r\n$ot=$this->object_title;\r\n$alive_timeout=(int)$this->getProperty(\"aliveTimeOut\");\r\nif (!$alive_timeout) {\r\n $alive_timeout=30*60;\r\n}\r\nclearTimeOut($ot.\"_alive\");\r\nsetTimeOut($ot.\"_alive\",\"sg(\'\".$ot.\".alive\',0);\",$alive_timeout); \r\n\r\nif (!isset($params[\'t\'])) {\r\n return;\r\n}\r\n\r\n\r\n$old_temp=$this->getProperty(\'temp\');\r\n$t=round($params[\'t\'],1);\r\n\r\nif ($t>110) return;\r\n\r\n$this->setProperty(\'temp\',$t);\r\nif ($params[\'uptime\']) {\r\n $this->setProperty(\'uptime\',$params[\'uptime\']);\r\n}\r\n\r\nif ($t>$old_temp) {\r\n $d=1;\r\n} elseif ($t<$old_temp) {\r\n $d=-1;\r\n} else {\r\n $d=0;\r\n}\r\n$this->setProperty(\'direction\',$d);\r\n\r\n$linked_room=$this->getProperty(\"LinkedRoom\");\r\nif ($linked_room) {\r\n setGlobal($linked_room.\'.Temperature\',$t);\r\n}',0,0,'2014-09-05 12:54:30','a:2:{s:1:\"t\";d:22.5;s:21:\"ORIGINAL_OBJECT_TITLE\";s:12:\"TempSensor03\";}');
insert  into `methods`(`ID`,`OBJECT_ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`CODE`,`CALL_PARENT`,`SCRIPT_ID`,`EXECUTED`,`EXECUTED_PARAMS`) values (73,17,0,'checkState','','$details=array();\r\n$red_state=0;\r\n$yellow_state=0;\r\n\r\n$cycles=array(\'states\'=>\'states\',\'main\'=>\'main\',\'execs\'=>\'exec\',\'scheduler\'=>\'scheduler\');\r\nforeach($cycles as $k=>$v) {\r\n $tm=getGlobal(\'ThisComputer.cycle_\'.$k.\'Run\');\r\n if (time()-$tm>5*60) {\r\n  $red_state=1;\r\n  $details[]=$v.\" \".LANG_GENERAL_CYCLE.\" \".LANG_GENERAL_STOPPED.\".\";\r\n }\r\n}\r\n\r\n$cycles=array(\'ping\'=>\'ping\',\'webvars\'=>\'webvars\',\'watchfolders\'=>\'watch folders\',\'rss\'=>\'RSS\');\r\nforeach($cycles as $k=>$v) {\r\n $tm=getGlobal(\'ThisComputer.cycle_\'.$k.\'Run\');\r\n if (time()-$tm>10*60) {\r\n  $yellow_state=1;\r\n  $details[]=$v.\" \".LANG_GENERAL_CYCLE.\" \".LANG_GENERAL_STOPPED.\".\";  \r\n }\r\n}\r\n\r\nif ($red_state) {\r\n $state=\'red\';\r\n $state_title=LANG_GENERAL_RED; \r\n} elseif ($yellow_state) {\r\n $state=\'yellow\';\r\n $state_title=LANG_GENERAL_YELLOW;  \r\n} else {\r\n $state=\'green\';\r\n $state_title=LANG_GENERAL_GREEN;   \r\n}\r\n\r\n$new_details=implode(\". \",$details);\r\nif ($this->getProperty(\"stateDetails\")!=$new_details) {\r\n $this->setProperty(\'stateDetails\',$new_details);\r\n}\r\n\r\nif ($this->getProperty(\'stateColor\')!=$state) {\r\n $this->setProperty(\'stateColor\',$state);\r\n $this->setProperty(\'stateTitle\',$state_title);\r\n if ($state!=\'green\') {\r\n  say(LANG_GENERAL_SYSTEM_STATE.\" \".LANG_GENERAL_CHANGED_TO.\" \".$state_title.\".\");\r\n  say(implode(\". \",$details));\r\n } else {\r\n  say(LANG_GENERAL_SYSTEM_STATE.\" \".LANG_GENERAL_RESTORED_TO.\" \".$state_title);\r\n }\r\n $this->callMethod(\'stateChanged\');\r\n}',1,0,'2015-05-17 21:56:36','');
insert  into `methods`(`ID`,`OBJECT_ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`CODE`,`CALL_PARENT`,`SCRIPT_ID`,`EXECUTED`,`EXECUTED_PARAMS`) values (74,18,0,'checkState','','$details=array();\r\n$red_state=0;\r\n$yellow_state=0;\r\n\r\nif (!isOnline(\'Internet\')) {\r\n $yellow_state=1;\r\n $details[]=LANG_GENERAL_NO_INTERNET_ACCESS;\r\n}\r\n\r\nif ($red_state) {\r\n $state=\'red\';\r\n $state_title=LANG_GENERAL_RED; \r\n} elseif ($yellow_state) {\r\n $state=\'yellow\';\r\n $state_title=LANG_GENERAL_YELLOW;  \r\n} else {\r\n $state=\'green\';\r\n $state_title=LANG_GENERAL_GREEN;   \r\n}\r\n\r\n$new_details=implode(\". \",$details);\r\nif ($this->getProperty(\"stateDetails\")!=$new_details) {\r\n $this->setProperty(\'stateDetails\',$new_details);\r\n}\r\n\r\nif ($this->getProperty(\'stateColor\')!=$state) {\r\n $this->setProperty(\'stateColor\',$state);\r\n $this->setProperty(\'stateTitle\',$state_title);\r\n if ($state!=\'green\') {\r\n  say(LANG_GENERAL_COMMUNICATION_STATE.\" \".LANG_GENERAL_CHANGED_TO.\" \".$state_title.\".\");\r\n  say(implode(\". \",$details));\r\n } else {\r\n  say(LANG_GENERAL_COMMUNICATION_STATE.\" \".LANG_GENERAL_RESTORED_TO.\" \".$state_title);\r\n }\r\n $this->callMethod(\'stateChanged\');\r\n}',1,0,'2015-05-17 21:56:36','');
insert  into `methods`(`ID`,`OBJECT_ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`CODE`,`CALL_PARENT`,`SCRIPT_ID`,`EXECUTED`,`EXECUTED_PARAMS`) values (75,16,0,'checkState','','$details=array();\r\n$red_state=0;\r\n$yellow_state=0;\r\n\r\nif ($red_state) {\r\n $state=\'red\';\r\n $state_title=LANG_GENERAL_RED; \r\n} elseif ($yellow_state) {\r\n $state=\'yellow\';\r\n $state_title=LANG_GENERAL_YELLOW;  \r\n} else {\r\n $state=\'green\';\r\n $state_title=LANG_GENERAL_GREEN;   \r\n}\r\n\r\n$new_details=implode(\". \",$details);\r\nif ($this->getProperty(\"stateDetails\")!=$new_details) {\r\n $this->setProperty(\'stateDetails\',$new_details);\r\n}\r\n\r\nif ($this->getProperty(\'stateColor\')!=$state) {\r\n $this->setProperty(\'stateColor\',$state);\r\n $this->setProperty(\'stateTitle\',$state_title);\r\n if ($state!=\'green\') {\r\n  say(LANG_GENERAL_SECURITY_STATE.\" \".LANG_GENERAL_CHANGED_TO.\" \".$state_title.\".\");\r\n  say(implode(\". \",$details));\r\n } else {\r\n  say(LANG_GENERAL_SECURITY_STATE.\" \".LANG_GENERAL_RESTORED_TO.\" \".$state_title);\r\n }\r\n $this->callMethod(\'stateChanged\');\r\n}',1,0,'2015-05-17 21:56:36','');
insert  into `methods`(`ID`,`OBJECT_ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`CODE`,`CALL_PARENT`,`SCRIPT_ID`,`EXECUTED`,`EXECUTED_PARAMS`) values (77,0,10,'VolumeLevelChanged','','$volume=round(65535*$params[\'VALUE\']/100);\r\n$this->setProperty(\'volumeLevel\',$params[\'VALUE\']);\r\nsafe_exec(\'..\\\\apps\\\\nircmd\\\\nircmdc setsysvolume \'.$volume);\r\nsay(\"Изменилась громкость до \".$params[\'VALUE\'].\" процентов\");',0,0,'2014-07-31 21:15:03','a:3:{s:5:\"VALUE\";s:2:\"90\";s:4:\"HOST\";s:9:\"localhost\";s:21:\"ORIGINAL_OBJECT_TITLE\";s:12:\"ThisComputer\";}');
insert  into `methods`(`ID`,`OBJECT_ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`CODE`,`CALL_PARENT`,`SCRIPT_ID`,`EXECUTED`,`EXECUTED_PARAMS`) values (86,0,29,'turnOn','','$code1=$this->getProperty(\'Code1\');\r\n$code2=$this->getProperty(\'Code2\');\r\nsafe_exec(\"c:\\_majordomo\\apps\\arduino_gw\\arduino_gw.exe rcon$code1:$code2;\");\r\n$this->setProperty(\"status\",1);',0,0,'2014-08-27 23:28:35','a:1:{s:21:\"ORIGINAL_OBJECT_TITLE\";s:7:\"OutletB\";}');
insert  into `methods`(`ID`,`OBJECT_ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`CODE`,`CALL_PARENT`,`SCRIPT_ID`,`EXECUTED`,`EXECUTED_PARAMS`) values (81,47,0,'activate','','setGlobal(\'minMsgLevel\',\'2\');',1,0,'2014-09-04 20:00:00','');
insert  into `methods`(`ID`,`OBJECT_ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`CODE`,`CALL_PARENT`,`SCRIPT_ID`,`EXECUTED`,`EXECUTED_PARAMS`) values (82,47,0,'deactivate','','setGlobal(\'minMsgLevel\',\'1\');',1,0,'2014-09-05 08:00:00','');
insert  into `methods`(`ID`,`OBJECT_ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`CODE`,`CALL_PARENT`,`SCRIPT_ID`,`EXECUTED`,`EXECUTED_PARAMS`) values (85,0,29,'turnOff','','$code1=$this->getProperty(\'Code1\');\r\n$code2=$this->getProperty(\'Code2\');\r\nsafe_exec(\"c:\\_majordomo\\apps\\arduino_gw\\arduino_gw.exe rcoff$code1:$code2;\");\r\n$this->setProperty(\"status\",0);',0,0,'2014-08-27 23:28:01','a:1:{s:21:\"ORIGINAL_OBJECT_TITLE\";s:7:\"OutletB\";}');
insert  into `methods`(`ID`,`OBJECT_ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`CODE`,`CALL_PARENT`,`SCRIPT_ID`,`EXECUTED`,`EXECUTED_PARAMS`) values (88,0,25,'updateActivityStatus','','$rooms=getObjectsByClass(\"Rooms\");\r\n$total=count($rooms);\r\nfor($i=0;$i<$total;$i++) {\r\n $rooms[$i][\'room\']=getGlobal($rooms[$i][\'TITLE\'].\'.Title\');\r\n if (!$rooms[$i][\'room\']) {\r\n  $rooms[$i][\'room\']=$rooms[$i][\'TITLE\'];\r\n } \r\n $rooms[$i][\'active\']=getGlobal($rooms[$i][\'TITLE\'].\'.SomebodyHere\');\r\n $rooms[$i][\'time\']=getGlobal($rooms[$i][\'TITLE\'].\'.LatestActivity\'); \r\n $rooms[$i][\'diff\']=time()-$rooms[$i][\'time\'];\r\n} \r\n\r\nfunction cmp($a, $b)\r\n{\r\n    if ($a[\'diff\'] == $b[\'diff\']) {\r\n        return 0;\r\n    }\r\n    return ($a[\'diff\'] < $b[\'diff\']) ? -1 : 1;\r\n}\r\nusort($rooms,\"cmp\");\r\n\r\nif (!$rooms[0][\'active\']) {\r\n $somebodyHomeText=\"Никого нет дома. Были в \".date(\'H:i\',$rooms[0][\'time\']).\" (\".$rooms[0][\'room\'].\")\";\r\n} else {\r\n $res_rooms=array();\r\n for($i=0;$i<$total;$i++) {\r\n  if ($rooms[$i][\'active\']) {\r\n   $res_rooms[]=$rooms[$i][\'room\'];\r\n  } \r\n }\r\n $somebodyHomeText=\"Кто-то дома: \".implode(\", \",$res_rooms); \r\n}\r\nsetGlobal(\'somebodyHomeText\',$somebodyHomeText);\r\n//echo \"Updated\";',0,0,'2014-09-05 13:01:00','a:1:{s:21:\"ORIGINAL_OBJECT_TITLE\";s:10:\"Kinderroom\";}');
insert  into `methods`(`ID`,`OBJECT_ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`CODE`,`CALL_PARENT`,`SCRIPT_ID`,`EXECUTED`,`EXECUTED_PARAMS`) values (87,0,30,'humChanged','','//$params[\'t\']\r\n $this->setProperty(\"updated\",time());\r\n $this->setProperty(\"updatedTime\",date(\"H:i\",time()));\r\n $this->setProperty(\"alive\",1); \r\n \r\n$ot=$this->object_title;\r\n$alive_timeout=(int)$this->getProperty(\"aliveTimeOut\");\r\nif (!$alive_timeout) {\r\n $alive_timeout=30*60;\r\n}\r\nclearTimeOut($ot.\"_alive\");\r\nsetTimeOut($ot.\"_alive\",\"sg(\'\".$ot.\".alive\',0);\",$alive_timeout); \r\n\r\nif (!isset($params[\'h\'])) {\r\n return;\r\n}\r\n\r\n\r\n$old_temp=$this->getProperty(\'humidity\');\r\n$t=round($params[\'h\'],1);\r\n\r\nif ($t>100) return;\r\n\r\n$this->setProperty(\'humidity\',$t);\r\nif ($params[\'uptime\']) {\r\n $this->setProperty(\'uptime\',$params[\'uptime\']);\r\n}\r\n\r\nif ($t>$old_temp) {\r\n $d=1;\r\n} elseif ($t<$old_temp) {\r\n $d=-1;\r\n} else {\r\n $d=0;\r\n}\r\n$this->setProperty(\'direction\',$d);\r\n\r\n$linked_room=$this->getProperty(\"LinkedRoom\");\r\nif ($linked_room) {\r\n setGlobal($linked_room.\'.Humidity\',$t);\r\n}',0,0,'2014-09-05 12:54:30','a:2:{s:1:\"h\";i:42;s:21:\"ORIGINAL_OBJECT_TITLE\";s:11:\"humSensor03\";}');
insert  into `methods`(`ID`,`OBJECT_ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`CODE`,`CALL_PARENT`,`SCRIPT_ID`,`EXECUTED`,`EXECUTED_PARAMS`) values (89,0,31,'sendCommand','','$cmdline=\'\"c:\\Program Files\\nooLite\\nooLite.exe\" -api \'.$params[\'command\'];\r\n$last_called=gg(\'NoolightCommandSend\');\r\n$min_delay=3;\r\n$now=time();\r\nif (($now-$last_called)>$min_delay) {\r\n //safe_exec($cmdline);\r\n $last_callled=$now; \r\n sg(\'NoolightCommandSend\',$last_called);\r\n DebMes(\"Noolite instant exec: \".$cmdline);\r\n system($cmdline);\r\n //exec($cmdline);\r\n} else {\r\n if ($last_callled<$now) {\r\n  $last_callled=$now;\r\n }\r\n $last_called+=$min_delay;\r\n sg(\'NoolightCommandSend\',$last_called);\r\n DebMes(\"Noolite scheduled job for \".date(\'H:i:s\',$last_called));\r\n AddScheduledJob(\"noolight\".md5($cmdline),\"safe_exec(\'\".$cmdline.\"\');\",$last_called);\r\n}\r\n\r\n',0,0,'2014-09-05 11:01:41','a:2:{s:7:\"command\";s:8:\"-off_ch2\";s:21:\"ORIGINAL_OBJECT_TITLE\";s:4:\"noo2\";}');
insert  into `methods`(`ID`,`OBJECT_ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`CODE`,`CALL_PARENT`,`SCRIPT_ID`,`EXECUTED`,`EXECUTED_PARAMS`) values (90,0,31,'turnOff','','$this->setProperty(\"status\",0);\r\n//safe_exec(\'\"c:\\Program Files\\nooLite\\noolite.exe\" -api -off_ch\'.$this->getProperty(\"channel\"));\r\n$this->callMethod(\"sendCommand\",array(\'command\'=>\'-off_ch\'.$this->getProperty(\"channel\")));',0,0,'2014-09-05 11:01:41','a:1:{s:21:\"ORIGINAL_OBJECT_TITLE\";s:4:\"noo2\";}');
insert  into `methods`(`ID`,`OBJECT_ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`CODE`,`CALL_PARENT`,`SCRIPT_ID`,`EXECUTED`,`EXECUTED_PARAMS`) values (91,0,31,'turnOn','','$this->setProperty(\"status\",1);\r\n$this->callMethod(\"sendCommand\",array(\'command\'=>\'-on_ch\'.$this->getProperty(\"channel\")));',0,0,'2014-09-05 11:01:30','a:1:{s:21:\"ORIGINAL_OBJECT_TITLE\";s:4:\"noo2\";}');
insert  into `methods`(`ID`,`OBJECT_ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`CODE`,`CALL_PARENT`,`SCRIPT_ID`,`EXECUTED`,`EXECUTED_PARAMS`) values (92,0,32,'alarm','','',0,0,NULL,NULL);
insert  into `methods`(`ID`,`OBJECT_ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`CODE`,`CALL_PARENT`,`SCRIPT_ID`,`EXECUTED`,`EXECUTED_PARAMS`) values (93,0,32,'goingHome','','',0,0,NULL,NULL);
insert  into `methods`(`ID`,`OBJECT_ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`CODE`,`CALL_PARENT`,`SCRIPT_ID`,`EXECUTED`,`EXECUTED_PARAMS`) values (94,0,32,'gotHome','','',0,0,NULL,NULL);
insert  into `methods`(`ID`,`OBJECT_ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`CODE`,`CALL_PARENT`,`SCRIPT_ID`,`EXECUTED`,`EXECUTED_PARAMS`) values (95,0,32,'Moving','','',0,0,NULL,NULL);
insert  into `methods`(`ID`,`OBJECT_ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`CODE`,`CALL_PARENT`,`SCRIPT_ID`,`EXECUTED`,`EXECUTED_PARAMS`) values (96,0,32,'outOfHome','','',0,0,NULL,NULL);

/*Table structure for table `modbusdevices` */

DROP TABLE IF EXISTS `modbusdevices`;

CREATE TABLE `modbusdevices` (
  `ID` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `TITLE` varchar(255) NOT NULL DEFAULT '',
  `HOST` varchar(255) NOT NULL DEFAULT '',
  `PROTOCOL` char(5) NOT NULL DEFAULT 'UDP',
  `DEVICE_ID` int(10) NOT NULL DEFAULT '0',
  `REQUEST_TYPE` varchar(10) NOT NULL DEFAULT '',
  `REQUEST_START` int(10) NOT NULL DEFAULT '0',
  `REQUEST_TOTAL` int(10) NOT NULL DEFAULT '0',
  `RESPONSE_CONVERT` varchar(10) NOT NULL DEFAULT '',
  `DATA` text,
  `CHECK_LATEST` datetime DEFAULT NULL,
  `CHECK_NEXT` datetime DEFAULT NULL,
  `POLLPERIOD` int(10) NOT NULL DEFAULT '0',
  `LINKED_OBJECT` varchar(255) NOT NULL DEFAULT '',
  `LINKED_PROPERTY` varchar(255) NOT NULL DEFAULT '',
  `LOG` text NOT NULL,
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

/*Data for the table `modbusdevices` */

/*Table structure for table `mqtt` */

DROP TABLE IF EXISTS `mqtt`;

CREATE TABLE `mqtt` (
  `ID` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `TITLE` varchar(255) NOT NULL DEFAULT '',
  `LOCATION_ID` int(10) NOT NULL DEFAULT '0',
  `UPDATED` datetime DEFAULT NULL,
  `VALUE` varchar(255) NOT NULL DEFAULT '',
  `PATH` varchar(255) NOT NULL DEFAULT '',
  `LINKED_OBJECT` varchar(255) NOT NULL DEFAULT '',
  `LINKED_PROPERTY` varchar(255) NOT NULL DEFAULT '',
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

/*Data for the table `mqtt` */

/*Table structure for table `myblocks` */

DROP TABLE IF EXISTS `myblocks`;

CREATE TABLE `myblocks` (
  `ID` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `TITLE` varchar(255) NOT NULL DEFAULT '',
  `CATEGORY_ID` int(10) NOT NULL DEFAULT '0',
  `BLOCK_TYPE` char(10) NOT NULL DEFAULT '',
  `BLOCK_COLOR` int(10) NOT NULL DEFAULT '0',
  `SCRIPT_ID` int(10) NOT NULL DEFAULT '0',
  `LINKED_OBJECT` varchar(255) NOT NULL DEFAULT '',
  `LINKED_PROPERTY` varchar(255) NOT NULL DEFAULT '',
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM AUTO_INCREMENT=4 DEFAULT CHARSET=utf8;

/*Data for the table `myblocks` */

/*Table structure for table `myblocks_categories` */

DROP TABLE IF EXISTS `myblocks_categories`;

CREATE TABLE `myblocks_categories` (
  `ID` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `TITLE` varchar(255) NOT NULL DEFAULT '',
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM AUTO_INCREMENT=2 DEFAULT CHARSET=utf8;

/*Data for the table `myblocks_categories` */

/*Table structure for table `newsletter` */

DROP TABLE IF EXISTS `newsletter`;

CREATE TABLE `newsletter` (
  `ID` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `EMAIL` varchar(255) NOT NULL DEFAULT '',
  `LIST` varchar(255) NOT NULL DEFAULT '',
  `ADDED` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

/*Data for the table `newsletter` */

/*Table structure for table `objects` */

DROP TABLE IF EXISTS `objects`;

CREATE TABLE `objects` (
  `ID` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `TITLE` varchar(255) NOT NULL DEFAULT '',
  `CLASS_ID` int(10) NOT NULL DEFAULT '0',
  `DESCRIPTION` text,
  `LOCATION_ID` int(10) NOT NULL DEFAULT '0',
  `KEEP_HISTORY` int(10) NOT NULL DEFAULT '0',
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM AUTO_INCREMENT=74 DEFAULT CHARSET=utf8;

/*Data for the table `objects` */

insert  into `objects`(`ID`,`TITLE`,`CLASS_ID`,`DESCRIPTION`,`LOCATION_ID`,`KEEP_HISTORY`) values (4,'USBDev',9,'',0,0);
insert  into `objects`(`ID`,`TITLE`,`CLASS_ID`,`DESCRIPTION`,`LOCATION_ID`,`KEEP_HISTORY`) values (13,'BlueDev',18,'',0,0);
insert  into `objects`(`ID`,`TITLE`,`CLASS_ID`,`DESCRIPTION`,`LOCATION_ID`,`KEEP_HISTORY`) values (6,'ClockChime',7,'',0,0);
insert  into `objects`(`ID`,`TITLE`,`CLASS_ID`,`DESCRIPTION`,`LOCATION_ID`,`KEEP_HISTORY`) values (7,'ThisComputer',10,'',0,0);
insert  into `objects`(`ID`,`TITLE`,`CLASS_ID`,`DESCRIPTION`,`LOCATION_ID`,`KEEP_HISTORY`) values (10,'mySkype',12,'',0,0);
insert  into `objects`(`ID`,`TITLE`,`CLASS_ID`,`DESCRIPTION`,`LOCATION_ID`,`KEEP_HISTORY`) values (15,'ws',20,'',0,0);
insert  into `objects`(`ID`,`TITLE`,`CLASS_ID`,`DESCRIPTION`,`LOCATION_ID`,`KEEP_HISTORY`) values (16,'Security',21,'',0,0);
insert  into `objects`(`ID`,`TITLE`,`CLASS_ID`,`DESCRIPTION`,`LOCATION_ID`,`KEEP_HISTORY`) values (17,'System',21,'',0,0);
insert  into `objects`(`ID`,`TITLE`,`CLASS_ID`,`DESCRIPTION`,`LOCATION_ID`,`KEEP_HISTORY`) values (18,'Communication',21,'',0,0);
insert  into `objects`(`ID`,`TITLE`,`CLASS_ID`,`DESCRIPTION`,`LOCATION_ID`,`KEEP_HISTORY`) values (19,'EconomMode',24,'',0,0);
insert  into `objects`(`ID`,`TITLE`,`CLASS_ID`,`DESCRIPTION`,`LOCATION_ID`,`KEEP_HISTORY`) values (20,'NobodyHomeMode',24,'',0,0);
insert  into `objects`(`ID`,`TITLE`,`CLASS_ID`,`DESCRIPTION`,`LOCATION_ID`,`KEEP_HISTORY`) values (21,'SecurityArmedMode',24,'',0,0);
insert  into `objects`(`ID`,`TITLE`,`CLASS_ID`,`DESCRIPTION`,`LOCATION_ID`,`KEEP_HISTORY`) values (22,'GuestsMode',24,'',0,0);
insert  into `objects`(`ID`,`TITLE`,`CLASS_ID`,`DESCRIPTION`,`LOCATION_ID`,`KEEP_HISTORY`) values (23,'DarknessMode',24,'',0,0);
insert  into `objects`(`ID`,`TITLE`,`CLASS_ID`,`DESCRIPTION`,`LOCATION_ID`,`KEEP_HISTORY`) values (24,'Livingroom',25,'',4,0);
insert  into `objects`(`ID`,`TITLE`,`CLASS_ID`,`DESCRIPTION`,`LOCATION_ID`,`KEEP_HISTORY`) values (26,'TempSensor01',19,'',1,0);
insert  into `objects`(`ID`,`TITLE`,`CLASS_ID`,`DESCRIPTION`,`LOCATION_ID`,`KEEP_HISTORY`) values (28,'Bedroom',25,'',5,0);
insert  into `objects`(`ID`,`TITLE`,`CLASS_ID`,`DESCRIPTION`,`LOCATION_ID`,`KEEP_HISTORY`) values (29,'Kitchen',25,'',1,0);
insert  into `objects`(`ID`,`TITLE`,`CLASS_ID`,`DESCRIPTION`,`LOCATION_ID`,`KEEP_HISTORY`) values (30,'Hall',25,'',6,0);
insert  into `objects`(`ID`,`TITLE`,`CLASS_ID`,`DESCRIPTION`,`LOCATION_ID`,`KEEP_HISTORY`) values (53,'Bathroom',25,'',7,0);
insert  into `objects`(`ID`,`TITLE`,`CLASS_ID`,`DESCRIPTION`,`LOCATION_ID`,`KEEP_HISTORY`) values (47,'NightMode',24,'',0,0);
insert  into `objects`(`ID`,`TITLE`,`CLASS_ID`,`DESCRIPTION`,`LOCATION_ID`,`KEEP_HISTORY`) values (52,'humSensor01',30,'',1,0);
insert  into `objects`(`ID`,`TITLE`,`CLASS_ID`,`DESCRIPTION`,`LOCATION_ID`,`KEEP_HISTORY`) values (51,'MotionSensor1',23,'',6,0);
insert  into `objects`(`ID`,`TITLE`,`CLASS_ID`,`DESCRIPTION`,`LOCATION_ID`,`KEEP_HISTORY`) values (54,'Kinderroom',25,'',10,0);
insert  into `objects`(`ID`,`TITLE`,`CLASS_ID`,`DESCRIPTION`,`LOCATION_ID`,`KEEP_HISTORY`) values (55,'Toilet',25,'',8,0);
insert  into `objects`(`ID`,`TITLE`,`CLASS_ID`,`DESCRIPTION`,`LOCATION_ID`,`KEEP_HISTORY`) values (68,'admin',32,'',0,0);

/*Table structure for table `owdevices` */

DROP TABLE IF EXISTS `owdevices`;

CREATE TABLE `owdevices` (
  `ID` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `TITLE` varchar(255) NOT NULL DEFAULT '',
  `UDID` varchar(255) NOT NULL DEFAULT '',
  `STATUS` int(3) NOT NULL DEFAULT '0',
  `CHECK_LATEST` datetime DEFAULT NULL,
  `CHECK_NEXT` datetime DEFAULT NULL,
  `SCRIPT_ID` int(10) NOT NULL DEFAULT '0',
  `CODE` text,
  `ONLINE_INTERVAL` int(10) NOT NULL DEFAULT '0',
  `LOG` text,
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

/*Data for the table `owdevices` */

/*Table structure for table `owdisplays` */

DROP TABLE IF EXISTS `owdisplays`;

CREATE TABLE `owdisplays` (
  `ID` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `UDID` int(10) unsigned NOT NULL DEFAULT '0',
  `ROWS` int(3) unsigned NOT NULL DEFAULT '0',
  `COLS` int(3) unsigned NOT NULL DEFAULT '0',
  `UPDATE_INTERVAL` int(10) unsigned NOT NULL DEFAULT '0',
  `VALUE` text,
  `UPDATE_LATEST` int(10) unsigned NOT NULL DEFAULT '0',
  `UPDATE_NEXT` int(10) unsigned NOT NULL DEFAULT '0',
  `TITLE` varchar(255) NOT NULL DEFAULT '',
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

/*Data for the table `owdisplays` */

/*Table structure for table `owproperties` */

DROP TABLE IF EXISTS `owproperties`;

CREATE TABLE `owproperties` (
  `ID` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `DEVICE_ID` int(10) unsigned NOT NULL DEFAULT '0',
  `SYSNAME` varchar(255) NOT NULL DEFAULT '',
  `VALUE` varchar(255) NOT NULL DEFAULT '',
  `CHECK_LATEST` datetime DEFAULT NULL,
  `UPDATED` datetime DEFAULT NULL,
  `LINKED_OBJECT` varchar(255) NOT NULL DEFAULT '',
  `LINKED_PROPERTY` varchar(255) NOT NULL DEFAULT '',
  `PATH` varchar(255) NOT NULL DEFAULT '',
  `STARRED` int(3) unsigned NOT NULL DEFAULT '0',
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

/*Data for the table `owproperties` */

/*Table structure for table `patterns` */

DROP TABLE IF EXISTS `patterns`;

CREATE TABLE `patterns` (
  `ID` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `TITLE` varchar(255) NOT NULL DEFAULT '',
  `PATTERN` text,
  `SCRIPT_ID` int(10) NOT NULL DEFAULT '0',
  `SCRIPT` text,
  `LOG` text,
  `TIME_LIMIT` int(245) NOT NULL DEFAULT '0',
  `EXECUTED` int(10) NOT NULL DEFAULT '0',
  `IS_CONTEXT` int(3) NOT NULL DEFAULT '0',
  `IS_COMMON_CONTEXT` int(3) NOT NULL DEFAULT '0',
  `MATCHED_CONTEXT_ID` int(10) NOT NULL DEFAULT '0',
  `TIMEOUT` int(10) NOT NULL DEFAULT '0',
  `TIMEOUT_CONTEXT_ID` int(10) NOT NULL DEFAULT '0',
  `TIMEOUT_SCRIPT` text,
  `PARENT_ID` int(10) NOT NULL DEFAULT '0',
  `IS_LAST` int(3) NOT NULL DEFAULT '0',
  `PRIORITY` int(10) NOT NULL DEFAULT '0',
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM AUTO_INCREMENT=10 DEFAULT CHARSET=utf8;

/*Data for the table `patterns` */

insert  into `patterns`(`ID`,`TITLE`,`PATTERN`,`SCRIPT_ID`,`SCRIPT`,`LOG`,`TIME_LIMIT`,`EXECUTED`,`IS_CONTEXT`,`IS_COMMON_CONTEXT`,`MATCHED_CONTEXT_ID`,`TIMEOUT`,`TIMEOUT_CONTEXT_ID`,`TIMEOUT_SCRIPT`,`PARENT_ID`,`IS_LAST`,`PRIORITY`) values (9,'(start|play) music','',0,'runScript(\'playFavoriteMusic\');','',0,1409904443,0,0,0,0,0,'',0,0,0);
insert  into `patterns`(`ID`,`TITLE`,`PATTERN`,`SCRIPT_ID`,`SCRIPT`,`LOG`,`TIME_LIMIT`,`EXECUTED`,`IS_CONTEXT`,`IS_COMMON_CONTEXT`,`MATCHED_CONTEXT_ID`,`TIMEOUT`,`TIMEOUT_CONTEXT_ID`,`TIMEOUT_SCRIPT`,`PARENT_ID`,`IS_LAST`,`PRIORITY`) values (3,'погод(а|ы)','',15,'','2015-05-16 11:20:37 Pattern matched\n2014-08-29 08:31:08 Pattern matched\n2014-08-26 20:16:25 Pattern matched\n2014-08-25 21:58:47 Pattern matched\n2014-08-24 22:55:50 Pattern matched\n2014-08-21 10:17:53 Pattern matched\n2014-08-18 20:29:26 Pattern matched\n2014-08-07 11:41:11 Pattern matched\n2014-08-07 11:40:30 Pattern matched\n2014-08-07 10:07:13 Pattern matched\n2014-08-07 10:05:36 Pattern matched\n2014-08-07 08:58:20 Pattern matched\n2014-08-06 18:30:14 Pattern matched\n2014-08-01 15:04:54 Pattern matched\n2014-08-01 15:01:35 Pattern matched\n',0,1431760837,0,0,0,0,0,'',0,0,0);
insert  into `patterns`(`ID`,`TITLE`,`PATTERN`,`SCRIPT_ID`,`SCRIPT`,`LOG`,`TIME_LIMIT`,`EXECUTED`,`IS_CONTEXT`,`IS_COMMON_CONTEXT`,`MATCHED_CONTEXT_ID`,`TIMEOUT`,`TIMEOUT_CONTEXT_ID`,`TIMEOUT_SCRIPT`,`PARENT_ID`,`IS_LAST`,`PRIORITY`) values (5,'(поставь|включи) музыку','',0,'runScript(\'playFavoriteMusic\');','2014-09-05 11:07:23 Pattern matched\n',0,1409904443,0,0,0,0,0,'',0,0,0);
insert  into `patterns`(`ID`,`TITLE`,`PATTERN`,`SCRIPT_ID`,`SCRIPT`,`LOG`,`TIME_LIMIT`,`EXECUTED`,`IS_CONTEXT`,`IS_COMMON_CONTEXT`,`MATCHED_CONTEXT_ID`,`TIMEOUT`,`TIMEOUT_CONTEXT_ID`,`TIMEOUT_SCRIPT`,`PARENT_ID`,`IS_LAST`,`PRIORITY`) values (6,'(останови|выключи) музыку','',0,'getURL(\"http://localhost/rc/?command=vlc_pause\",0);\r\nsay(LANG_DONE,1);','2014-09-05 11:07:40 Pattern matched\n',0,1409904460,0,0,0,0,0,'',0,0,0);
insert  into `patterns`(`ID`,`TITLE`,`PATTERN`,`SCRIPT_ID`,`SCRIPT`,`LOG`,`TIME_LIMIT`,`EXECUTED`,`IS_CONTEXT`,`IS_COMMON_CONTEXT`,`MATCHED_CONTEXT_ID`,`TIMEOUT`,`TIMEOUT_CONTEXT_ID`,`TIMEOUT_SCRIPT`,`PARENT_ID`,`IS_LAST`,`PRIORITY`) values (7,'сценарий (.+)','',0,'say(\"Запускаю сценарий \".$matches[1]);\r\nrunScript($matches[1]);','2014-09-05 11:19:33 Pattern matched\n2014-09-05 11:16:34 Pattern matched\n2014-09-05 11:15:11 Pattern matched\n',0,1409905173,0,0,0,0,0,'',0,0,0);
insert  into `patterns`(`ID`,`TITLE`,`PATTERN`,`SCRIPT_ID`,`SCRIPT`,`LOG`,`TIME_LIMIT`,`EXECUTED`,`IS_CONTEXT`,`IS_COMMON_CONTEXT`,`MATCHED_CONTEXT_ID`,`TIMEOUT`,`TIMEOUT_CONTEXT_ID`,`TIMEOUT_SCRIPT`,`PARENT_ID`,`IS_LAST`,`PRIORITY`) values (8,'report system state','',21,'','2014-09-05 12:07:19 Pattern matched\n',0,1409908039,0,0,0,0,0,'',0,0,0);

/*Table structure for table `performance_log` */

DROP TABLE IF EXISTS `performance_log`;

CREATE TABLE `performance_log` (
  `ID` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `OPERATION` varchar(255) NOT NULL DEFAULT '',
  `COUNTER` int(10) NOT NULL DEFAULT '0',
  `TIMEUSED` float NOT NULL DEFAULT '0',
  `SOURCE` char(10) NOT NULL DEFAULT '',
  `ADDED` datetime DEFAULT NULL,
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

/*Data for the table `performance_log` */

/*Table structure for table `phistory` */

DROP TABLE IF EXISTS `phistory`;

CREATE TABLE `phistory` (
  `ID` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `VALUE_ID` int(10) unsigned NOT NULL DEFAULT '0',
  `ADDED` datetime DEFAULT NULL,
  `VALUE` varchar(255) NOT NULL,
  PRIMARY KEY (`ID`),
  KEY `VALUE_ID` (`VALUE_ID`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

/*Data for the table `phistory` */

/*Table structure for table `pinghosts` */

DROP TABLE IF EXISTS `pinghosts`;

CREATE TABLE `pinghosts` (
  `ID` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `HOSTNAME` varchar(255) NOT NULL DEFAULT '',
  `TYPE` int(30) NOT NULL DEFAULT '0',
  `STATUS` int(3) NOT NULL DEFAULT '0',
  `SEARCH_WORD` varchar(255) NOT NULL DEFAULT '',
  `CHECK_LATEST` datetime DEFAULT NULL,
  `CHECK_NEXT` datetime DEFAULT NULL,
  `SCRIPT_ID_ONLINE` int(10) NOT NULL DEFAULT '0',
  `CODE_ONLINE` text,
  `SCRIPT_ID_OFFLINE` int(10) NOT NULL DEFAULT '0',
  `CODE_OFFLINE` text,
  `OFFLINE_INTERVAL` int(10) NOT NULL DEFAULT '0',
  `ONLINE_INTERVAL` int(10) NOT NULL DEFAULT '0',
  `TITLE` varchar(255) NOT NULL DEFAULT '',
  `LOG` text,
  `LINKED_OBJECT` varchar(255) NOT NULL DEFAULT '',
  `LINKED_PROPERTY` varchar(255) NOT NULL DEFAULT '',
  `COUNTER_CURRENT` int(10) NOT NULL DEFAULT '0',
  `COUNTER_REQUIRED` int(10) NOT NULL DEFAULT '0',
  `STATUS_EXPECTED` int(3) NOT NULL DEFAULT '0',
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM AUTO_INCREMENT=9 DEFAULT CHARSET=utf8;

/*Data for the table `pinghosts` */

insert  into `pinghosts`(`ID`,`HOSTNAME`,`TYPE`,`STATUS`,`SEARCH_WORD`,`CHECK_LATEST`,`CHECK_NEXT`,`SCRIPT_ID_ONLINE`,`CODE_ONLINE`,`SCRIPT_ID_OFFLINE`,`CODE_OFFLINE`,`OFFLINE_INTERVAL`,`ONLINE_INTERVAL`,`TITLE`,`LOG`,`LINKED_OBJECT`,`LINKED_PROPERTY`,`COUNTER_CURRENT`,`COUNTER_REQUIRED`,`STATUS_EXPECTED`) values (8,'tut.by',0,1,'','2015-02-04 13:57:32','2015-02-04 14:07:32',0,'',0,'',600,600,'Internet','2014-10-30 15:01:22 Host is online\n2014-09-05 00:41:06 Host is online\n2014-09-05 00:31:05 Host is offline\n2014-09-04 16:36:02 Host is online\n2014-09-03 16:37:00 Host is online\n2014-09-03 16:26:47 Host is offline\n2014-09-03 14:45:29 Host is online\n2014-09-03 14:35:26 Host is offline\n2014-09-03 12:54:33 Host is online\n2014-09-03 12:44:31 Host is offline\n2014-08-21 06:25:53 Host is online\n2014-08-21 06:15:49 Host is offline\n2014-08-19 15:16:17 Host is online\n2014-08-19 15:06:14 Host is offline\n2014-08-19 09:52:20 Host is online\n2014-08-19 09:42:18 Host is offline\n2014-08-19 09:32:10 Host is online\n2014-08-19 09:22:07 Host is offline\n2014-08-18 17:34:00 Host is online\n2014-08-18 17:23:59 Host is offline\n2014-08-18 05:58:14 Host is online\n2014-08-18 05:48:13 Host is offline\n2014-08-13 02:45:56 Host is online\n2014-08-13 02:35:50 Host is offline\n2014-08-06 09:25:20 Host is online\n2014-08-06 09:15:17 Host is offline\n2014-08-05 22:39:57 Host is online\n2014-08-05 22:29:56 Host is offline\n2014-08-01 16:29:12 Host is online\n2014-08-01 15:28:44 Host is offline\n2014-07-31 21:19:39 Host is online\n2014-07-31 21:09:29 Host is offline\n2014-07-28 13:34:03 Host is online\n2014-07-28 13:23:56 Host is offline\n2014-07-28 12:33:17 Host is online\n2014-07-28 12:13:03 Host is offline\n2014-07-28 04:39:08 Host is online\n2014-07-28 04:29:00 Host is offline\n2014-07-28 00:57:07 Host is online\n2014-07-28 00:37:00 Host is offline\n2014-07-27 22:25:52 Host is online\n2014-07-27 21:35:01 Host is offline\n2014-07-27 21:24:49 Host is online\n2014-07-27 21:14:47 Host is offline\n2014-07-27 21:04:39 Host is online\n2014-07-27 20:44:15 Host is offline\n2014-07-27 19:53:42 Host is online\n2014-07-27 19:43:39 Host is offline\n2014-07-27 19:33:32 Host is online\n2014-07-27 19:23:30 Host is offline\n2014-07-27 17:42:36 Host is online\n2014-07-27 17:22:22 Host is offline\n2014-07-27 16:31:49 Host is online\n2014-07-27 16:21:47 Host is offline\n2014-07-27 16:11:39 Host is online\n2014-07-27 16:01:37 Host is offline\n2014-07-27 12:49:59 Host is online\n2014-07-27 12:39:57 Host is offline\n2014-07-27 10:28:49 Host is online\n2014-07-27 10:18:43 Host is offline\n2014-07-27 09:38:13 Host is online\n2014-07-27 09:28:11 Host is offline\n2014-07-27 09:07:57 Host is online\n2014-07-27 08:37:46 Host is offline\n2014-07-27 08:27:37 Host is online\n2014-07-27 08:17:35 Host is offline\n2014-07-27 07:06:58 Host is online\n2014-07-27 06:56:54 Host is offline\n2014-07-27 06:26:37 Host is online\n2014-07-27 06:16:28 Host is offline\n2014-07-27 05:56:11 Host is online\n2014-07-27 05:15:53 Host is offline\n2014-07-27 04:25:26 Host is online\n2014-07-27 03:54:46 Host is offline\n2014-07-27 02:54:08 Host is online\n2014-07-27 02:44:06 Host is offline\n2014-07-27 00:22:52 Host is online\n2014-07-27 00:12:50 Host is offline\n2014-07-26 23:52:37 Host is online\n2014-07-26 23:42:35 Host is offline\n2014-07-26 23:32:27 Host is online\n2014-07-26 23:12:09 Host is offline\n2014-07-26 13:07:06 Host is online\n2014-07-26 12:57:04 Host is offline\n2014-07-26 12:36:53 Host is online\n2014-07-26 12:26:48 Host is offline\n2014-07-26 12:16:41 Host is online\n2014-07-26 11:46:28 Host is offline\n2014-07-24 20:47:09 Host is online\n2014-07-24 20:37:04 Host is offline\n2014-07-24 17:05:19 Host is online\n2014-07-24 16:55:18 Host is offline\n2014-07-24 14:03:49 Host is online\n2014-07-24 13:53:48 Host is offline\n2014-07-24 04:08:54 Host is online\n2014-07-24 03:58:45 Host is offline\n2014-07-24 03:38:28 Host is online\n2014-07-24 03:28:20 Host is offline\n2014-07-24 01:17:07 Host is online\n2014-07-24 01:06:58 Host is offline\n2014-07-23 22:45:41 Host is online\n2014-07-23 22:35:32 Host is offline\n2014-07-23 19:23:50 Host is online\n2014-07-23 19:13:48 Host is offline\n2014-07-23 15:52:04 Host is online\n2014-07-23 15:42:03 Host is offline\n2014-07-23 15:21:49 Host is online\n2014-07-23 15:11:47 Host is offline\n2014-07-22 22:26:00 Host is online\n2014-07-22 22:15:54 Host is offline\n2014-07-22 21:45:34 Host is online\n2014-07-22 21:35:34 Host is offline\n2014-07-22 21:25:22 Host is online\n2014-07-22 21:15:19 Host is offline\n2014-07-22 19:44:22 Host is online\n2014-07-22 19:34:21 Host is offline\n2014-07-21 22:22:24 Host is online\n2014-07-21 21:41:45 Host is offline\n2014-07-21 03:21:41 Host is online\n2014-07-21 03:11:30 Host is offline\n2014-07-21 02:41:09 Host is online\n2014-07-21 02:31:07 Host is offline\n2014-07-21 02:20:55 Host is online\n2014-07-21 01:29:40 Host is offline\n2014-07-21 01:19:30 Host is online\n2014-07-21 00:59:02 Host is offline\n2014-07-21 00:48:52 Host is online\n2014-07-21 00:38:41 Host is offline\n2014-07-21 00:08:19 Host is online\n2014-07-20 23:47:53 Host is offline\n2014-07-20 23:37:40 Host is online\n2014-07-20 22:36:27 Host is offline\n2014-07-20 17:53:48 Host is online\n2014-07-20 17:43:46 Host is offline\n2014-07-20 17:23:32 Host is online\n2014-07-20 17:13:30 Host is offline\n2014-07-20 13:41:35 Host is online\n2014-07-20 13:31:32 Host is offline\n2014-07-18 19:28:59 Host is online\n2014-07-18 15:26:15 Host is offline\n2014-07-18 11:54:25 Host is online\n2014-07-18 11:44:19 Host is offline\n2014-07-18 02:39:13 Host is online\n2014-07-18 02:29:11 Host is offline\n2014-07-17 20:46:03 Host is online\n2014-07-17 20:35:53 Host is offline\n2014-07-17 16:33:40 Host is online\n2014-07-17 16:23:32 Host is offline\n2014-07-17 10:50:39 Host is online\n2014-07-17 10:40:29 Host is offline\n2014-07-17 10:30:18 Host is online\n2014-07-17 10:20:08 Host is offline\n2014-07-17 06:28:07 Host is online\n2014-07-17 06:18:06 Host is offline\n2014-07-16 22:14:02 Host is online\n2014-07-16 22:04:01 Host is offline\n2014-07-16 21:53:51 Host is online\n2014-07-16 21:43:41 Host is offline\n2014-07-16 10:07:48 Host is online\n2014-07-16 09:57:38 Host is offline\n2014-07-16 09:47:28 Host is online\n2014-07-16 09:27:02 Host is offline\n2014-07-16 08:36:30 Host is online\n2014-07-16 08:26:20 Host is offline\n2012-11-17 14:47:08 Host is online\n2012-11-17 14:37:06 Host is offline\n2012-11-17 14:27:05 Host is online\n2012-11-16 17:29:14 Host is offline\n2012-11-16 16:59:02 Host is online\n2012-11-16 16:49:01 Host is offline\n2012-11-16 15:08:49 Host is online\n2012-11-16 14:58:45 Host is offline\n2012-10-31 09:59:11 Host is online\n2012-10-31 09:49:11 Host is offline\n2012-10-29 09:48:24 Host is online\n2012-10-29 06:37:11 Host is offline\n2012-10-29 06:27:07 Host is online\n2012-10-29 05:46:55 Host is offline\n2012-10-29 05:26:51 Host is online\n2012-10-29 05:16:51 Host is offline\n2012-10-29 05:06:47 Host is online\n2012-10-29 04:06:27 Host is offline\n2012-10-29 03:56:23 Host is online\n2012-10-29 03:46:23 Host is offline\n2012-10-29 03:36:19 Host is online\n2012-10-29 03:16:15 Host is offline\n2012-10-29 03:06:11 Host is online\n2012-10-29 01:25:44 Host is offline\n2012-10-29 01:15:41 Host is online\n2012-10-29 00:05:17 Host is offline\n2012-10-23 14:53:36 Host is online\n2012-10-23 14:23:28 Host is offline\n2012-10-19 06:11:55 Host is online\n2012-10-19 06:01:55 Host is offline\n2012-10-16 11:55:17 Host is online\n','','',0,0,1);

/*Table structure for table `plugins` */

DROP TABLE IF EXISTS `plugins`;

CREATE TABLE `plugins` (
  `ID` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `TITLE` varchar(255) NOT NULL DEFAULT '',
  `MODULE_NAME` varchar(255) NOT NULL DEFAULT '',
  `REPOSITORY_URL` char(255) NOT NULL DEFAULT '',
  `AUTHOR` varchar(255) NOT NULL DEFAULT '',
  `SUPPORT_URL` char(255) NOT NULL DEFAULT '',
  `DESCRIPTION_RU` text,
  `DESCRIPTION_EN` text,
  `CURRENT_VERSION` varchar(255) NOT NULL DEFAULT '',
  `LATEST_VERSION` varchar(255) NOT NULL DEFAULT '',
  `IS_INSTALLED` int(3) NOT NULL DEFAULT '0',
  `WHATSNEW` text,
  `LATEST_UPDATE` datetime DEFAULT NULL,
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM AUTO_INCREMENT=4 DEFAULT CHARSET=utf8;

/*Data for the table `plugins` */

insert  into `plugins`(`ID`,`TITLE`,`MODULE_NAME`,`REPOSITORY_URL`,`AUTHOR`,`SUPPORT_URL`,`DESCRIPTION_RU`,`DESCRIPTION_EN`,`CURRENT_VERSION`,`LATEST_VERSION`,`IS_INSTALLED`,`WHATSNEW`,`LATEST_UPDATE`) values (1,'','app_nut','','','',NULL,NULL,'1.0','',1,NULL,'2015-05-15 23:09:22');
insert  into `plugins`(`ID`,`TITLE`,`MODULE_NAME`,`REPOSITORY_URL`,`AUTHOR`,`SUPPORT_URL`,`DESCRIPTION_RU`,`DESCRIPTION_EN`,`CURRENT_VERSION`,`LATEST_VERSION`,`IS_INSTALLED`,`WHATSNEW`,`LATEST_UPDATE`) values (2,'','app_openweather','','','',NULL,NULL,'1.0','',1,NULL,'2015-05-15 23:10:35');
insert  into `plugins`(`ID`,`TITLE`,`MODULE_NAME`,`REPOSITORY_URL`,`AUTHOR`,`SUPPORT_URL`,`DESCRIPTION_RU`,`DESCRIPTION_EN`,`CURRENT_VERSION`,`LATEST_VERSION`,`IS_INSTALLED`,`WHATSNEW`,`LATEST_UPDATE`) values (3,'','app_yaweather','','','',NULL,NULL,'1.0','',1,NULL,'2015-05-15 23:11:08');

/*Table structure for table `prod_categories` */

DROP TABLE IF EXISTS `prod_categories`;

CREATE TABLE `prod_categories` (
  `ID` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `TITLE` varchar(255) NOT NULL DEFAULT '',
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

/*Data for the table `prod_categories` */

/*Table structure for table `product_categories` */

DROP TABLE IF EXISTS `product_categories`;

CREATE TABLE `product_categories` (
  `ID` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `TITLE` varchar(255) NOT NULL DEFAULT '',
  `PRIORITY` int(10) NOT NULL DEFAULT '0',
  `PARENT_ID` int(10) NOT NULL DEFAULT '0',
  `SUB_LIST` text,
  `PARENT_LIST` text,
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM AUTO_INCREMENT=15 DEFAULT CHARSET=utf8;

/*Data for the table `product_categories` */

insert  into `product_categories`(`ID`,`TITLE`,`PRIORITY`,`PARENT_ID`,`SUB_LIST`,`PARENT_LIST`) values (1,'<#LANG_APP_PRODUCTS#>',0,0,'2,3,4,5,7,8','0');

/*Table structure for table `product_codes` */

DROP TABLE IF EXISTS `product_codes`;

CREATE TABLE `product_codes` (
  `ID` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `TITLE` varchar(255) NOT NULL DEFAULT '',
  `CODE` varchar(255) NOT NULL DEFAULT '',
  `PRODUCT_ID` int(10) NOT NULL DEFAULT '0',
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM AUTO_INCREMENT=35 DEFAULT CHARSET=utf8;

/*Data for the table `product_codes` */

insert  into `product_codes`(`ID`,`TITLE`,`CODE`,`PRODUCT_ID`) values (33,'ХЛЕБ ','4811002027133',1);
insert  into `product_codes`(`ID`,`TITLE`,`CODE`,`PRODUCT_ID`) values (34,'МОЛОЧНАЯ КАША ДЛЯ ДЕТСКОГО ПИТАНИЯ ','4606272002061',2);

/*Table structure for table `product_log` */

DROP TABLE IF EXISTS `product_log`;

CREATE TABLE `product_log` (
  `ID` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `TITLE` varchar(255) NOT NULL DEFAULT '',
  `PRODUCT_ID` int(10) NOT NULL DEFAULT '0',
  `CODE_ID` int(10) NOT NULL DEFAULT '0',
  `ACTION` char(10) NOT NULL DEFAULT '',
  `UPDATED` datetime DEFAULT NULL,
  `QTY` int(10) NOT NULL DEFAULT '0',
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

/*Data for the table `product_log` */

/*Table structure for table `products` */

DROP TABLE IF EXISTS `products`;

CREATE TABLE `products` (
  `ID` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `TITLE` varchar(255) NOT NULL DEFAULT '',
  `COMMENTS` varchar(255) NOT NULL DEFAULT '',
  `CATEGORY_ID` int(10) NOT NULL DEFAULT '0',
  `INSTOCK` int(3) NOT NULL DEFAULT '0',
  `IMAGE` varchar(70) NOT NULL DEFAULT '',
  `WILL_EXPIRE` int(3) NOT NULL DEFAULT '0',
  `EXPIRE_DATE` date DEFAULT NULL,
  `EXPIRE_DEFAULT` int(10) NOT NULL DEFAULT '0',
  `UPDATED` datetime DEFAULT NULL,
  `QTY` int(10) NOT NULL DEFAULT '0',
  `MIN_QTY` int(10) NOT NULL DEFAULT '0',
  `DETAILS` text,
  `DEFAULT_PRICE` float NOT NULL DEFAULT '0',
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM AUTO_INCREMENT=8 DEFAULT CHARSET=utf8;

/*Data for the table `products` */

/*Table structure for table `project_modules` */

DROP TABLE IF EXISTS `project_modules`;

CREATE TABLE `project_modules` (
  `ID` tinyint(3) unsigned NOT NULL AUTO_INCREMENT,
  `NAME` varchar(50) NOT NULL DEFAULT '',
  `TITLE` varchar(100) NOT NULL DEFAULT '',
  `CATEGORY` varchar(50) NOT NULL DEFAULT '',
  `PARENT_NAME` varchar(50) NOT NULL DEFAULT '',
  `DATA` text,
  `HIDDEN` int(3) NOT NULL DEFAULT '0',
  `PRIORITY` int(10) NOT NULL DEFAULT '0',
  `ADDED` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM AUTO_INCREMENT=104 DEFAULT CHARSET=utf8;

/*Data for the table `project_modules` */

insert  into `project_modules`(`ID`,`NAME`,`TITLE`,`CATEGORY`,`PARENT_NAME`,`DATA`,`HIDDEN`,`PRIORITY`,`ADDED`) values (1,'control_modules','<#LANG_MODULE_MODULES#>','<#LANG_SECTION_SYSTEM#>','','',0,0,'2015-01-29 12:24:27');
insert  into `project_modules`(`ID`,`NAME`,`TITLE`,`CATEGORY`,`PARENT_NAME`,`DATA`,`HIDDEN`,`PRIORITY`,`ADDED`) values (67,'scripts','<#LANG_MODULE_SCRIPTS#>','<#LANG_SECTION_OBJECTS#>','','',0,0,'2010-09-13 19:12:16');
insert  into `project_modules`(`ID`,`NAME`,`TITLE`,`CATEGORY`,`PARENT_NAME`,`DATA`,`HIDDEN`,`PRIORITY`,`ADDED`) values (4,'control_access','Control Access','<#LANG_SECTION_SYSTEM#>','','',1,0,'2011-09-29 22:16:01');
insert  into `project_modules`(`ID`,`NAME`,`TITLE`,`CATEGORY`,`PARENT_NAME`,`DATA`,`HIDDEN`,`PRIORITY`,`ADDED`) values (7,'master','<#LANG_MODULE_MASTER_LOGIN#>','<#LANG_SECTION_SYSTEM#>','','',1,0,'2014-10-30 15:57:40');
insert  into `project_modules`(`ID`,`NAME`,`TITLE`,`CATEGORY`,`PARENT_NAME`,`DATA`,`HIDDEN`,`PRIORITY`,`ADDED`) values (70,'pinghosts','<#LANG_MODULE_PINGHOSTS#>','<#LANG_SECTION_DEVICES#>','','',0,0,'2011-01-06 01:02:57');
insert  into `project_modules`(`ID`,`NAME`,`TITLE`,`CATEGORY`,`PARENT_NAME`,`DATA`,`HIDDEN`,`PRIORITY`,`ADDED`) values (20,'saverestore','<#LANG_MODULE_SAVERESTORE#>','<#LANG_SECTION_SYSTEM#>','','a:1:{s:17:\"LATEST_UPDATED_ID\";s:40:\"14d4bd4fd3c4cfc18f28094d3cb9eaa4861c62c1\";}',0,0,'2009-02-07 14:35:05');
insert  into `project_modules`(`ID`,`NAME`,`TITLE`,`CATEGORY`,`PARENT_NAME`,`DATA`,`HIDDEN`,`PRIORITY`,`ADDED`) values (21,'userlog','<#LANG_MODULE_USERLOG#>','<#LANG_SECTION_SYSTEM#>','','',1,0,'2009-02-07 14:45:52');
insert  into `project_modules`(`ID`,`NAME`,`TITLE`,`CATEGORY`,`PARENT_NAME`,`DATA`,`HIDDEN`,`PRIORITY`,`ADDED`) values (22,'skins','<#LANG_MODULE_SKINS#>','<#LANG_SECTION_SYSTEM#>','','',1,0,'2009-02-07 15:02:54');
insert  into `project_modules`(`ID`,`NAME`,`TITLE`,`CATEGORY`,`PARENT_NAME`,`DATA`,`HIDDEN`,`PRIORITY`,`ADDED`) values (23,'settings','<#LANG_MODULE_SETTINGS#>','<#LANG_SECTION_SETTINGS#>','','',0,0,'2009-02-07 15:05:40');
insert  into `project_modules`(`ID`,`NAME`,`TITLE`,`CATEGORY`,`PARENT_NAME`,`DATA`,`HIDDEN`,`PRIORITY`,`ADDED`) values (24,'dateselect','Date Selector','System','','',1,0,'2009-02-07 15:47:32');
insert  into `project_modules`(`ID`,`NAME`,`TITLE`,`CATEGORY`,`PARENT_NAME`,`DATA`,`HIDDEN`,`PRIORITY`,`ADDED`) values (25,'thumb','<#LANG_MODULE_THUMB#>','<#LANG_SECTION_SYSTEM#>','','',1,0,'2009-02-07 15:48:32');
insert  into `project_modules`(`ID`,`NAME`,`TITLE`,`CATEGORY`,`PARENT_NAME`,`DATA`,`HIDDEN`,`PRIORITY`,`ADDED`) values (74,'app_gpstrack','<#LANG_APP_GPSTRACK#>','<#LANG_SECTION_APPLICATIONS#>','','',0,0,'2011-07-25 15:27:19');
insert  into `project_modules`(`ID`,`NAME`,`TITLE`,`CATEGORY`,`PARENT_NAME`,`DATA`,`HIDDEN`,`PRIORITY`,`ADDED`) values (71,'watchfolders','<#LANG_MODULE_WATCHFOLDERS#>','<#LANG_SECTION_DEVICES#>','','',0,0,'2011-01-14 01:08:25');
insert  into `project_modules`(`ID`,`NAME`,`TITLE`,`CATEGORY`,`PARENT_NAME`,`DATA`,`HIDDEN`,`PRIORITY`,`ADDED`) values (73,'app_player','<#LANG_APP_PLAYER#>','<#LANG_SECTION_APPLICATIONS#>','','',0,0,'2011-05-03 15:02:57');
insert  into `project_modules`(`ID`,`NAME`,`TITLE`,`CATEGORY`,`PARENT_NAME`,`DATA`,`HIDDEN`,`PRIORITY`,`ADDED`) values (28,'dashboard','Dashboard','CMS','','a:5:{s:12:\"CPANEL_STATS\";i:0;s:15:\"CPANEL_USERNAME\";s:0:\"\";s:15:\"CPANEL_PASSWORD\";s:0:\"\";s:13:\"CPANEL_DOMAIN\";s:0:\"\";s:10:\"CPANEL_URL\";s:0:\"\";}',1,0,'2009-02-23 13:15:23');
insert  into `project_modules`(`ID`,`NAME`,`TITLE`,`CATEGORY`,`PARENT_NAME`,`DATA`,`HIDDEN`,`PRIORITY`,`ADDED`) values (29,'events','<#LANG_MODULE_EVENTS#>','<#LANG_SECTION_SYSTEM#>','','',1,0,'2014-10-30 15:57:40');
insert  into `project_modules`(`ID`,`NAME`,`TITLE`,`CATEGORY`,`PARENT_NAME`,`DATA`,`HIDDEN`,`PRIORITY`,`ADDED`) values (30,'users','<#LANG_MODULE_USERS#>','<#LANG_SECTION_SETTINGS#>','','',0,0,'2009-03-27 16:08:07');
insert  into `project_modules`(`ID`,`NAME`,`TITLE`,`CATEGORY`,`PARENT_NAME`,`DATA`,`HIDDEN`,`PRIORITY`,`ADDED`) values (31,'terminals','<#LANG_MODULE_TERMINALS#>','<#LANG_SECTION_SETTINGS#>','','',0,0,'2009-03-27 16:10:00');
insert  into `project_modules`(`ID`,`NAME`,`TITLE`,`CATEGORY`,`PARENT_NAME`,`DATA`,`HIDDEN`,`PRIORITY`,`ADDED`) values (34,'commands','<#LANG_MODULE_CONTROL_MENU#>','<#LANG_SECTION_OBJECTS#>','','',0,0,'2009-04-11 07:14:03');
insert  into `project_modules`(`ID`,`NAME`,`TITLE`,`CATEGORY`,`PARENT_NAME`,`DATA`,`HIDDEN`,`PRIORITY`,`ADDED`) values (37,'classes','<#LANG_MODULE_OBJECTS#>','<#LANG_SECTION_OBJECTS#>','','a:3:{s:12:\"DEFAULT_VIEW\";s:0:\"\";s:15:\"FILTER_CLASS_ID\";i:25;s:18:\"FILTER_LOCATION_ID\";i:0;}',0,0,'2009-05-22 14:09:27');
insert  into `project_modules`(`ID`,`NAME`,`TITLE`,`CATEGORY`,`PARENT_NAME`,`DATA`,`HIDDEN`,`PRIORITY`,`ADDED`) values (38,'history','<#LANG_MODULE_OBJECTS_HISTORY#>','<#LANG_SECTION_OBJECTS#>','','',1,0,'2009-05-22 14:09:51');
insert  into `project_modules`(`ID`,`NAME`,`TITLE`,`CATEGORY`,`PARENT_NAME`,`DATA`,`HIDDEN`,`PRIORITY`,`ADDED`) values (39,'locations','<#LANG_MODULE_LOCATIONS#>','<#LANG_SECTION_SETTINGS#>','','',0,0,'2009-05-22 14:11:01');
insert  into `project_modules`(`ID`,`NAME`,`TITLE`,`CATEGORY`,`PARENT_NAME`,`DATA`,`HIDDEN`,`PRIORITY`,`ADDED`) values (40,'methods','<#LANG_MODULE_METHODS#>','<#LANG_SECTION_OBJECTS#>','','',1,0,'2009-05-22 14:11:23');
insert  into `project_modules`(`ID`,`NAME`,`TITLE`,`CATEGORY`,`PARENT_NAME`,`DATA`,`HIDDEN`,`PRIORITY`,`ADDED`) values (41,'properties','<#LANG_MODULE_PROPERTIES#>','<#LANG_SECTION_OBJECTS#>','','',1,0,'2009-05-22 14:11:47');
insert  into `project_modules`(`ID`,`NAME`,`TITLE`,`CATEGORY`,`PARENT_NAME`,`DATA`,`HIDDEN`,`PRIORITY`,`ADDED`) values (42,'objects','<#LANG_MODULE_OBJECT_INSTANCES#>','<#LANG_SECTION_OBJECTS#>','','',1,0,'2009-05-22 14:12:04');
insert  into `project_modules`(`ID`,`NAME`,`TITLE`,`CATEGORY`,`PARENT_NAME`,`DATA`,`HIDDEN`,`PRIORITY`,`ADDED`) values (85,'pvalues','<#LANG_MODULE_PVALUES#>','<#LANG_SECTION_OBJECTS#>','','',1,0,'2012-11-16 19:04:26');
insert  into `project_modules`(`ID`,`NAME`,`TITLE`,`CATEGORY`,`PARENT_NAME`,`DATA`,`HIDDEN`,`PRIORITY`,`ADDED`) values (44,'shoutbox','<#LANG_MODULE_SHOUTBOX#>','<#LANG_SECTION_SYSTEM#>','','',1,0,'2009-07-29 17:53:13');
insert  into `project_modules`(`ID`,`NAME`,`TITLE`,`CATEGORY`,`PARENT_NAME`,`DATA`,`HIDDEN`,`PRIORITY`,`ADDED`) values (45,'shoutrooms','<#LANG_MODULE_SHOUTROOMS#>','<#LANG_SECTION_SYSTEM#>','','',1,0,'2009-07-29 17:53:28');
insert  into `project_modules`(`ID`,`NAME`,`TITLE`,`CATEGORY`,`PARENT_NAME`,`DATA`,`HIDDEN`,`PRIORITY`,`ADDED`) values (46,'jobs','<#LANG_MODULE_JOBS#>','<#LANG_SECTION_SYSTEM#>','','',1,0,'2014-10-30 15:57:40');
insert  into `project_modules`(`ID`,`NAME`,`TITLE`,`CATEGORY`,`PARENT_NAME`,`DATA`,`HIDDEN`,`PRIORITY`,`ADDED`) values (47,'btdevices','<#LANG_MODULE_BT_DEVICES#>','<#LANG_SECTION_DEVICES#>','','',0,0,'2009-12-13 21:06:47');
insert  into `project_modules`(`ID`,`NAME`,`TITLE`,`CATEGORY`,`PARENT_NAME`,`DATA`,`HIDDEN`,`PRIORITY`,`ADDED`) values (80,'app_calendar','<#LANG_APP_CALENDAR#>','<#LANG_SECTION_APPLICATIONS#>','','',0,0,'2012-06-25 13:34:08');
insert  into `project_modules`(`ID`,`NAME`,`TITLE`,`CATEGORY`,`PARENT_NAME`,`DATA`,`HIDDEN`,`PRIORITY`,`ADDED`) values (81,'scenes','<#LANG_MODULE_SCENES#>','<#LANG_SECTION_OBJECTS#>','','',0,0,'2012-06-25 13:34:26');
insert  into `project_modules`(`ID`,`NAME`,`TITLE`,`CATEGORY`,`PARENT_NAME`,`DATA`,`HIDDEN`,`PRIORITY`,`ADDED`) values (49,'usbdevices','<#LANG_MODULE_USB_DEVICES#>','<#LANG_SECTION_DEVICES#>','','',0,0,'2010-03-22 15:18:32');
insert  into `project_modules`(`ID`,`NAME`,`TITLE`,`CATEGORY`,`PARENT_NAME`,`DATA`,`HIDDEN`,`PRIORITY`,`ADDED`) values (68,'rss_channels','<#LANG_MODULE_RSS_CHANNELS#>','<#LANG_SECTION_SETTINGS#>','','',0,0,'2010-09-22 14:54:52');
insert  into `project_modules`(`ID`,`NAME`,`TITLE`,`CATEGORY`,`PARENT_NAME`,`DATA`,`HIDDEN`,`PRIORITY`,`ADDED`) values (61,'app_mediabrowser','<#LANG_APP_MEDIA_BROWSER#>','<#LANG_SECTION_APPLICATIONS#>','','',0,0,'2010-08-31 13:09:33');
insert  into `project_modules`(`ID`,`NAME`,`TITLE`,`CATEGORY`,`PARENT_NAME`,`DATA`,`HIDDEN`,`PRIORITY`,`ADDED`) values (64,'app_tdwiki','<#LANG_APP_TDWIKI#>','<#LANG_SECTION_APPLICATIONS#>','','',0,0,'2010-08-31 13:11:38');
insert  into `project_modules`(`ID`,`NAME`,`TITLE`,`CATEGORY`,`PARENT_NAME`,`DATA`,`HIDDEN`,`PRIORITY`,`ADDED`) values (63,'app_products','<#LANG_APP_PRODUCTS#>','<#LANG_SECTION_APPLICATIONS#>','','',0,0,'2010-08-31 13:11:24');
insert  into `project_modules`(`ID`,`NAME`,`TITLE`,`CATEGORY`,`PARENT_NAME`,`DATA`,`HIDDEN`,`PRIORITY`,`ADDED`) values (66,'layouts','<#LANG_MODULE_LAYOUTS#>','<#LANG_SECTION_SETTINGS#>','','',0,0,'2010-09-13 19:03:49');
insert  into `project_modules`(`ID`,`NAME`,`TITLE`,`CATEGORY`,`PARENT_NAME`,`DATA`,`HIDDEN`,`PRIORITY`,`ADDED`) values (82,'webvars','<#LANG_MODULE_WEBVARS#>','<#LANG_SECTION_OBJECTS#>','','',0,0,'2012-11-06 12:49:14');
insert  into `project_modules`(`ID`,`NAME`,`TITLE`,`CATEGORY`,`PARENT_NAME`,`DATA`,`HIDDEN`,`PRIORITY`,`ADDED`) values (77,'patterns','<#LANG_MODULE_PATTERNS#>','<#LANG_SECTION_OBJECTS#>','','',0,0,'2011-12-13 18:36:03');
insert  into `project_modules`(`ID`,`NAME`,`TITLE`,`CATEGORY`,`PARENT_NAME`,`DATA`,`HIDDEN`,`PRIORITY`,`ADDED`) values (78,'onewire','<#LANG_MODULE_ONEWIRE#>','<#LANG_SECTION_DEVICES#>','','',0,0,'2012-03-22 00:04:32');
insert  into `project_modules`(`ID`,`NAME`,`TITLE`,`CATEGORY`,`PARENT_NAME`,`DATA`,`HIDDEN`,`PRIORITY`,`ADDED`) values (83,'xray','X-Ray','<#LANG_SECTION_SYSTEM#>','','',0,0,'2012-11-16 18:59:57');
insert  into `project_modules`(`ID`,`NAME`,`TITLE`,`CATEGORY`,`PARENT_NAME`,`DATA`,`HIDDEN`,`PRIORITY`,`ADDED`) values (86,'app_quotes','<#LANG_APP_QUOTES#>','<#LANG_SECTION_APPLICATIONS#>','','',0,0,'2013-03-06 16:25:28');
insert  into `project_modules`(`ID`,`NAME`,`TITLE`,`CATEGORY`,`PARENT_NAME`,`DATA`,`HIDDEN`,`PRIORITY`,`ADDED`) values (87,'app_readit','<#LANG_APP_READIT#>','<#LANG_SECTION_APPLICATIONS#>','','',0,0,'2013-03-06 16:25:29');
insert  into `project_modules`(`ID`,`NAME`,`TITLE`,`CATEGORY`,`PARENT_NAME`,`DATA`,`HIDDEN`,`PRIORITY`,`ADDED`) values (88,'security_rules','<#LANG_MODULE_SECURITY_RULES#>','<#LANG_SECTION_SETTINGS#>','','',0,0,'2013-05-18 15:31:37');
insert  into `project_modules`(`ID`,`NAME`,`TITLE`,`CATEGORY`,`PARENT_NAME`,`DATA`,`HIDDEN`,`PRIORITY`,`ADDED`) values (89,'snmpdevices','<#LANG_MODULE_SNMP#>','<#LANG_SECTION_DEVICES#>','','',0,0,'2013-05-18 15:31:38');
insert  into `project_modules`(`ID`,`NAME`,`TITLE`,`CATEGORY`,`PARENT_NAME`,`DATA`,`HIDDEN`,`PRIORITY`,`ADDED`) values (90,'connect','<#LANG_MODULE_CONNECT#>','<#LANG_SECTION_SYSTEM#>','','a:7:{s:16:\"CONNECT_USERNAME\";s:0:\"\";s:16:\"CONNECT_PASSWORD\";s:0:\"\";s:12:\"CONNECT_SYNC\";i:0;s:9:\"SEND_MENU\";i:1;s:12:\"SEND_OBJECTS\";i:1;s:12:\"SEND_SCRIPTS\";i:1;s:13:\"SEND_PATTERNS\";i:1;}',0,0,'2013-08-09 14:02:04');
insert  into `project_modules`(`ID`,`NAME`,`TITLE`,`CATEGORY`,`PARENT_NAME`,`DATA`,`HIDDEN`,`PRIORITY`,`ADDED`) values (91,'mqtt','<#LANG_MODULE_MQTT#>','<#LANG_SECTION_DEVICES#>','','a:3:{s:9:\"MQTT_HOST\";s:9:\"localhost\";s:9:\"MQTT_PORT\";s:4:\"1883\";s:10:\"MQTT_QUERY\";s:10:\"/var/now/#\";}',0,0,'2013-08-09 14:02:06');
insert  into `project_modules`(`ID`,`NAME`,`TITLE`,`CATEGORY`,`PARENT_NAME`,`DATA`,`HIDDEN`,`PRIORITY`,`ADDED`) values (92,'zwave','<#LANG_MODULE_ZWAVE#>','<#LANG_SECTION_DEVICES#>','','',0,0,'2013-08-09 14:02:09');
insert  into `project_modules`(`ID`,`NAME`,`TITLE`,`CATEGORY`,`PARENT_NAME`,`DATA`,`HIDDEN`,`PRIORITY`,`ADDED`) values (93,'market','<#LANG_MODULE_MARKET#>','<#LANG_SECTION_SYSTEM#>','','',0,0,'2014-01-25 18:04:20');
insert  into `project_modules`(`ID`,`NAME`,`TITLE`,`CATEGORY`,`PARENT_NAME`,`DATA`,`HIDDEN`,`PRIORITY`,`ADDED`) values (96,'modbus','<#LANG_MODULE_MODBUS#>','<#LANG_SECTION_DEVICES#>','','',0,0,'2014-08-04 14:11:51');
insert  into `project_modules`(`ID`,`NAME`,`TITLE`,`CATEGORY`,`PARENT_NAME`,`DATA`,`HIDDEN`,`PRIORITY`,`ADDED`) values (97,'blockly_code','Blockly code','<#LANG_SECTION_SYSTEM#>','','',1,0,'2014-09-03 13:28:23');
insert  into `project_modules`(`ID`,`NAME`,`TITLE`,`CATEGORY`,`PARENT_NAME`,`DATA`,`HIDDEN`,`PRIORITY`,`ADDED`) values (98,'myblocks','<#LANG_MODULE_MYBLOCKS#>','<#LANG_SECTION_SETTINGS#>','','',0,0,'2014-10-30 15:57:40');
insert  into `project_modules`(`ID`,`NAME`,`TITLE`,`CATEGORY`,`PARENT_NAME`,`DATA`,`HIDDEN`,`PRIORITY`,`ADDED`) values (99,'soundfiles','<#LANG_MODULE_SOUNDFILES#>','<#LANG_SECTION_SETTINGS#>','','',0,0,'2014-10-30 15:57:41');
insert  into `project_modules`(`ID`,`NAME`,`TITLE`,`CATEGORY`,`PARENT_NAME`,`DATA`,`HIDDEN`,`PRIORITY`,`ADDED`) values (100,'textfiles','<#LANG_MODULE_TEXTFILES#>','<#LANG_SECTION_SETTINGS#>','','',0,0,'2014-10-30 15:57:41');
insert  into `project_modules`(`ID`,`NAME`,`TITLE`,`CATEGORY`,`PARENT_NAME`,`DATA`,`HIDDEN`,`PRIORITY`,`ADDED`) values (101,'linkedobject','LinkedObject','<#LANG_SECTION_SYSTEM#>','','',1,0,'2015-01-29 12:24:25');
insert  into `project_modules`(`ID`,`NAME`,`TITLE`,`CATEGORY`,`PARENT_NAME`,`DATA`,`HIDDEN`,`PRIORITY`,`ADDED`) values (102,'system_errors','<#LANG_MODULE_SYSTEM_ERRORS#>','<#LANG_SECTION_SYSTEM#>','','',0,0,'2015-01-29 12:24:26');
insert  into `project_modules`(`ID`,`NAME`,`TITLE`,`CATEGORY`,`PARENT_NAME`,`DATA`,`HIDDEN`,`PRIORITY`,`ADDED`) values (103,'app_nut','NUT','<#LANG_SECTION_DEVICES#>','',NULL,0,0,'2015-05-15 23:09:23');

/*Table structure for table `properties` */

DROP TABLE IF EXISTS `properties`;

CREATE TABLE `properties` (
  `ID` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `CLASS_ID` int(10) NOT NULL DEFAULT '0',
  `TITLE` varchar(255) NOT NULL DEFAULT '',
  `DESCRIPTION` text,
  `OBJECT_ID` int(10) NOT NULL DEFAULT '0',
  `KEEP_HISTORY` int(10) NOT NULL DEFAULT '0',
  `ONCHANGE` varchar(255) NOT NULL DEFAULT '',
  PRIMARY KEY (`ID`),
  KEY `CLASS_ID` (`CLASS_ID`),
  KEY `OBJECT_ID` (`OBJECT_ID`)
) ENGINE=MyISAM AUTO_INCREMENT=149 DEFAULT CHARSET=utf8;

/*Data for the table `properties` */

insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (1,1,'lastTimePressed','когда нажималась в последний раз',0,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (8,5,'СтепеньКрасноты','',0,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (10,10,'checked','время последней проверки',0,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (17,0,'testProp',NULL,7,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (12,7,'time','текущее время',0,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (18,10,'minMsgLevel','',0,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (19,19,'temp','',0,7,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (20,0,'weatherFull',NULL,7,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (21,0,'AlarmTime',NULL,7,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (22,0,'textBoxTest',NULL,7,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (23,0,'1w_temp',NULL,7,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (24,20,'tempOutside',NULL,0,7,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (25,20,'relHumOutside',NULL,0,7,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (26,20,'dewPoint',NULL,0,7,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (27,20,'windLatest',NULL,0,7,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (28,20,'windAverage',NULL,0,7,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (29,20,'rainfallRate',NULL,0,7,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (30,20,'rainfallHour',NULL,0,7,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (31,20,'rainfall24',NULL,0,7,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (32,20,'pressure',NULL,0,7,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (33,20,'pressureTrend',NULL,0,7,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (34,20,'windDirection',NULL,0,7,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (35,20,'windDirectionAverage',NULL,0,7,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (36,20,'tempInside',NULL,0,7,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (37,20,'relHumInside',NULL,0,7,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (38,20,'pressureRt',NULL,0,7,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (39,20,'updatedTime',NULL,0,7,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (40,20,'updatedDate',NULL,0,7,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (41,21,'stateDetails','details for the state',0,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (42,21,'stateColor','green / yellow / red',0,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (43,0,'TempOutside',NULL,7,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (44,0,'Econom',NULL,7,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (45,0,'securityMode',NULL,7,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (46,0,'nobodyHome',NULL,7,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (47,0,'WeHaveGuests',NULL,7,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (48,0,'cycle_statesRun',NULL,7,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (49,22,'alive','',0,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (50,22,'aliveTimeOut','',0,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (51,22,'status','',0,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (52,22,'statusText','',0,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (53,22,'updatedTimestamp','',0,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (54,23,'LinkedRoom','',0,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (55,24,'active','',0,0,'modeChanged');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (56,24,'title','',0,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (57,24,'updated','',0,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (58,24,'updatedTime','',0,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (59,25,'LatestActivity','',0,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (60,25,'LatestActivityTime','',0,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (61,25,'SomebodyHere','',0,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (62,25,'Temperature','',0,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (63,26,'status','',0,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (64,19,'LinkedRoom','',0,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (65,19,'alive','',0,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (66,19,'aliveTimeOut','',0,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (67,19,'updated','',0,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (68,19,'updatedTime','',0,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (69,0,'cycle_execsRun',NULL,7,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (70,0,'cycle_mainRun',NULL,7,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (71,0,'cycle_rssRun',NULL,7,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (72,0,'cycle_pingRun',NULL,7,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (73,0,'cycle_watchfoldersRun',NULL,7,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (74,0,'cycle_schedulerRun',NULL,7,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (75,0,'cycle_webvarsRun',NULL,7,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (76,0,'stateTitle',NULL,17,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (77,0,'stateTitle',NULL,18,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (78,0,'stateTitle',NULL,16,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (83,0,'volumeLevel',NULL,7,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (119,30,'linkedRoom','',0,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (98,0,'somebodyHome',NULL,7,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (118,30,'aliveTimeOut','',0,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (117,30,'alive','',0,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (101,0,'timeNow',NULL,7,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (102,0,'HomeStatus',NULL,7,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (103,0,'isDark',NULL,7,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (104,0,'SunSetTime',NULL,7,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (105,0,'SunRiseTime',NULL,7,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (106,0,'somebodyHomeText',NULL,7,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (107,0,'cycle_connectRun',NULL,7,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (108,0,'wunderHost',NULL,7,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (109,0,'cycle_connect_manualRun',NULL,7,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (110,0,'weatherTomorrow',NULL,7,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (111,0,'weatherTomorrowweatherToday',NULL,7,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (112,0,'weatherToday',NULL,7,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (113,0,'connect_manualRun',NULL,7,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (114,0,'clockChimeEnabled',NULL,7,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (115,29,'Code1','',0,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (116,29,'Code2','',0,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (120,30,'humidity','',0,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (121,30,'updated','',0,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (122,30,'updatedTime','',0,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (124,23,'motionDetected','',0,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (125,0,'direction',NULL,52,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (126,0,'direction',NULL,26,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (127,25,'Humidity','влажность',0,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (132,25,'Title','',0,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (133,31,'channel','Канал noolight устройства',0,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (134,32,'atHome','',0,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (135,32,'Coordinates','',0,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (136,32,'CoordinatesUpdated','',0,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (137,32,'CoordinatesUpdatedTimestamp','',0,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (138,32,'fullName','',0,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (139,32,'isMoving','',0,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (140,32,'seenAt','',0,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (143,0,'lastNewsRead',NULL,7,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (144,0,'NoolightCommandSend',NULL,7,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (145,0,'AlreadyPlayedMusic',NULL,7,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (146,0,'cycle_modbusRun',NULL,7,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (147,0,'cycle_zwaveRun',NULL,7,0,'');
insert  into `properties`(`ID`,`CLASS_ID`,`TITLE`,`DESCRIPTION`,`OBJECT_ID`,`KEEP_HISTORY`,`ONCHANGE`) values (148,0,'lastSayTime',NULL,7,0,'');

/*Table structure for table `pvalues` */

DROP TABLE IF EXISTS `pvalues`;

CREATE TABLE `pvalues` (
  `ID` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `PROPERTY_ID` int(10) NOT NULL DEFAULT '0',
  `OBJECT_ID` int(10) NOT NULL DEFAULT '0',
  `VALUE` text NOT NULL,
  `UPDATED` datetime DEFAULT NULL,
  `PROPERTY_NAME` varchar(100) NOT NULL DEFAULT '',
  `LINKED_MODULES` varchar(255) NOT NULL DEFAULT '',
  PRIMARY KEY (`ID`),
  KEY `PROPERTY_ID` (`PROPERTY_ID`),
  KEY `OBJECT_ID` (`OBJECT_ID`),
  KEY `PROPERTY_NAME` (`PROPERTY_NAME`)
) ENGINE=MyISAM AUTO_INCREMENT=305 DEFAULT CHARSET=utf8;

/*Data for the table `pvalues` */

insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (59,18,7,'1','2014-10-30 15:02:45','ThisComputer.minMsgLevel','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (60,17,7,'-15','2014-10-30 15:02:45','ThisComputer.testProp','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (58,10,7,'1346415251','2014-10-30 15:02:45','ThisComputer.checked','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (24,12,6,'2015-02-04 15:00:00','2015-02-04 15:00:00','ClockChime.time','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (61,20,7,'\n<b>Сегодня:</b><br />\nднем: +0&deg;, пасмурно, снег, ночью: +0&deg;...-2&deg;, пасмурно, снег, ветер: З — 2-4 м/с, давление: 760 мм.рт.ст, влажность: 90%<br />\n<br />\n<b>Завтра:</b><br />\nднем: +0&deg;...-2&deg;, пасмурно, ночью: -1&deg;...-3&deg;, пасмурно, снег, ветер: C — 3-5 м/с, давление: 767 мм.рт.ст, влажность: 85%<br />\n<br />\n<br />\n','2015-02-04 13:57:34','ThisComputer.weatherFull','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (186,54,51,'Hall','2014-09-04 12:12:08','MotionSensor1.LinkedRoom','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (80,43,7,'-0.8','2015-02-04 13:57:34','ThisComputer.TempOutside','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (62,21,7,'09:30','2014-10-30 15:02:45','ThisComputer.AlarmTime','commands');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (63,22,7,'0','2014-10-30 15:02:45','ThisComputer.textBoxTest','commands');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (64,23,7,'4','2014-10-30 15:02:45','ThisComputer.1w_temp','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (65,24,15,'','0000-00-00 00:00:00','ws.tempOutside','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (66,25,15,'','0000-00-00 00:00:00','ws.relHumOutside','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (67,26,15,'','0000-00-00 00:00:00','ws.dewPoint','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (68,27,15,'','0000-00-00 00:00:00','ws.windLatest','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (69,28,15,'','0000-00-00 00:00:00','ws.windAverage','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (70,29,15,'','0000-00-00 00:00:00','ws.rainfallRate','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (71,30,15,'','0000-00-00 00:00:00','ws.rainfallHour','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (72,31,15,'','0000-00-00 00:00:00','ws.rainfall24','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (73,32,15,'','0000-00-00 00:00:00','ws.pressure','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (74,33,15,'','0000-00-00 00:00:00','ws.pressureTrend','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (75,34,15,'','0000-00-00 00:00:00','ws.windDirection','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (76,35,15,'','0000-00-00 00:00:00','ws.windDirectionAverage','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (77,36,15,'26','2014-09-03 12:12:37','ws.TempInside','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (78,37,15,'','0000-00-00 00:00:00','ws.relHumInside','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (79,38,15,'0','0000-00-00 00:00:00','ws.pressureRt','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (81,44,7,'0','2014-10-30 15:02:45','ThisComputer.Econom','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (82,45,7,'0','2014-10-30 15:02:45','ThisComputer.securityMode','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (83,46,7,'0','2014-10-30 15:02:45','ThisComputer.nobodyHome','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (84,47,7,'0','2014-10-30 15:02:45','ThisComputer.WeHaveGuests','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (85,48,7,'1431885396','2015-05-17 21:56:36','ThisComputer.cycle_statesRun','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (86,69,7,'1423047606','2015-02-04 15:00:06','ThisComputer.cycle_execsRun','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (87,70,7,'1423047607','2015-02-04 15:00:07','ThisComputer.cycle_mainRun','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (88,71,7,'1423047608','2015-02-04 15:00:08','ThisComputer.cycle_rssRun','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (89,72,7,'1423047606','2015-02-04 15:00:06','ThisComputer.cycle_pingRun','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (90,73,7,'1423047608','2015-02-04 15:00:08','ThisComputer.cycle_watchfoldersRun','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (91,74,7,'1423047607','2015-02-04 15:00:07','ThisComputer.cycle_schedulerRun','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (92,75,7,'1423047608','2015-02-04 15:00:08','ThisComputer.cycle_webvarsRun','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (93,42,17,'red','2015-05-15 22:53:15','System.stateColor','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (94,76,17,'Красный','2015-05-15 22:53:15','System.stateTitle','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (95,42,18,'green','2014-10-31 15:33:55','Communication.stateColor','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (96,77,18,'Green','2014-10-31 15:33:55','Communication.stateTitle','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (97,42,16,'green','2013-08-09 13:29:00','Security.stateColor','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (98,78,16,'Green','2013-08-09 13:29:00','Security.stateTitle','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (99,41,17,'main цикл остановлен.. exec цикл остановлен.. scheduler цикл остановлен.. ping цикл остановлен.. webvars цикл остановлен.. watch folders цикл остановлен.. RSS цикл остановлен.','2015-05-15 22:53:15','System.stateDetails','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (100,83,7,'90','2014-10-30 15:02:45','ThisComputer.volumeLevel','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (157,110,7,' +0&deg;...-2&deg;, пасмурно','2015-02-04 13:57:34','ThisComputer.weatherTomorrow','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (191,62,29,'22.5','2014-09-05 12:44:59','Kitchen.Temperature','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (189,64,26,'Kitchen','2014-09-04 12:14:26','TempSensor01.LinkedRoom','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (188,52,51,'','2014-09-04 12:12:08','MotionSensor1.statusText','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (187,50,51,'','2014-09-04 12:12:08','MotionSensor1.aliveTimeOut','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (185,126,26,'1','2014-09-05 12:44:59','TempSensor01.direction','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (182,68,26,'12:44','2014-09-05 12:44:59','TempSensor01.updatedTime','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (183,65,26,'1','2014-09-05 12:44:59','TempSensor01.alive','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (184,19,26,'22.5','2014-09-05 12:44:59','TempSensor01.temp','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (120,59,30,'1409901138','2014-09-05 10:12:18','Hall.LatestActivity','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (121,60,30,'10:12','2014-09-05 10:12:18','Hall.LatestActivityTime','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (122,61,30,'0','2014-09-05 10:22:19','Hall.SomebodyHere','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (123,98,7,'1','2014-10-30 15:02:45','ThisComputer.somebodyHome','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (124,55,20,'0','2014-09-05 10:12:16','NobodyHomeMode.active','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (125,57,20,'1409901136','2014-09-05 10:12:16','NobodyHomeMode.updated','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (126,58,20,'10:12','2014-09-05 10:12:16','NobodyHomeMode.updatedTime','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (190,66,26,'','2014-09-04 12:14:26','TempSensor01.aliveTimeOut','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (128,59,24,'1409838134','2014-09-04 16:42:14','Livingroom.LatestActivity','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (129,60,24,'16:42','2014-09-04 16:42:14','Livingroom.LatestActivityTime','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (130,61,24,'0','2014-09-04 16:52:14','Livingroom.SomebodyHere','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (181,67,26,'1409910299','2014-09-05 12:44:59','TempSensor01.updated','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (132,59,29,'1409838113','2014-09-04 16:41:53','Kitchen.LatestActivity','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (133,60,29,'16:41','2014-09-04 16:41:53','Kitchen.LatestActivityTime','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (134,61,29,'0','2014-09-04 16:51:53','Kitchen.SomebodyHere','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (135,56,20,'Никого нет дома','2014-07-21 12:43:30','NobodyHomeMode.title','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (136,55,19,'0','2014-09-05 10:12:16','EconomMode.active','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (137,57,19,'1409901136','2014-09-05 10:12:16','EconomMode.updated','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (138,58,19,'10:12','2014-09-05 10:12:16','EconomMode.updatedTime','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (139,56,19,'Экономия','2014-07-21 12:44:15','EconomMode.title','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (140,55,23,'0','2015-01-29 12:51:00','DarknessMode.active','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (141,57,23,'1422521460','2015-01-29 12:51:00','DarknessMode.updated','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (142,58,23,'12:51','2015-01-29 12:51:00','DarknessMode.updatedTime','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (143,56,23,'Темное время суток','2014-07-21 12:44:48','DarknessMode.title','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (144,101,7,'15:00','2015-02-04 15:00:00','ThisComputer.timeNow','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (145,102,7,'15:00 Дома кто-то есть   ','2015-02-04 15:00:00','ThisComputer.HomeStatus','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (146,103,7,'0','2015-01-29 12:51:00','ThisComputer.isDark','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (147,55,47,'0','2014-09-05 08:00:00','NightMode.active','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (148,57,47,'1409893200','2014-09-05 08:00:00','NightMode.updated','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (149,58,47,'08:00','2014-09-05 08:00:00','NightMode.updatedTime','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (150,56,47,'Ночной','2014-07-21 12:51:25','NightMode.title','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (151,104,7,'17:51','2015-02-04 13:57:34','ThisComputer.SunSetTime','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (152,105,7,'08:54','2015-02-04 13:57:34','ThisComputer.SunRiseTime','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (153,106,7,'','2014-10-30 15:02:45','ThisComputer.somebodyHomeText','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (154,107,7,'1409911299','2014-10-30 15:02:45','ThisComputer.cycle_connectRun','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (158,111,7,' +31°...+33°, переменная облачность','2014-10-30 15:02:45','ThisComputer.weatherTomorrowweatherToday','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (156,109,7,'1407146995','2014-10-30 15:02:45','ThisComputer.cycle_connect_manualRun','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (155,108,7,'','2014-10-30 15:02:45','ThisComputer.wunderHost','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (159,112,7,' +0&deg;, пасмурно, снег','2015-02-04 13:57:34','ThisComputer.weatherToday','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (160,113,7,'1407249215','2014-10-30 15:02:45','ThisComputer.connect_manualRun','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (180,125,52,'1','2014-09-05 12:44:59','humSensor01.direction','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (179,120,52,'43','2014-09-05 12:44:59','humSensor01.humidity','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (161,114,7,'1','2014-10-30 15:02:45','ThisComputer.clockChimeEnabled','commands');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (178,117,52,'1','2014-09-05 12:44:59','humSensor01.alive','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (177,122,52,'12:44','2014-09-05 12:44:59','humSensor01.updatedTime','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (176,121,52,'1409910299','2014-09-05 12:44:59','humSensor01.updated','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (175,124,51,'0','2014-09-05 10:12:48','MotionSensor1.motionDetected','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (173,49,51,'1','2014-09-05 11:26:54','MotionSensor1.alive','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (172,53,51,'1409905614','2014-09-05 11:26:54','MotionSensor1.updatedTimestamp','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (171,51,51,'0','2014-09-05 11:26:54','MotionSensor1.status','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (213,59,54,'1409911260','2014-09-05 13:01:00','Kinderroom.LatestActivity','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (214,60,54,'13:01','2014-09-05 13:01:00','Kinderroom.LatestActivityTime','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (215,61,54,'1','2014-09-05 13:01:00','Kinderroom.SomebodyHere','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (223,59,28,'1409838048','2014-09-04 16:40:48','Bedroom.LatestActivity','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (224,60,28,'16:40','2014-09-04 16:40:48','Bedroom.LatestActivityTime','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (225,61,28,'0','2014-09-04 16:50:48','Bedroom.SomebodyHere','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (239,119,52,'Kitchen','2014-09-04 15:45:22','humSensor01.LinkedRoom','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (240,118,52,'','2014-09-04 15:45:22','humSensor01.aliveTimeOut','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (242,62,24,'22.4','2014-09-05 12:26:26','Livingroom.Temperature','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (243,127,29,'43','2014-09-05 12:44:59','Kitchen.Humidity','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (251,62,28,'22.5','2014-09-05 12:54:30','Bedroom.Temperature','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (253,127,24,'42','2014-09-05 12:26:26','Livingroom.Humidity','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (266,59,53,'','2014-09-04 16:07:54','Bathroom.LatestActivity','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (267,60,53,'','2014-09-04 16:07:54','Bathroom.LatestActivityTime','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (268,61,53,'','2014-09-04 16:07:54','Bathroom.SomebodyHere','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (269,62,53,'','2014-09-04 16:07:54','Bathroom.Temperature','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (270,127,53,'','2014-09-04 16:07:54','Bathroom.Humidity','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (271,132,53,'Ванная','2014-09-04 16:07:54','Bathroom.Title','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (272,127,28,'42','2014-09-05 12:54:30','Bedroom.Humidity','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (273,132,28,'Спальня','2014-09-04 16:08:08','Bedroom.Title','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (274,62,30,'','2014-09-04 16:08:23','Hall.Temperature','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (275,127,30,'','2014-09-04 16:08:23','Hall.Humidity','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (276,132,30,'Коридор','2014-09-04 16:08:23','Hall.Title','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (277,62,54,'','2014-09-04 16:08:36','Kinderroom.Temperature','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (278,127,54,'','2014-09-04 16:08:36','Kinderroom.Humidity','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (279,132,54,'Детская','2014-09-04 16:08:36','Kinderroom.Title','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (280,132,29,'Кухня','2014-09-04 16:08:48','Kitchen.Title','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (281,132,24,'Гостиная','2014-09-04 16:09:01','Livingroom.Title','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (282,59,55,'','2014-09-04 16:09:14','Toilet.LatestActivity','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (283,60,55,'','2014-09-04 16:09:14','Toilet.LatestActivityTime','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (284,61,55,'','2014-09-04 16:09:14','Toilet.SomebodyHere','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (285,62,55,'','2014-09-04 16:09:14','Toilet.Temperature','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (286,127,55,'','2014-09-04 16:09:14','Toilet.Humidity','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (287,132,55,'Туалет','2014-09-04 16:09:14','Toilet.Title','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (294,41,18,'','2014-10-31 15:33:55','Communication.stateDetails','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (299,143,7,'1409902937','2014-10-30 15:02:45','ThisComputer.lastNewsRead','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (300,144,7,'','2014-10-30 15:02:45','ThisComputer.NoolightCommandSend','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (301,145,7,'0,2','2014-10-30 15:02:45','ThisComputer.AlreadyPlayedMusic','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (302,146,7,'1414670249','2014-10-30 15:02:45','ThisComputer.cycle_modbusRun','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (303,147,7,'1414670247','2014-10-30 15:02:45','ThisComputer.cycle_zwaveRun','');
insert  into `pvalues`(`ID`,`PROPERTY_ID`,`OBJECT_ID`,`VALUE`,`UPDATED`,`PROPERTY_NAME`,`LINKED_MODULES`) values (304,148,7,'1431760838','2015-05-16 11:20:38','ThisComputer.lastSayTime','');

/*Table structure for table `readit_channels` */

DROP TABLE IF EXISTS `readit_channels`;

CREATE TABLE `readit_channels` (
  `ID` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `TITLE` varchar(255) NOT NULL DEFAULT '',
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

/*Data for the table `readit_channels` */

/*Table structure for table `readit_urls` */

DROP TABLE IF EXISTS `readit_urls`;

CREATE TABLE `readit_urls` (
  `ID` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `URL` char(255) NOT NULL DEFAULT '',
  `TITLE` varchar(255) NOT NULL DEFAULT '',
  `FAVORITE` int(3) NOT NULL DEFAULT '0',
  `ADDED` datetime DEFAULT NULL,
  `SYS_ID` varchar(255) NOT NULL DEFAULT '',
  `CHANNEL_ID` int(10) NOT NULL DEFAULT '0',
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

/*Data for the table `readit_urls` */

/*Table structure for table `rss_channels` */

DROP TABLE IF EXISTS `rss_channels`;

CREATE TABLE `rss_channels` (
  `ID` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `TITLE` varchar(255) NOT NULL DEFAULT '',
  `URL` char(255) NOT NULL DEFAULT '',
  `NEXT_UPDATE` datetime DEFAULT NULL,
  `LAST_UPDATE` datetime DEFAULT NULL,
  `UPDATE_EVERY` int(10) NOT NULL DEFAULT '0',
  `SCRIPT_ID` int(10) NOT NULL DEFAULT '0',
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM AUTO_INCREMENT=5 DEFAULT CHARSET=utf8;

/*Data for the table `rss_channels` */

/*Table structure for table `rss_items` */

DROP TABLE IF EXISTS `rss_items`;

CREATE TABLE `rss_items` (
  `ID` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `TITLE` varchar(255) NOT NULL DEFAULT '',
  `BODY` text,
  `URL` char(255) NOT NULL DEFAULT '',
  `GUID` varchar(255) NOT NULL DEFAULT '',
  `ADDED` varchar(255) NOT NULL DEFAULT '',
  `CHANNEL_ID` int(10) unsigned NOT NULL DEFAULT '0',
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM AUTO_INCREMENT=11992 DEFAULT CHARSET=utf8;

/*Data for the table `rss_items` */

/*Table structure for table `safe_execs` */

DROP TABLE IF EXISTS `safe_execs`;

CREATE TABLE `safe_execs` (
  `ID` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `COMMAND` text NOT NULL,
  `ADDED` datetime DEFAULT NULL,
  `EXCLUSIVE` int(3) NOT NULL DEFAULT '0',
  `PRIORITY` int(10) NOT NULL DEFAULT '0',
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM AUTO_INCREMENT=1621 DEFAULT CHARSET=utf8;

/*Data for the table `safe_execs` */

insert  into `safe_execs`(`ID`,`COMMAND`,`ADDED`,`EXCLUSIVE`,`PRIORITY`) values (1615,'mplayer /home/projects/php/projects/devel/majordomo_0_9_0b/sounds/dingdong.mp3','2015-05-15 22:56:43',1,2);
insert  into `safe_execs`(`ID`,`COMMAND`,`ADDED`,`EXCLUSIVE`,`PRIORITY`) values (1616,'mplayer /home/projects/php/projects/devel/majordomo_0_9_0b/cached/voice/e1f8e6e2a5279f08160517771cedb394.mp3','2015-05-15 22:56:43',1,2);
insert  into `safe_execs`(`ID`,`COMMAND`,`ADDED`,`EXCLUSIVE`,`PRIORITY`) values (1617,'mplayer /home/projects/php/projects/devel/majordomo_0_9_0b/cached/voice/e1f8e6e2a5279f08160517771cedb394.mp3','2015-05-15 22:56:50',1,2);
insert  into `safe_execs`(`ID`,`COMMAND`,`ADDED`,`EXCLUSIVE`,`PRIORITY`) values (1618,'mplayer /home/projects/php/projects/devel/majordomo_0_9_0b/sounds/dingdong.mp3','2015-05-16 11:20:38',1,2);
insert  into `safe_execs`(`ID`,`COMMAND`,`ADDED`,`EXCLUSIVE`,`PRIORITY`) values (1619,'mplayer /home/projects/php/projects/devel/majordomo_0_9_0b/cached/voice/2bc700b1ab2b174459d13fca326f7921.mp3','2015-05-16 11:20:38',1,2);
insert  into `safe_execs`(`ID`,`COMMAND`,`ADDED`,`EXCLUSIVE`,`PRIORITY`) values (1620,'mplayer /home/projects/php/projects/devel/majordomo_0_9_0b/cached/voice/e1f8e6e2a5279f08160517771cedb394.mp3','2015-05-16 11:20:54',1,2);

/*Table structure for table `scenes` */

DROP TABLE IF EXISTS `scenes`;

CREATE TABLE `scenes` (
  `ID` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `TITLE` varchar(255) NOT NULL DEFAULT '',
  `BACKGROUND` varchar(255) NOT NULL DEFAULT '',
  `PRIORITY` int(10) NOT NULL DEFAULT '0',
  `HIDDEN` int(3) NOT NULL DEFAULT '0',
  `WALLPAPER` varchar(255) NOT NULL DEFAULT '',
  `WALLPAPER_FIXED` int(3) NOT NULL DEFAULT '0',
  `WALLPAPER_NOREPEAT` int(3) NOT NULL DEFAULT '0',
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM AUTO_INCREMENT=3 DEFAULT CHARSET=utf8;

/*Data for the table `scenes` */

insert  into `scenes`(`ID`,`TITLE`,`BACKGROUND`,`PRIORITY`,`HIDDEN`,`WALLPAPER`,`WALLPAPER_FIXED`,`WALLPAPER_NOREPEAT`) values (1,'Scene 1','/cms/scenes/backgrounds/photolib.png',100,0,'',0,0);

/*Table structure for table `script_categories` */

DROP TABLE IF EXISTS `script_categories`;

CREATE TABLE `script_categories` (
  `ID` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `TITLE` varchar(255) NOT NULL DEFAULT '',
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM AUTO_INCREMENT=7 DEFAULT CHARSET=utf8;

/*Data for the table `script_categories` */

insert  into `script_categories`(`ID`,`TITLE`) values (3,'Test');
insert  into `script_categories`(`ID`,`TITLE`) values (4,'<#LANG_GENERAL_OPERATIONAL_MODES#>');
insert  into `script_categories`(`ID`,`TITLE`) values (5,'<#LANG_GENERAL_SENSORS#>');
insert  into `script_categories`(`ID`,`TITLE`) values (6,'Scenarios');

/*Table structure for table `scripts` */

DROP TABLE IF EXISTS `scripts`;

CREATE TABLE `scripts` (
  `ID` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `TITLE` varchar(255) NOT NULL DEFAULT '',
  `CODE` text,
  `DESCRIPTION` text,
  `TYPE` int(3) unsigned NOT NULL DEFAULT '0',
  `XML` text,
  `CATEGORY_ID` int(10) unsigned NOT NULL DEFAULT '0',
  `EXECUTED` datetime DEFAULT NULL,
  `EXECUTED_PARAMS` varchar(255) DEFAULT NULL,
  `RUN_PERIODICALLY` int(3) unsigned NOT NULL DEFAULT '0',
  `RUN_DAYS` char(30) NOT NULL DEFAULT '',
  `RUN_TIME` char(30) NOT NULL DEFAULT '',
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM AUTO_INCREMENT=23 DEFAULT CHARSET=utf8;

/*Data for the table `scripts` */

insert  into `scripts`(`ID`,`TITLE`,`CODE`,`DESCRIPTION`,`TYPE`,`XML`,`CATEGORY_ID`,`EXECUTED`,`EXECUTED_PARAMS`,`RUN_PERIODICALLY`,`RUN_DAYS`,`RUN_TIME`) values (8,'timeNow','say(timeNow());',NULL,0,NULL,3,NULL,NULL,0,'','');
insert  into `scripts`(`ID`,`TITLE`,`CODE`,`DESCRIPTION`,`TYPE`,`XML`,`CATEGORY_ID`,`EXECUTED`,`EXECUTED_PARAMS`,`RUN_PERIODICALLY`,`RUN_DAYS`,`RUN_TIME`) values (3,'rssProcess','/*\r\n$params[\'URL\'] --link\r\n$params[\'TITLE\'] -- title\r\n$params[\'BODY\'] -- body\r\n$params[\'CHANNEL_ID\'] -- channel ID\r\n$params[\'CHANNEL_TITLE\'] -- channed title\r\n\r\n*/\r\n\r\n//say($params[\'TITLE\']); // reading news','',0,'',0,'2014-10-30 14:57:24','a:10:{s:10:\"CHANNEL_ID\";s:1:\"4\";s:5:\"ADDED\";s:19:\"2014-10-16 16:36:00\";s:5:\"TITLE\";s:184:\"Белтелерадиокомпания: Надеемся, решение украинской стороны о закрытии \"Беларусь 24\" не окончательное\";s:4:\"BODY\";s:386:\"<img src=\"http://img.tyt.by/thumbnails/n/07/2',0,'','');
insert  into `scripts`(`ID`,`TITLE`,`CODE`,`DESCRIPTION`,`TYPE`,`XML`,`CATEGORY_ID`,`EXECUTED`,`EXECUTED_PARAMS`,`RUN_PERIODICALLY`,`RUN_DAYS`,`RUN_TIME`) values (10,'test','setTimeOut(\'testTimer\',\'say(\"Hello world!\");\',30);','',0,'',3,'2012-11-17 15:19:54','',0,'','');
insert  into `scripts`(`ID`,`TITLE`,`CODE`,`DESCRIPTION`,`TYPE`,`XML`,`CATEGORY_ID`,`EXECUTED`,`EXECUTED_PARAMS`,`RUN_PERIODICALLY`,`RUN_DAYS`,`RUN_TIME`) values (11,'easyRF','$device_id=$params[\'did\'];\r\n$destination_id=$params[\'dest\'];\r\n$packet_id=$params[\'pid\'];\r\n$command_id=$params[\'c\'];\r\n$data=$params[\'d\'];\r\n\r\nif ($device_id==0) {\r\n if ($command_id==10) {\r\n  //temp\r\n setGlobal(\'ws.tempInside\',round($data/100));\r\n } elseif ($command_id==12) {\r\n  //motion\r\n  callMethod(\'intSensor.statusChanged\',array(\'status\'=>1));\r\n  clearTimeOut($id.\'_move\');\r\n  setTimeOut($id.\'_move\',\"callMethod(\'intSensor.statusChanged\',array(\'status\'=>0));\",20);  \r\n }\r\n}','',0,'',5,'2014-09-03 12:12:37','a:6:{s:6:\"script\";s:6:\"easyRF\";s:3:\"did\";s:1:\"0\";s:4:\"dest\";s:1:\"0\";s:3:\"pid\";s:4:\"8339\";s:1:\"c\";s:2:\"10\";s:1:\"d\";s:4:\"2600\";}',0,'','00:00');
insert  into `scripts`(`ID`,`TITLE`,`CODE`,`DESCRIPTION`,`TYPE`,`XML`,`CATEGORY_ID`,`EXECUTED`,`EXECUTED_PARAMS`,`RUN_PERIODICALLY`,`RUN_DAYS`,`RUN_TIME`) values (12,'RCSwitch','$id=$params[\'rcswitch\'];\r\nif ($id==\'12345\') {\r\n //sensor 1\r\n}','',0,'',5,'0000-00-00 00:00:00','a:2:{s:6:\"script\";s:8:\"RCSwitch\";s:8:\"rcswitch\";s:7:\"7689557\";}',0,'','00:00');
insert  into `scripts`(`ID`,`TITLE`,`CODE`,`DESCRIPTION`,`TYPE`,`XML`,`CATEGORY_ID`,`EXECUTED`,`EXECUTED_PARAMS`,`RUN_PERIODICALLY`,`RUN_DAYS`,`RUN_TIME`) values (15,'readWeatherToday','$weather.=\"Сегодня ожидается \".str_replace(\'&deg;\',\' \',getGlobal(\'weatherToday\'));\r\n$weather.=\". Завтра \".str_replace(\'&deg;\',\' \',getGlobal(\'weatherTomorrow\'));\r\n$weather.=\". Сейчас на улице \".getGlobal(\'TempOutside\').\'.\';\r\n$weather=str_replace(\'&deg;\',\'\',$weather);\r\nsay($weather,2);','',0,'',0,'2015-05-16 11:20:37','a:2:{i:0;s:12:\"погода\";i:1;s:2:\"а\";}',0,'','00:00');
insert  into `scripts`(`ID`,`TITLE`,`CODE`,`DESCRIPTION`,`TYPE`,`XML`,`CATEGORY_ID`,`EXECUTED`,`EXECUTED_PARAMS`,`RUN_PERIODICALLY`,`RUN_DAYS`,`RUN_TIME`) values (18,'playFavoriteMusic','// вытягиваем историю из переменной\r\n$alreadyPlayed=gg(\"AlreadyPlayedMusic\");\r\nif (!$alreadyPlayed) {\r\n $alreadyPlayed=\'0\';\r\n}\r\n\r\n// выбираем случайную папку\r\n$rec=SQLSelectOne(\"SELECT * FROM media_favorites WHERE ID NOT IN (\".$alreadyPlayed.\") ORDER BY RAND()\");\r\n\r\nif (!$rec[\'ID\']) {\r\n // папок больше не осталось, поэтому выбираем случайную и сбрасываем истоирю\r\n $rec=SQLSelectOne(\"SELECT * FROM media_favorites ORDER BY RAND()\");\r\n $alreadyPlayed=\'0\';\r\n}\r\n\r\n\r\nif ($rec[\'ID\']) {\r\n\r\n // добавляем выбранную папку в историю\r\n $alreadyPlayed.=\',\'.$rec[\'ID\'];\r\n sg(\"AlreadyPlayedMusic\",$alreadyPlayed);\r\n\r\n // запускаем на проигрывание\r\n $collection=SQLSelectOne(\"SELECT * FROM collections WHERE ID=\".(int)$rec[\'COLLECTION_ID\']);\r\n $path=$collection[\'PATH\'].$rec[\'PATH\'];\r\n playMedia($path);\r\n //setTimeOut(\'VLCPlayer_update\',\"callMethod(\'VLCPlayer.update\');\",10);\r\n\r\n}','',0,'',0,'0000-00-00 00:00:00','',0,'','00:00');
insert  into `scripts`(`ID`,`TITLE`,`CODE`,`DESCRIPTION`,`TYPE`,`XML`,`CATEGORY_ID`,`EXECUTED`,`EXECUTED_PARAMS`,`RUN_PERIODICALLY`,`RUN_DAYS`,`RUN_TIME`) values (22,'Greeting','runScript(\"reportStatus\", array());\r\n','',0,'',0,'0000-00-00 00:00:00','',0,'','00:00');
insert  into `scripts`(`ID`,`TITLE`,`CODE`,`DESCRIPTION`,`TYPE`,`XML`,`CATEGORY_ID`,`EXECUTED`,`EXECUTED_PARAMS`,`RUN_PERIODICALLY`,`RUN_DAYS`,`RUN_TIME`) values (19,'playPause','getURL(\'http://localhost/rc/?command=vlc_pause\',0);','',0,'',0,'0000-00-00 00:00:00','',0,'','00:00');
insert  into `scripts`(`ID`,`TITLE`,`CODE`,`DESCRIPTION`,`TYPE`,`XML`,`CATEGORY_ID`,`EXECUTED`,`EXECUTED_PARAMS`,`RUN_PERIODICALLY`,`RUN_DAYS`,`RUN_TIME`) values (20,'Watching movie','say(LANG_GENERAL_SETTING_UP_LIGHTS,2);\r\n// to-do','',0,'',6,'0000-00-00 00:00:00','',0,'','00:00');
insert  into `scripts`(`ID`,`TITLE`,`CODE`,`DESCRIPTION`,`TYPE`,`XML`,`CATEGORY_ID`,`EXECUTED`,`EXECUTED_PARAMS`,`RUN_PERIODICALLY`,`RUN_DAYS`,`RUN_TIME`) values (21,'reportStatus','$res=\'\';\r\n if (gg(\'Security.stateColor\')==\'green\' && gg(\'System.stateColor\')==\'green\' && gg(\'Communication.stateColor\')==\'green\') {\r\n  $res=\'Все системы работают в штатном режиме\';\r\n } else {\r\n  if (gg(\'Security.stateColor\')!=\'green\') {\r\n   $res.=\" Проблема безопасности: \".getGlobal(\'Security.stateDetails\');\r\n  }\r\n  if (gg(\'System.stateColor\')!=\'green\') {\r\n   $res.=\" Системная проблема: \".getGlobal(\'System.stateDetails\');\r\n  }  \r\n  if (gg(\'Communication.stateColor\')!=\'green\') {\r\n   $res.=\" Проблема связи: \".getGlobal(\'Communication.stateDetails\');\r\n  }  \r\n }\r\n say($res,5);','',0,'',0,'0000-00-00 00:00:00','a:1:{i:0;s:27:\"статус системы\";}',0,'','00:00');

/*Table structure for table `security_rules` */

DROP TABLE IF EXISTS `security_rules`;

CREATE TABLE `security_rules` (
  `ID` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `OBJECT_TYPE` char(20) NOT NULL DEFAULT '',
  `OBJECT_ID` int(10) NOT NULL DEFAULT '0',
  `TERMINALS` varchar(255) NOT NULL DEFAULT '',
  `TERMINALS_EXCEPT` int(3) NOT NULL DEFAULT '0',
  `USERS` varchar(255) NOT NULL DEFAULT '',
  `USERS_EXCEPT` int(3) NOT NULL DEFAULT '0',
  `TIMES` varchar(255) NOT NULL DEFAULT '',
  `TIMES_EXCEPT` int(3) NOT NULL DEFAULT '0',
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

/*Data for the table `security_rules` */

/*Table structure for table `settings` */

DROP TABLE IF EXISTS `settings`;

CREATE TABLE `settings` (
  `ID` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `PRIORITY` int(3) unsigned NOT NULL DEFAULT '0',
  `HR` int(3) unsigned NOT NULL DEFAULT '0',
  `TITLE` varchar(255) NOT NULL DEFAULT '',
  `NAME` varchar(50) NOT NULL DEFAULT '',
  `TYPE` varchar(59) NOT NULL DEFAULT '',
  `NOTES` text NOT NULL,
  `VALUE` varchar(255) NOT NULL DEFAULT '',
  `DEFAULTVALUE` varchar(255) NOT NULL DEFAULT '',
  `URL` varchar(255) NOT NULL DEFAULT '',
  `URL_TITLE` varchar(255) NOT NULL DEFAULT '',
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM AUTO_INCREMENT=84 DEFAULT CHARSET=utf8;

/*Data for the table `settings` */

insert  into `settings`(`ID`,`PRIORITY`,`HR`,`TITLE`,`NAME`,`TYPE`,`NOTES`,`VALUE`,`DEFAULTVALUE`,`URL`,`URL_TITLE`) values (2,254,0,'Site Domain Name','SITE_DOMAIN','text','','domain.com','domain.com','','');
insert  into `settings`(`ID`,`PRIORITY`,`HR`,`TITLE`,`NAME`,`TYPE`,`NOTES`,`VALUE`,`DEFAULTVALUE`,`URL`,`URL_TITLE`) values (3,0,0,'Contact E-mail','SITE_EMAIL','text','','info@domain.com','info@domain.com','','');
insert  into `settings`(`ID`,`PRIORITY`,`HR`,`TITLE`,`NAME`,`TYPE`,`NOTES`,`VALUE`,`DEFAULTVALUE`,`URL`,`URL_TITLE`) values (7,0,0,'Days to show in \"soon\" section','APP_CALENDAR_SOONLIMIT','text','','6','6','','');
insert  into `settings`(`ID`,`PRIORITY`,`HR`,`TITLE`,`NAME`,`TYPE`,`NOTES`,`VALUE`,`DEFAULTVALUE`,`URL`,`URL_TITLE`) values (8,0,0,'Show recently done items','APP_CALENDAR_SHOWDONE','yesno','','1','1','','');
insert  into `settings`(`ID`,`PRIORITY`,`HR`,`TITLE`,`NAME`,`TYPE`,`NOTES`,`VALUE`,`DEFAULTVALUE`,`URL`,`URL_TITLE`) values (9,0,0,'Scene width','SCENES_WIDTH','text','','803','803','','');
insert  into `settings`(`ID`,`PRIORITY`,`HR`,`TITLE`,`NAME`,`TYPE`,`NOTES`,`VALUE`,`DEFAULTVALUE`,`URL`,`URL_TITLE`) values (24,0,0,'Scene height','SCENES_HEIGHT','text','','606','606','','');
insert  into `settings`(`ID`,`PRIORITY`,`HR`,`TITLE`,`NAME`,`TYPE`,`NOTES`,`VALUE`,`DEFAULTVALUE`,`URL`,`URL_TITLE`) values (29,100,0,'Run bluetooth scanner','BLUETOOTH_CYCLE','onoff','','0','0','','');
insert  into `settings`(`ID`,`PRIORITY`,`HR`,`TITLE`,`NAME`,`TYPE`,`NOTES`,`VALUE`,`DEFAULTVALUE`,`URL`,`URL_TITLE`) values (30,100,0,'Run Skype script','SKYPE_CYCLE','onoff','','0','0','','');
insert  into `settings`(`ID`,`PRIORITY`,`HR`,`TITLE`,`NAME`,`TYPE`,`NOTES`,`VALUE`,`DEFAULTVALUE`,`URL`,`URL_TITLE`) values (31,30,0,'Twitter Consumer key','TWITTER_CKEY','text','','','','','');
insert  into `settings`(`ID`,`PRIORITY`,`HR`,`TITLE`,`NAME`,`TYPE`,`NOTES`,`VALUE`,`DEFAULTVALUE`,`URL`,`URL_TITLE`) values (32,29,0,'Twitter Consumer secret','TWITTER_CSECRET','text','','','','','');
insert  into `settings`(`ID`,`PRIORITY`,`HR`,`TITLE`,`NAME`,`TYPE`,`NOTES`,`VALUE`,`DEFAULTVALUE`,`URL`,`URL_TITLE`) values (33,28,0,'Twitter Access token','TWITTER_ATOKEN','text','','','','','');
insert  into `settings`(`ID`,`PRIORITY`,`HR`,`TITLE`,`NAME`,`TYPE`,`NOTES`,`VALUE`,`DEFAULTVALUE`,`URL`,`URL_TITLE`) values (34,27,0,'Twitter Access token secret','TWITTER_ASECRET','text','','','','','');
insert  into `settings`(`ID`,`PRIORITY`,`HR`,`TITLE`,`NAME`,`TYPE`,`NOTES`,`VALUE`,`DEFAULTVALUE`,`URL`,`URL_TITLE`) values (35,0,0,'Save debug information to history','DEBUG_HISTORY','onoff','','0','0','','');
insert  into `settings`(`ID`,`PRIORITY`,`HR`,`TITLE`,`NAME`,`TYPE`,`NOTES`,`VALUE`,`DEFAULTVALUE`,`URL`,`URL_TITLE`) values (61,0,0,'Voice notifications language','VOICE_LANGUAGE','text','','ru','en','','');
insert  into `settings`(`ID`,`PRIORITY`,`HR`,`TITLE`,`NAME`,`TYPE`,`NOTES`,`VALUE`,`DEFAULTVALUE`,`URL`,`URL_TITLE`) values (62,0,0,'Color theme','THEME','text','','light','dark','','');
insert  into `settings`(`ID`,`PRIORITY`,`HR`,`TITLE`,`NAME`,`TYPE`,`NOTES`,`VALUE`,`DEFAULTVALUE`,`URL`,`URL_TITLE`) values (44,0,0,'Play sound signal before speaking','SPEAK_SIGNAL','onoff','','1','1','','');
insert  into `settings`(`ID`,`PRIORITY`,`HR`,`TITLE`,`NAME`,`TYPE`,`NOTES`,`VALUE`,`DEFAULTVALUE`,`URL`,`URL_TITLE`) values (45,0,0,'Pushover.net user key','PUSHOVER_USER_KEY','text','','','','','');
insert  into `settings`(`ID`,`PRIORITY`,`HR`,`TITLE`,`NAME`,`TYPE`,`NOTES`,`VALUE`,`DEFAULTVALUE`,`URL`,`URL_TITLE`) values (46,0,0,'Pushover.net message minimum level','PUSHOVER_LEVEL','text','','1','1','','');
insert  into `settings`(`ID`,`PRIORITY`,`HR`,`TITLE`,`NAME`,`TYPE`,`NOTES`,`VALUE`,`DEFAULTVALUE`,`URL`,`URL_TITLE`) values (63,60,0,'Use Google Text-to-Speech engine','TTS_GOOGLE','onoff','','1','1','','');
insert  into `settings`(`ID`,`PRIORITY`,`HR`,`TITLE`,`NAME`,`TYPE`,`NOTES`,`VALUE`,`DEFAULTVALUE`,`URL`,`URL_TITLE`) values (54,43,0,'Forward notification to Growl service','GROWL_ENABLE','onoff','','0','0','','');
insert  into `settings`(`ID`,`PRIORITY`,`HR`,`TITLE`,`NAME`,`TYPE`,`NOTES`,`VALUE`,`DEFAULTVALUE`,`URL`,`URL_TITLE`) values (55,42,0,'Growl service hostname','GROWL_HOST','text','','','','','');
insert  into `settings`(`ID`,`PRIORITY`,`HR`,`TITLE`,`NAME`,`TYPE`,`NOTES`,`VALUE`,`DEFAULTVALUE`,`URL`,`URL_TITLE`) values (56,41,0,'Growl service password (optional)','GROWL_PASSWORD','text','','','','','');
insert  into `settings`(`ID`,`PRIORITY`,`HR`,`TITLE`,`NAME`,`TYPE`,`NOTES`,`VALUE`,`DEFAULTVALUE`,`URL`,`URL_TITLE`) values (57,40,0,'Growl notification minimum level','GROWL_LEVEL','text','','1','1','','');
insert  into `settings`(`ID`,`PRIORITY`,`HR`,`TITLE`,`NAME`,`TYPE`,`NOTES`,`VALUE`,`DEFAULTVALUE`,`URL`,`URL_TITLE`) values (59,30,0,'Before SAY (code)','HOOK_BEFORE_SAY','text','','','','','');
insert  into `settings`(`ID`,`PRIORITY`,`HR`,`TITLE`,`NAME`,`TYPE`,`NOTES`,`VALUE`,`DEFAULTVALUE`,`URL`,`URL_TITLE`) values (60,29,0,'After SAY (code)','HOOK_AFTER_SAY','text','','','','','');
insert  into `settings`(`ID`,`PRIORITY`,`HR`,`TITLE`,`NAME`,`TYPE`,`NOTES`,`VALUE`,`DEFAULTVALUE`,`URL`,`URL_TITLE`) values (65,0,0,'Pushbullet API Key','PUSHBULLET_KEY','text','','','','','');
insert  into `settings`(`ID`,`PRIORITY`,`HR`,`TITLE`,`NAME`,`TYPE`,`NOTES`,`VALUE`,`DEFAULTVALUE`,`URL`,`URL_TITLE`) values (66,0,0,'Pushbullet message minimum level','PUSHBULLET_LEVEL','text','','1','1','','');
insert  into `settings`(`ID`,`PRIORITY`,`HR`,`TITLE`,`NAME`,`TYPE`,`NOTES`,`VALUE`,`DEFAULTVALUE`,`URL`,`URL_TITLE`) values (67,0,0,'Pushbullet Device ID (optional)','PUSHBULLET_DEVICE_ID','text','','','','','');
insert  into `settings`(`ID`,`PRIORITY`,`HR`,`TITLE`,`NAME`,`TYPE`,`NOTES`,`VALUE`,`DEFAULTVALUE`,`URL`,`URL_TITLE`) values (68,0,0,'Pushbullet notifiaction prefix (optional)','PUSHBULLET_PREFIX','text','','','','','');
insert  into `settings`(`ID`,`PRIORITY`,`HR`,`TITLE`,`NAME`,`TYPE`,`NOTES`,`VALUE`,`DEFAULTVALUE`,`URL`,`URL_TITLE`) values (69,0,0,'Path to store backup','BACKUP_PATH','text','','','','','');
insert  into `settings`(`ID`,`PRIORITY`,`HR`,`TITLE`,`NAME`,`TYPE`,`NOTES`,`VALUE`,`DEFAULTVALUE`,`URL`,`URL_TITLE`) values (72,0,0,'Computer\'s name','GENERAL_ALICE_NAME','text','','','','','');
insert  into `settings`(`ID`,`PRIORITY`,`HR`,`TITLE`,`NAME`,`TYPE`,`NOTES`,`VALUE`,`DEFAULTVALUE`,`URL`,`URL_TITLE`) values (73,0,0,'Language','SITE_LANGUAGE','text','','ru','en','','');
insert  into `settings`(`ID`,`PRIORITY`,`HR`,`TITLE`,`NAME`,`TYPE`,`NOTES`,`VALUE`,`DEFAULTVALUE`,`URL`,`URL_TITLE`) values (74,0,0,'Time zone','SITE_TIMEZONE','text','','Asia/Dubai','Europe/Moscow','','');
insert  into `settings`(`ID`,`PRIORITY`,`HR`,`TITLE`,`NAME`,`TYPE`,`NOTES`,`VALUE`,`DEFAULTVALUE`,`URL`,`URL_TITLE`) values (75,0,0,'Vertical navigation','SCENES_VERTICAL_NAV','onoff','','','0','','');
insert  into `settings`(`ID`,`PRIORITY`,`HR`,`TITLE`,`NAME`,`TYPE`,`NOTES`,`VALUE`,`DEFAULTVALUE`,`URL`,`URL_TITLE`) values (76,0,0,'Path to background','SCENES_BACKGROUND','path','','','','','');
insert  into `settings`(`ID`,`PRIORITY`,`HR`,`TITLE`,`NAME`,`TYPE`,`NOTES`,`VALUE`,`DEFAULTVALUE`,`URL`,`URL_TITLE`) values (77,0,0,'Path to video background','SCENES_BACKGROUND_VIDEO','path','','','','','');
insert  into `settings`(`ID`,`PRIORITY`,`HR`,`TITLE`,`NAME`,`TYPE`,`NOTES`,`VALUE`,`DEFAULTVALUE`,`URL`,`URL_TITLE`) values (78,0,0,'Path to click-sound file','SCENES_CLICKSOUND','path','','','','','');
insert  into `settings`(`ID`,`PRIORITY`,`HR`,`TITLE`,`NAME`,`TYPE`,`NOTES`,`VALUE`,`DEFAULTVALUE`,`URL`,`URL_TITLE`) values (79,0,0,'Backround Fixed','SCENES_BACKGROUND_FIXED','onoff','','','0','','');
insert  into `settings`(`ID`,`PRIORITY`,`HR`,`TITLE`,`NAME`,`TYPE`,`NOTES`,`VALUE`,`DEFAULTVALUE`,`URL`,`URL_TITLE`) values (80,0,0,'Background No repeat','SCENES_BACKGROUND_NOREPEAT','onoff','','','0','','');
insert  into `settings`(`ID`,`PRIORITY`,`HR`,`TITLE`,`NAME`,`TYPE`,`NOTES`,`VALUE`,`DEFAULTVALUE`,`URL`,`URL_TITLE`) values (81,0,0,'Write log to (file/database/both)','LOGGER_DESTINATION','text','','','','','');
insert  into `settings`(`ID`,`PRIORITY`,`HR`,`TITLE`,`NAME`,`TYPE`,`NOTES`,`VALUE`,`DEFAULTVALUE`,`URL`,`URL_TITLE`) values (82,0,0,'Before PlaySound (code)','HOOK_BEFORE_PLAYSOUND','text','','','','','');
insert  into `settings`(`ID`,`PRIORITY`,`HR`,`TITLE`,`NAME`,`TYPE`,`NOTES`,`VALUE`,`DEFAULTVALUE`,`URL`,`URL_TITLE`) values (83,0,0,'After PlaySound (code)','HOOK_AFTER_PLAYSOUND','text','','','','','');

/*Table structure for table `shoplist` */

DROP TABLE IF EXISTS `shoplist`;

CREATE TABLE `shoplist` (
  `ID` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `TITLE` varchar(255) NOT NULL DEFAULT '',
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

/*Data for the table `shoplist` */

/*Table structure for table `shopping_list_items` */

DROP TABLE IF EXISTS `shopping_list_items`;

CREATE TABLE `shopping_list_items` (
  `ID` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `TITLE` varchar(255) NOT NULL DEFAULT '',
  `PRODUCT_ID` int(10) NOT NULL DEFAULT '0',
  `PRICE` float NOT NULL DEFAULT '0',
  `CODE` varchar(255) NOT NULL DEFAULT '',
  `IN_CART` int(3) NOT NULL DEFAULT '0',
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM AUTO_INCREMENT=21 DEFAULT CHARSET=utf8;

/*Data for the table `shopping_list_items` */

/*Table structure for table `shoutrooms` */

DROP TABLE IF EXISTS `shoutrooms`;

CREATE TABLE `shoutrooms` (
  `ID` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `TITLE` varchar(250) NOT NULL DEFAULT '',
  `PRIORITY` int(10) NOT NULL DEFAULT '0',
  `ADDED_BY` int(10) NOT NULL DEFAULT '0',
  `ADDED` datetime DEFAULT NULL,
  `IS_PUBLIC` int(3) NOT NULL DEFAULT '0',
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

/*Data for the table `shoutrooms` */

/*Table structure for table `shouts` */

DROP TABLE IF EXISTS `shouts`;

CREATE TABLE `shouts` (
  `ID` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `ROOM_ID` int(10) NOT NULL DEFAULT '0',
  `MEMBER_ID` int(10) NOT NULL DEFAULT '0',
  `MESSAGE` varchar(255) NOT NULL DEFAULT '',
  `ADDED` datetime DEFAULT NULL,
  `IMPORTANCE` int(10) NOT NULL DEFAULT '0',
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM AUTO_INCREMENT=15 DEFAULT CHARSET=utf8;

/*Data for the table `shouts` */

insert  into `shouts`(`ID`,`ROOM_ID`,`MEMBER_ID`,`MESSAGE`,`ADDED`,`IMPORTANCE`) values (5,0,0,'Системный статус изменился на Красный.','2015-05-15 22:53:15',0);
insert  into `shouts`(`ID`,`ROOM_ID`,`MEMBER_ID`,`MESSAGE`,`ADDED`,`IMPORTANCE`) values (6,0,0,'main цикл остановлен.. exec цикл остановлен.. scheduler цикл остановлен.. ping цикл остановлен.. webvars цикл остановлен.. watch folders цикл остановлен.. RSS цикл остановлен.','2015-05-15 22:53:15',0);
insert  into `shouts`(`ID`,`ROOM_ID`,`MEMBER_ID`,`MESSAGE`,`ADDED`,`IMPORTANCE`) values (7,0,1,'www','2015-05-15 22:56:43',0);
insert  into `shouts`(`ID`,`ROOM_ID`,`MEMBER_ID`,`MESSAGE`,`ADDED`,`IMPORTANCE`) values (8,0,0,'Неизвестная команда...','2015-05-15 22:56:43',2);
insert  into `shouts`(`ID`,`ROOM_ID`,`MEMBER_ID`,`MESSAGE`,`ADDED`,`IMPORTANCE`) values (9,0,1,'say 21','2015-05-15 22:56:50',0);
insert  into `shouts`(`ID`,`ROOM_ID`,`MEMBER_ID`,`MESSAGE`,`ADDED`,`IMPORTANCE`) values (10,0,0,'Неизвестная команда...','2015-05-15 22:56:50',2);
insert  into `shouts`(`ID`,`ROOM_ID`,`MEMBER_ID`,`MESSAGE`,`ADDED`,`IMPORTANCE`) values (11,0,1,'погода','2015-05-16 11:20:37',0);
insert  into `shouts`(`ID`,`ROOM_ID`,`MEMBER_ID`,`MESSAGE`,`ADDED`,`IMPORTANCE`) values (12,0,0,'Сегодня ожидается  +0 , пасмурно, снег. Завтра  +0 ...-2 , пасмурно. Сейчас на улице -0.8.','2015-05-16 11:20:37',2);
insert  into `shouts`(`ID`,`ROOM_ID`,`MEMBER_ID`,`MESSAGE`,`ADDED`,`IMPORTANCE`) values (13,0,1,'умри','2015-05-16 11:20:54',0);
insert  into `shouts`(`ID`,`ROOM_ID`,`MEMBER_ID`,`MESSAGE`,`ADDED`,`IMPORTANCE`) values (14,0,0,'Неизвестная команда...','2015-05-16 11:20:54',2);

/*Table structure for table `snmpdevices` */

DROP TABLE IF EXISTS `snmpdevices`;

CREATE TABLE `snmpdevices` (
  `ID` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `TITLE` varchar(255) NOT NULL DEFAULT '',
  `HOST` varchar(255) NOT NULL DEFAULT '',
  `STATUS` int(3) NOT NULL DEFAULT '0',
  `SCRIPT_ID` int(10) NOT NULL DEFAULT '0',
  `CODE` text,
  `MIB_FILE` varchar(70) NOT NULL DEFAULT '',
  `READ_COMMUNITY` varchar(255) NOT NULL DEFAULT '',
  `WRITE_COMMUNITY` varchar(255) NOT NULL DEFAULT '',
  `TRAPLOG` text,
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

/*Data for the table `snmpdevices` */

/*Table structure for table `snmpproperties` */

DROP TABLE IF EXISTS `snmpproperties`;

CREATE TABLE `snmpproperties` (
  `ID` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `DEVICE_ID` int(10) NOT NULL DEFAULT '0',
  `TITLE` varchar(255) NOT NULL DEFAULT '',
  `OID` varchar(255) NOT NULL DEFAULT '',
  `VALUE` varchar(255) NOT NULL DEFAULT '',
  `TYPE` char(10) NOT NULL DEFAULT '',
  `LINKED_OBJECT` varchar(255) NOT NULL DEFAULT '',
  `LINKED_PROPERTY` varchar(255) NOT NULL DEFAULT '',
  `ONLINE_INTERVAL` int(10) NOT NULL DEFAULT '0',
  `CHECK_NEXT` datetime DEFAULT NULL,
  `UPDATED` datetime DEFAULT NULL,
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

/*Data for the table `snmpproperties` */

/*Table structure for table `system_errors` */

DROP TABLE IF EXISTS `system_errors`;

CREATE TABLE `system_errors` (
  `ID` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `CODE` varchar(50) NOT NULL DEFAULT '',
  `TITLE` varchar(255) NOT NULL DEFAULT '',
  `DETAILS` text,
  `ACTIVE` int(3) NOT NULL DEFAULT '0',
  `LATEST_UPDATE` datetime DEFAULT NULL,
  `KEEP_HISTORY` int(3) NOT NULL DEFAULT '0',
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

/*Data for the table `system_errors` */

/*Table structure for table `system_errors_data` */

DROP TABLE IF EXISTS `system_errors_data`;

CREATE TABLE `system_errors_data` (
  `ID` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `ERROR_ID` int(10) NOT NULL DEFAULT '0',
  `COMMENTS` text,
  `ADDED` datetime DEFAULT NULL,
  `PROPERTIES_DATA` text,
  `METHODS_DATA` text,
  `SCRIPTS_DATA` text,
  `TIMERS_DATA` text,
  `EVENTS_DATA` text,
  `DEBUG_DATA` text,
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

/*Data for the table `system_errors_data` */

/*Table structure for table `tdwiki` */

DROP TABLE IF EXISTS `tdwiki`;

CREATE TABLE `tdwiki` (
  `ID` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `NAME` varchar(100) NOT NULL DEFAULT '',
  `CONTENT` text,
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM AUTO_INCREMENT=3 DEFAULT CHARSET=utf8;

/*Data for the table `tdwiki` */

insert  into `tdwiki`(`ID`,`NAME`,`CONTENT`) values (1,'','<!--#\n @version 0.1 (auto-set)\n#-->\n<div tiddler=\"DefaultTiddlers\" modified=\"200610311519\" modifier=\"Serge J.\" tags=\"\">[[Notes]]</div>\r\n<div tiddler=\"MainMenu\" modified=\"200610311519\" modifier=\"Serge J.\" tags=\"\">[[Notes]]  [[FormattingInstructions]] [[MainMenu]] [[DefaultTiddlers]]</div>\r\n<div tiddler=\"FormattingInstructions\" modified=\"200607061334\" modifier=\"YourName\" tags=\"\">TiddlyWiki uses Wiki style markup, a way of lightly &quot;tagging&quot; plain text so it can be transformed into HTML. Edit this Tiddler to see samples.\\n\\n! Header Samples\\n!Header 1\\n!!Header 2\\n!!!Header 3\\n!!!!Header 4\\n!!!!!Header 5\\n\\n! Unordered Lists:\\n* Lists are where it\'s at\\n* Just use an asterisk and you\'re set\\n** To nest lists just add more asterisks...\\n***...like this\\n* The circle makes a great bullet because once you\'ve printed a list you can mark off completed items\\n* You can also nest mixed list types\\n## Like this\\n\\n! Ordered Lists\\n# Ordered lists are pretty neat too\\n# If you\'re handy with HTML and CSS you could customize the [[numbering scheme|http://www.w3schools.com/css/pr_list-style-type.asp]]\\n## To nest, just add more octothorpes (pound signs)...\\n### Like this\\n* You can also\\n** Mix list types\\n*** like this\\n# Pretty neat don\'t you think?\\n\\n! Tiddler links\\nTo create a Tiddler link, just use mixed-case WikiWord, or use [[brackets]] for NonWikiWordLinks. This is how the GTD style [[@Action]] lists are created. \\n\\nNote that existing Tiddlers are in bold and empty Tiddlers are in italics. See CreatingTiddlers for details.\\n\\n! External Links\\nYou can link to [[external sites|http://google.com]] with brackets. You can also LinkToFolders on your machine or network shares.\\n\\n! Images\\nEdit this tiddler to see how it\'s done.\\n[img[http://img110.echo.cx/img110/139/gorilla8nw.jpg]]\\n\\n!Tables\\n|!th1111111111|!th2222222222|\\n|&gt;| colspan |\\n| rowspan |left|\\n|~| right|\\n|colored| center |\\n|caption|c\\n\\nFor a complex table example, see PeriodicTable.\\n\\n! Horizontal Rules\\nYou can divide a tiddler into\\n----\\nsections by typing four dashes on a line by themselves.\\n\\n! Blockquotes\\n&lt;&lt;&lt;\\nThis is how you do an extended, wrapped blockquote so you don\'t have to put angle quotes on every line.\\n&lt;&lt;&lt;\\n&gt;level 1\\n&gt;level 1\\n&gt;&gt;level 2\\n&gt;&gt;level 2\\n&gt;&gt;&gt;level 3\\n&gt;&gt;&gt;level 3\\n&gt;&gt;level 2\\n&gt;level 1\\n\\n! Other Formatting\\n\'\'Bold\'\'\\n==Strike==\\n__Underline__\\n//Italic//\\nSuperscript: 2^^3^^=8\\nSubscript: a~~ij~~ = -a~~ji~~\\n@@highlight@@ Unfortunately highlighting is broken right now.\\n@@color(green):green colored@@\\n@@bgcolor(#ff0000):color(#ffffff):red colored@@ Hex colors are also broken right now.\\n</div>');
insert  into `tdwiki`(`ID`,`NAME`,`CONTENT`) values (2,'default','<!--#\n @version 0.1 (auto-set)\n#-->\n<div tiddler=\"DefaultTiddlers\" modified=\"200610311519\" modifier=\"Serge J.\" tags=\"\">[[Notes]]</div>\r\n<div tiddler=\"MainMenu\" modified=\"200610311519\" modifier=\"Serge J.\" tags=\"\">[[Notes]]  [[FormattingInstructions]] [[MainMenu]] [[DefaultTiddlers]]</div>\r\n<div tiddler=\"FormattingInstructions\" modified=\"200607061334\" modifier=\"YourName\" tags=\"\">TiddlyWiki uses Wiki style markup, a way of lightly &quot;tagging&quot; plain text so it can be transformed into HTML. Edit this Tiddler to see samples.\\n\\n! Header Samples\\n!Header 1\\n!!Header 2\\n!!!Header 3\\n!!!!Header 4\\n!!!!!Header 5\\n\\n! Unordered Lists:\\n* Lists are where it\'s at\\n* Just use an asterisk and you\'re set\\n** To nest lists just add more asterisks...\\n***...like this\\n* The circle makes a great bullet because once you\'ve printed a list you can mark off completed items\\n* You can also nest mixed list types\\n## Like this\\n\\n! Ordered Lists\\n# Ordered lists are pretty neat too\\n# If you\'re handy with HTML and CSS you could customize the [[numbering scheme|http://www.w3schools.com/css/pr_list-style-type.asp]]\\n## To nest, just add more octothorpes (pound signs)...\\n### Like this\\n* You can also\\n** Mix list types\\n*** like this\\n# Pretty neat don\'t you think?\\n\\n! Tiddler links\\nTo create a Tiddler link, just use mixed-case WikiWord, or use [[brackets]] for NonWikiWordLinks. This is how the GTD style [[@Action]] lists are created. \\n\\nNote that existing Tiddlers are in bold and empty Tiddlers are in italics. See CreatingTiddlers for details.\\n\\n! External Links\\nYou can link to [[external sites|http://google.com]] with brackets. You can also LinkToFolders on your machine or network shares.\\n\\n! Images\\nEdit this tiddler to see how it\'s done.\\n[img[http://img110.echo.cx/img110/139/gorilla8nw.jpg]]\\n\\n!Tables\\n|!th1111111111|!th2222222222|\\n|&gt;| colspan |\\n| rowspan |left|\\n|~| right|\\n|colored| center |\\n|caption|c\\n\\nFor a complex table example, see PeriodicTable.\\n\\n! Horizontal Rules\\nYou can divide a tiddler into\\n----\\nsections by typing four dashes on a line by themselves.\\n\\n! Blockquotes\\n&lt;&lt;&lt;\\nThis is how you do an extended, wrapped blockquote so you don\'t have to put angle quotes on every line.\\n&lt;&lt;&lt;\\n&gt;level 1\\n&gt;level 1\\n&gt;&gt;level 2\\n&gt;&gt;level 2\\n&gt;&gt;&gt;level 3\\n&gt;&gt;&gt;level 3\\n&gt;&gt;level 2\\n&gt;level 1\\n\\n! Other Formatting\\n\'\'Bold\'\'\\n==Strike==\\n__Underline__\\n//Italic//\\nSuperscript: 2^^3^^=8\\nSubscript: a~~ij~~ = -a~~ji~~\\n@@highlight@@ Unfortunately highlighting is broken right now.\\n@@color(green):green colored@@\\n@@bgcolor(#ff0000):color(#ffffff):red colored@@ Hex colors are also broken right now.\\n</div>');

/*Table structure for table `terminals` */

DROP TABLE IF EXISTS `terminals`;

CREATE TABLE `terminals` (
  `ID` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `NAME` varchar(255) NOT NULL DEFAULT '',
  `TITLE` varchar(255) NOT NULL DEFAULT '',
  `HOST` varchar(255) NOT NULL DEFAULT '',
  `CANPLAY` int(3) NOT NULL DEFAULT '0',
  `PLAYER_TYPE` char(10) NOT NULL DEFAULT '',
  `PLAYER_PORT` varchar(255) NOT NULL DEFAULT '',
  `PLAYER_USERNAME` varchar(255) NOT NULL DEFAULT '',
  `PLAYER_PASSWORD` varchar(255) NOT NULL DEFAULT '',
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM AUTO_INCREMENT=4 DEFAULT CHARSET=utf8;

/*Data for the table `terminals` */

insert  into `terminals`(`ID`,`NAME`,`TITLE`,`HOST`,`CANPLAY`,`PLAYER_TYPE`,`PLAYER_PORT`,`PLAYER_USERNAME`,`PLAYER_PASSWORD`) values (2,'MAIN','Server','localhost',1,'','','','');

/*Table structure for table `usbdevices` */

DROP TABLE IF EXISTS `usbdevices`;

CREATE TABLE `usbdevices` (
  `ID` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `TITLE` varchar(255) NOT NULL DEFAULT '',
  `SERIAL` varchar(255) NOT NULL DEFAULT '',
  `LOG` text NOT NULL,
  `LAST_FOUND` datetime DEFAULT NULL,
  `FIRST_FOUND` datetime DEFAULT NULL,
  `USER_ID` int(10) NOT NULL DEFAULT '0',
  `SCRIPT` text NOT NULL,
  `SCRIPT_ID` int(10) unsigned NOT NULL DEFAULT '0',
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM AUTO_INCREMENT=68 DEFAULT CHARSET=utf8;

/*Data for the table `usbdevices` */

insert  into `usbdevices`(`ID`,`TITLE`,`SERIAL`,`LOG`,`LAST_FOUND`,`FIRST_FOUND`,`USER_ID`,`SCRIPT`,`SCRIPT_ID`) values (67,'устройство ','','2015-05-15 23:15:54 подключено\n2015-05-15 23:15:53 подключено\n2015-05-15 23:15:52 подключено\n2015-05-15 23:15:52 подключено\n2015-05-15 23:15:51 подключено\n2015-05-15 23:15:51 подключено\n2015-05-15 23:15:50 подключено\n2015-05-15 23:15:22 подключено\n2015-05-15 23:15:21 подключено\n2015-05-15 23:15:21 подключено\n2015-05-15 23:15:20 подключено\n2015-05-15 23:15:17 подключено\n2015-05-15 23:15:12 подключено\n2015-05-15 23:15:11 подключено\n2015-05-15 23:15:10 подключено\n2015-05-15 23:15:09 подключено\n2015-05-15 23:15:08 подключено\n2015-05-15 23:15:07 подключено (впервые)\n','2015-05-15 23:15:54','2015-05-15 23:15:07',0,'',0);

/*Table structure for table `userlog` */

DROP TABLE IF EXISTS `userlog`;

CREATE TABLE `userlog` (
  `ID` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `USER_ID` int(10) NOT NULL DEFAULT '0',
  `MESSAGE` varchar(100) NOT NULL DEFAULT '',
  `IP` varchar(20) NOT NULL DEFAULT '',
  `ADDED` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM AUTO_INCREMENT=2 DEFAULT CHARSET=utf8;

/*Data for the table `userlog` */

insert  into `userlog`(`ID`,`USER_ID`,`MESSAGE`,`IP`,`ADDED`) values (1,1,'Logged Off','192.168.1.6','2015-05-15 23:17:26');

/*Table structure for table `users` */

DROP TABLE IF EXISTS `users`;

CREATE TABLE `users` (
  `ID` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `USERNAME` varchar(255) NOT NULL DEFAULT '',
  `NAME` varchar(255) NOT NULL DEFAULT '',
  `EMAIL` varchar(255) NOT NULL DEFAULT '',
  `SKYPE` varchar(255) NOT NULL DEFAULT '',
  `MOBILE` varchar(255) NOT NULL DEFAULT '',
  `AVATAR` varchar(255) NOT NULL DEFAULT '',
  `PASSWORD` varchar(255) NOT NULL DEFAULT '',
  `IS_ADMIN` tinyint(3) NOT NULL DEFAULT '0',
  `IS_DEFAULT` tinyint(3) NOT NULL DEFAULT '0',
  `LINKED_OBJECT` varchar(255) NOT NULL DEFAULT '',
  `HOST` varchar(255) NOT NULL DEFAULT '',
  `ACTIVE_CONTEXT_ID` int(10) NOT NULL DEFAULT '0',
  `ACTIVE_CONTEXT_EXTERNAL` int(3) NOT NULL DEFAULT '0',
  `ACTIVE_CONTEXT_UPDATED` datetime DEFAULT NULL,
  `ACTIVE_CONTEXT_HISTORY` text,
  `COLOR` char(20) NOT NULL DEFAULT '',
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM AUTO_INCREMENT=5 DEFAULT CHARSET=utf8;

/*Data for the table `users` */

insert  into `users`(`ID`,`USERNAME`,`NAME`,`EMAIL`,`SKYPE`,`MOBILE`,`AVATAR`,`PASSWORD`,`IS_ADMIN`,`IS_DEFAULT`,`LINKED_OBJECT`,`HOST`,`ACTIVE_CONTEXT_ID`,`ACTIVE_CONTEXT_EXTERNAL`,`ACTIVE_CONTEXT_UPDATED`,`ACTIVE_CONTEXT_HISTORY`,`COLOR`) values (1,'admin','Admin','admin@s','','','','',1,1,'admin','',0,0,'2015-05-16 11:20:37','','');

/*Table structure for table `watchfolders` */

DROP TABLE IF EXISTS `watchfolders`;

CREATE TABLE `watchfolders` (
  `ID` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `TITLE` varchar(255) NOT NULL DEFAULT '',
  `FOLDER` varchar(255) NOT NULL DEFAULT '',
  `CHECK_MASK` varchar(255) NOT NULL DEFAULT '',
  `CHECK_LATEST` datetime DEFAULT NULL,
  `CHECK_NEXT` datetime DEFAULT NULL,
  `CHECK_INTERVAL` int(255) NOT NULL DEFAULT '0',
  `SCRIPT_ID` int(10) NOT NULL DEFAULT '0',
  `SCRIPT_TYPE` int(255) NOT NULL DEFAULT '0',
  `CHECK_RESULTS` longtext,
  `CHECK_SUB` int(3) NOT NULL DEFAULT '0',
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM AUTO_INCREMENT=2 DEFAULT CHARSET=utf8;

/*Data for the table `watchfolders` */

/*Table structure for table `webvars` */

DROP TABLE IF EXISTS `webvars`;

CREATE TABLE `webvars` (
  `ID` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `TITLE` varchar(255) NOT NULL DEFAULT '',
  `HOSTNAME` varchar(255) NOT NULL DEFAULT '',
  `TYPE` int(30) NOT NULL DEFAULT '0',
  `SEARCH_PATTERN` varchar(255) NOT NULL DEFAULT '',
  `CHECK_PATTERN` varchar(255) NOT NULL DEFAULT '',
  `LATEST_VALUE` text NOT NULL,
  `CHECK_LATEST` datetime DEFAULT NULL,
  `CHECK_NEXT` datetime DEFAULT NULL,
  `SCRIPT_ID` int(10) NOT NULL DEFAULT '0',
  `ONLINE_INTERVAL` int(10) NOT NULL DEFAULT '0',
  `LINKED_OBJECT` varchar(255) NOT NULL DEFAULT '',
  `LINKED_PROPERTY` varchar(255) NOT NULL DEFAULT '',
  `CODE` text,
  `LOG` text,
  `ENCODING` varchar(50) NOT NULL DEFAULT '',
  `AUTH` int(3) NOT NULL DEFAULT '0',
  `USERNAME` varchar(100) NOT NULL DEFAULT '',
  `PASSWORD` varchar(100) NOT NULL DEFAULT '',
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM AUTO_INCREMENT=9 DEFAULT CHARSET=utf8;

/*Data for the table `webvars` */

insert  into `webvars`(`ID`,`TITLE`,`HOSTNAME`,`TYPE`,`SEARCH_PATTERN`,`CHECK_PATTERN`,`LATEST_VALUE`,`CHECK_LATEST`,`CHECK_NEXT`,`SCRIPT_ID`,`ONLINE_INTERVAL`,`LINKED_OBJECT`,`LINKED_PROPERTY`,`CODE`,`LOG`,`ENCODING`,`AUTH`,`USERNAME`,`PASSWORD`) values (1,'<#LANG_GENERAL_WEATHER_FORECAST#>','http://pogoda.tut.by/city/26850?pda=1',0,'<\\/a><br><br \\/>(.+?)<a','','\n<b>Сегодня:</b><br />\nднем: +0&deg;, пасмурно, снег, ночью: +0&deg;...-2&deg;, пасмурно, снег, ветер: З — 2-4 м/с, давление: 760 мм.рт.ст, влажность: 90%<br />\n<br />\n<b>Завтра:</b><br />\nднем: +0&deg;...-2&deg;, пасмурно, ночью: -1&deg;...-3&deg;, пасмурно, снег, ветер: C — 3-5 м/с, давление: 767 мм.рт.ст, влажность: 85%<br />\n<br />\n<br />\n','2015-02-04 13:57:34','2015-02-04 15:57:34',0,7200,'ThisComputer','weatherFull','','<b>Завтра:</b><br />днем: +31&deg;...+33&deg;, переменная облачность, ночью: +19&deg;...+21&deg;,\nпеременная облачность, ветер: Ю — 4-6 м/с, давление: 761 мм.рт.ст, влажность: 30%<br /><br />\n\n2014-07-31 08:45:40 new value:\n<br>  \n<b>Сегодня:</b><br />днем: +27&deg;...+29&deg;, облачно с прояснениями, ночью: +18&deg;...+20&deg;,\nмалооблачно, ветер: Ю — 4-6 м/с, давление: 759 мм.рт.ст, влажность: 45%<br /><br />\n<b>Завтра:</b><br />днем: +30&deg;...+32&deg;, переменная облачность, ночью: +20&deg;...+22&deg;,\nмалооблачно, ветер: Ю — 4-6 м/с, давление: 760 мм.рт.ст, влажность: 35%<br /><br />\n\n2014-07-31 00:45:20 new value:\n<br>  \n<b>Сегодня:</b><br />днем: +31&deg;...+33&deg;, переменная облачность, ночью: +18&deg;...+20&deg;,\nмалооблачно, ветер: Ю — 7-9 м/с, давление: 758 мм.рт.ст, влажность: 30%<br /><br />\n<b>Завтра:</b><br />днем: +30&deg;...+32&deg;, переменная облачность, ночью: +20&deg;...+22&deg;,\nоблачно с прояснениями, ветер: ЮЗ — 3-5 м/с, давление: 760 мм.рт.ст, влажность: 40%<br /><br />\n\n2014-07-30 20:45:10 new value:\n<br>  \n<b>Сегодня:</b><br />днем: +30&deg;...+32&deg;, ясно, ночью: +16&deg;...+18&deg;,\nясно, ветер: Ю — 5-7 м/с, давление: 761 мм.рт.ст, влажность: 30%<br /><br />\n<b>Завтра:</b><br />днем: +31&deg;...+33&deg;, переменная облачность, ночью: +18&deg;...+20&deg;,\nмалооблачно, ветер: Ю — 7-9 м/с, давление: 758 мм.рт.ст, влажность: 30%<br /><br />\n\n2014-07-30 08:44:40 new value:\n<br>  \n<b>Сегодня:</b><br />днем: +27&deg;...+29&deg;, ясно, ночью: +16&deg;...+18&deg;,\nясно, ветер: Ю — 4-6 м/с, давление: 761 мм.рт.ст, влажность: 35%<br /><br />\n<b>Завтра:</b><br />днем: +30&deg;...+32&deg;, переменная облачность, ночью: +18&deg;...+20&deg;,\nясно, ветер: Ю — 7-9 м/с, давление: 758 мм.рт.ст, влажность: 35%<br /><br />\n\n2014-07-30 00:44:20 new value:\n<br>  \n<b>Сегодня:</b><br />днем: +28&deg;...+30&deg;, ясно, ночью: +18&deg;...+20&deg;,\nмалооблачно, ветер: Ю — 4-6 м/с, давление: 761 мм.рт.ст, влажность: 30%<br /><br />\n<b>Завтра:</b><br />днем: +30&deg;...+32&deg;, переменная облачность, ночью: +20&deg;...+22&deg;,\nоблачно с прояснениями, ветер: Ю — 7-9 м/с, давление: 758 мм.рт.ст, влажность: 35%<br /><br />\n\n2014-07-29 20:44:10 new value:\n<br>  \n<b>Сегодня:</b><br />днем: +30&deg;...+32&deg;, ясно, ночью: +18&deg;...+20&deg;,\nмалооблачно, ветер: Ю — 5-7 м/с, давление: 761 мм.рт.ст, влажность: 35%<br /><br />\n<b>Завтра:</b><br />днем: +28&deg;...+30&deg;, ясно, ночью: +18&deg;...+20&deg;,\nмалооблачно, ветер: Ю — 4-6 м/с, давление: 761 мм.рт.ст, влажность: 30%<br /><br />\n\n2014-07-29 08:43:38 new value:\n<br>  \n<b>Сегодня:</b><br />днем: +28&deg;...+30&deg;, ясно, ночью: +18&deg;...+20&deg;,\nмалооблачно, ветер: Ю — 5-7 м/с, давление: 761 мм.рт.ст, влажность: 40%<br /><br />\n<b>Завтра:</b><br />днем: +28&deg;...+30&deg;, переменная обла','',0,'','');
insert  into `webvars`(`ID`,`TITLE`,`HOSTNAME`,`TYPE`,`SEARCH_PATTERN`,`CHECK_PATTERN`,`LATEST_VALUE`,`CHECK_LATEST`,`CHECK_NEXT`,`SCRIPT_ID`,`ONLINE_INTERVAL`,`LINKED_OBJECT`,`LINKED_PROPERTY`,`CODE`,`LOG`,`ENCODING`,`AUTH`,`USERNAME`,`PASSWORD`) values (4,'<#LANG_GENERAL_TEMPERATURE_OUTSIDE#>','http://pogoda.by/pda/?city=26850',0,'погода фактическая.+?Температура воздуха (.+?)[°&]','','-0.8','2015-02-04 13:57:34','2015-02-04 14:37:34',0,2400,'ThisComputer','TempOutside','','2014-08-31 15:54:25 new value:+19.1\n2014-08-31 13:13:49 new value:+15.4\n2014-08-31 09:53:03 new value:+13.8\n2014-08-31 07:12:25 new value:+13.1\n2014-08-31 03:51:40 new value:+13.4\n2014-08-31 01:11:01 new value:+13.9\n2014-08-30 21:50:24 new value:+17.5\n2014-08-30 19:09:46 new value:+19.5\n2014-08-30 15:49:01 new value:+20.7\n2014-08-30 13:08:26 new value:+18.5\n2014-08-30 09:47:37 new value:+13.2\n2014-08-30 07:07:01 new value:+8.4\n2014-08-30 03:46:14 new value:+9.9\n2014-08-30 01:05:46 new value:+11.8\n2014-08-29 21:45:01 new value:+14.4\n2014-08-29 19:04:22 new value:+16.8\n2014-08-29 15:43:36 new value:+17.4\n2014-08-29 13:02:59 new value:+14.6\n2014-08-29 10:22:43 new value:+11.2\n2014-08-29 07:02:35 new value:+10.8\n2014-08-29 03:42:06 new value:+11.0\n2014-08-29 01:01:50 new value:+12.2\n2014-08-28 21:41:38 new value:+13.4\n2014-08-28 19:01:32 new value:+12.8\n2014-08-28 15:40:57 new value:+16.6\n2014-08-28 13:00:54 new value:+13.0\n2014-08-28 09:40:36 new value:+12.6\n2014-08-28 07:00:33 new value:+12.2\n2014-08-28 03:40:30 new value:+12.8\n2014-08-28 01:00:18 new value:+13.2\n2014-08-27 21:39:32 new value:+14.0\n2014-08-27 18:59:04 new value:+16.0\n2014-08-27 15:38:40 new value:+16.6\n2014-08-27 12:58:19 new value:+14.2\n2014-08-27 09:38:04 new value:+10.5\n2014-08-27 06:57:40 new value:+9.7\n2014-08-27 03:37:23 new value:+11.2\n2014-08-27 00:57:05 new value:+11.4\n2014-08-26 21:36:49 new value:+12.5\n2014-08-26 18:56:28 new value:+13.8\n2014-08-26 15:36:03 new value:+15.8\n2014-08-26 12:55:49 new value:+14.8\n2014-08-26 10:15:19 new value:+10.6\n2014-08-26 06:54:47 new value:+8.8\n2014-08-26 04:14:17 new value:+9.3\n2014-08-26 00:53:45 new value:+11.1\n2014-08-25 22:13:33 new value:+12.6\n2014-08-25 18:53:03 new value:+12.4\n2014-08-25 16:52:35 new value:+12.6\n2014-08-25 16:12:26 new value:','windows-1251',0,'','');
insert  into `webvars`(`ID`,`TITLE`,`HOSTNAME`,`TYPE`,`SEARCH_PATTERN`,`CHECK_PATTERN`,`LATEST_VALUE`,`CHECK_LATEST`,`CHECK_NEXT`,`SCRIPT_ID`,`ONLINE_INTERVAL`,`LINKED_OBJECT`,`LINKED_PROPERTY`,`CODE`,`LOG`,`ENCODING`,`AUTH`,`USERNAME`,`PASSWORD`) values (5,'Sunset Time','http://pogoda.by/',0,'заход: (\\d+:\\d+) \\[местное\\]','','17:51','2015-02-04 13:57:34','2015-02-04 18:57:34',0,18000,'ThisComputer','SunSetTime','','2014-10-30 15:30:21 new value:17:35\n2014-10-30 14:57:24 new value:17:35\n2014-09-05 04:55:15 new value:19:46\n2014-09-04 08:54:59 new value:19:48\n2014-09-03 02:54:30 new value:19:51\n2014-09-02 01:53:47 new value:19:53\n2014-09-01 00:53:07 new value:19:56\n2014-08-31 09:52:41 new value:19:58\n2014-08-30 08:52:08 new value:20:00\n2014-08-29 02:51:26 new value:20:03\n2014-08-28 01:50:55 new value:20:05\n2014-08-27 00:50:39 new value:20:08\n2014-08-26 04:50:25 new value:20:10\n2014-08-25 03:49:45 new value:20:12\n2014-08-24 22:49:37 new value:20:15\n2014-08-22 01:07:56 new value:20:19\n2014-08-21 00:07:40 new value:20:21\n2014-08-20 04:07:24 new value:20:24\n2014-08-19 03:07:07 new value:20:26\n2014-08-18 02:06:39 new value:20:28\n2014-08-17 01:06:15 new value:20:30\n2014-08-16 00:02:37 new value:20:32\n2014-08-15 04:01:08 new value:20:35\n2014-08-14 03:00:47 new value:20:37\n2014-08-13 02:00:13 new value:20:39\n2014-08-12 00:59:37 new value:20:41\n2014-08-11 04:59:08 new value:20:43\n2014-08-10 03:58:29 new value:20:45\n2014-08-09 02:57:53 new value:20:47\n2014-08-08 01:57:16 new value:20:49\n2014-08-07 00:56:40 new value:20:51\n2014-08-06 04:56:08 new value:20:53\n2014-08-05 03:55:34 new value:20:55\n2014-08-04 02:55:00 new value:20:57\n2014-08-03 01:54:22 new value:20:59\n2014-08-02 00:53:43 new value:21:01\n2014-08-01 02:09:41 new value:21:02\n2014-07-31 03:42:49 new value:21:04\n2014-07-30 02:42:13 new value:21:06\n2014-07-29 01:41:32 new value:21:08\n2014-07-28 00:40:55 new value:21:09\n2014-07-27 09:40:31 new value:21:11\n2014-07-27 04:40:26 incorrect value:\n2014-07-26 03:39:58 new value:21:13\n2014-07-25 02:02:30 new value:21:14\n2014-07-24 01:01:53 new value:21:16\n2014-07-23 15:01:41 new value:21:17\n2014-07-22 09:02:03 new value:21:19\n2014-07-21 13:01:45 new value:21:20\n','windows-1251',0,'','');
insert  into `webvars`(`ID`,`TITLE`,`HOSTNAME`,`TYPE`,`SEARCH_PATTERN`,`CHECK_PATTERN`,`LATEST_VALUE`,`CHECK_LATEST`,`CHECK_NEXT`,`SCRIPT_ID`,`ONLINE_INTERVAL`,`LINKED_OBJECT`,`LINKED_PROPERTY`,`CODE`,`LOG`,`ENCODING`,`AUTH`,`USERNAME`,`PASSWORD`) values (6,'Sunrise Time','http://pogoda.by/',0,'Восход: (\\d+:\\d+),','','08:54','2015-02-04 13:57:34','2015-02-04 18:57:34',0,18000,'ThisComputer','SunRiseTime','','2014-10-30 15:30:10 new value:08:10\n2014-10-30 14:57:24 new value:08:10\n2014-09-05 04:55:15 new value:06:29\n2014-09-04 08:54:59 new value:06:27\n2014-09-03 02:54:30 new value:06:25\n2014-09-02 01:53:47 new value:06:24\n2014-09-01 00:53:07 new value:06:22\n2014-08-31 09:52:41 new value:06:20\n2014-08-30 08:52:08 new value:06:18\n2014-08-29 02:51:26 new value:06:17\n2014-08-28 01:50:55 new value:06:15\n2014-08-27 00:50:39 new value:06:13\n2014-08-26 04:50:25 new value:06:11\n2014-08-25 03:49:45 new value:06:10\n2014-08-24 22:49:37 new value:06:08\n2014-08-22 01:07:56 new value:06:04\n2014-08-21 00:07:40 new value:06:03\n2014-08-20 04:07:24 new value:06:01\n2014-08-19 03:07:07 new value:05:59\n2014-08-18 02:06:39 new value:05:57\n2014-08-17 01:06:15 new value:05:56\n2014-08-16 00:02:37 new value:05:54\n2014-08-15 04:01:08 new value:05:52\n2014-08-14 03:00:47 new value:05:50\n2014-08-13 02:00:13 new value:05:49\n2014-08-12 00:59:37 new value:05:47\n2014-08-11 04:59:08 new value:05:45\n2014-08-10 03:58:29 new value:05:43\n2014-08-09 02:57:53 new value:05:42\n2014-08-08 01:57:16 new value:05:40\n2014-08-07 00:56:40 new value:05:38\n2014-08-06 04:56:08 new value:05:36\n2014-08-05 03:55:34 new value:05:35\n2014-08-04 02:55:00 new value:05:33\n2014-08-03 01:54:22 new value:05:31\n2014-08-02 00:53:44 new value:05:30\n2014-08-01 02:09:41 new value:05:28\n2014-07-31 03:42:49 new value:05:26\n2014-07-30 02:42:13 new value:05:25\n2014-07-29 01:41:32 new value:05:23\n2014-07-28 00:40:55 new value:05:21\n2014-07-27 09:40:31 new value:05:20\n2014-07-27 04:40:26 incorrect value:\n2014-07-26 03:39:58 new value:05:18\n2014-07-25 02:02:30 new value:05:17\n2014-07-24 01:01:54 new value:05:15\n2014-07-23 15:01:41 new value:05:14\n2014-07-22 04:02:50 new value:05:12\n2014-07-21 13:02:39 new value:05:11\n','windows-1251',0,'','');
insert  into `webvars`(`ID`,`TITLE`,`HOSTNAME`,`TYPE`,`SEARCH_PATTERN`,`CHECK_PATTERN`,`LATEST_VALUE`,`CHECK_LATEST`,`CHECK_NEXT`,`SCRIPT_ID`,`ONLINE_INTERVAL`,`LINKED_OBJECT`,`LINKED_PROPERTY`,`CODE`,`LOG`,`ENCODING`,`AUTH`,`USERNAME`,`PASSWORD`) values (7,'Weather Tomorrow','http://pogoda.tut.by/city/26850?pda=1',0,'город<\\/a><br>.+?Завтра.+?днем:(.+?), ночью','',' +0&deg;...-2&deg;, пасмурно','2015-02-04 13:57:34','2015-02-04 15:57:34',0,7200,'ThisComputer','weatherTomorrow','','2014-08-20 21:17:49 new value: +16&deg;...+18&deg;, пасмурно\n2014-08-20 09:17:11 new value: +16&deg;...+18&deg;, пасмурно, дождь, гроза\n2014-08-20 01:16:42 new value: +14&deg;...+16&deg;, облачно с прояснениями, дождь, гроза \n2014-08-19 09:16:02 new value: +21&deg;...+23&deg;, переменная облачность, дождь, гроза \n2014-08-19 01:15:39 new value: +22&deg;...+24&deg;, малооблачно\n2014-08-18 21:15:22 new value: +20&deg;...+22&deg;, переменная облачность, небольшой дождь\n2014-08-18 09:15:01 new value: +19&deg;...+21&deg;, переменная облачность, дождь, гроза \n2014-08-18 01:14:35 new value: +19&deg;...+21&deg;, переменная облачность, небольшой дождь\n2014-08-17 09:13:49 new value: +19&deg;...+21&deg;, переменная облачность\n2014-08-17 01:13:19 new value: +18&deg;...+20&deg;, переменная облачность\n2014-08-16 21:13:07 new value: +17&deg;...+19&deg;, переменная облачность, небольшой дождь\n2014-08-16 09:11:44 new value: +17&deg;...+19&deg;, облачно с прояснениями, небольшой дождь\n2014-08-16 01:11:13 new value: +17&deg;...+19&deg;, переменная облачность, небольшой дождь\n2014-08-15 09:08:57 new value: +20&deg;...+22&deg;, малооблачно, возможна гроза\n2014-08-15 01:07:29 new value: +19&deg;...+21&deg;, малооблачно, возможна гроза\n2014-08-14 21:07:25 new value: +21&deg;...+23&deg;, ясно\n2014-08-14 01:06:23 new value: +20&deg;...+22&deg;, переменная облачность\n2014-08-13 21:06:10 new value: +24&deg;...+26&deg;, переменная облачность, дождь, гроза \n2014-08-13 09:05:38 new value: +25&deg;...+27&deg;, переменная облачность, дождь, гроза \n2014-08-13 01:05:12 new value: +24&deg;...+26&deg;, переменная облачность, дождь, гроза \n2014-08-12 09:04:34 new value: +21&deg;...+23&deg;, малооблачно\n2014-08-12 01:04:12 new value: +19&deg;...+21&deg;, пасмурно\n2014-08-11 21:04:02 new value: +20&deg;...+22&deg;, облачно с прояснениями, дождь, гроза \n2014-08-11 09:03:32 new value: +22&deg;...+24&deg;, переменная облачность, дождь, гроза \n2014-08-11 01:03:10 new value: +21&deg;...+23&deg;, переменная облачность, дождь, гроза \n2014-08-10 09:02:28 new value: +27&deg;...+29&deg;, ясно\n2014-08-10 01:02:07 new value: +27&deg;...+29&deg;, малооблачно\n2014-08-08 21:00:55 new value: +24&deg;...+26&deg;, переменная облачность, небольшой дождь\n2014-08-08 09:00:24 new value: +25&deg;...+27&deg;, переменная облачность, дождь, гроза \n2014-08-08 01:00:04 new value: +27&deg;...+29&deg;, переменная облачность, дождь, гроза \n2014-08-07 20:59:54 new value: +27&deg;...+29&deg;, ясно\n2014-08-07 08:59:23 new value: +26&deg;...+28&deg;, переменная облачность, небольшой дождь\n2014-08-07 00:59:02 new value: +26&deg;...+28&deg;, малооблачно, возможна гроза\n2014-08-06 20:58:52 new value: +26&deg;...+28&deg;, переменная облачность, дождь, гроза \n2014-08-06 08:58:21 new value: +25&deg;...+27&deg;, переменная облачность, дождь, гроза \n2014-08-06 06:58:14 incorrect value:\n2014-08-06 00:57:59 new value: +26&deg;...+28&deg;, малооблачно, возможна гроза\n2014-08-05 20:57:50 new value: +27&deg;...+29&deg;, малооблачно, возможна гроза\n2014-08-05 08:57:22 new value: +26&deg;...+28&deg;, переменная облачность, дождь, гроза \n2014-08-05 00:57:00 new value: +25&deg;...+27&deg;, малооблачно, возможен дождь\n2014-08-04 00:56:02 new value: +27&deg;...+29&deg;, переменная облачность\n2014-08-03 20:55:51 new value: +30&deg;...+32&deg;, малооблачно\n2014-08-03 08:55:20 new value: +28&deg;...+30&deg;, переменная облачность, небольшой дождь\n2014-08-03 00:54:58 new value: +31&deg;...+33&deg;, ясно\n2014-08-02 20:54:47 new value: +32&deg;...+34&deg;, ясно\n2014-08-02 08:54:16 new value: +32&deg;...+34&deg;, малооблачно\n2014-08-02 00:53:54 new value: +33&deg;...+35&deg;, ясно\n2014-08-01 20:53:45 new value: +32&deg;...+34&deg;, переменная облачность\n2014-08-01 14:52:21 new value: +31&deg;...+33&deg;, ясно\n','',0,'','');
insert  into `webvars`(`ID`,`TITLE`,`HOSTNAME`,`TYPE`,`SEARCH_PATTERN`,`CHECK_PATTERN`,`LATEST_VALUE`,`CHECK_LATEST`,`CHECK_NEXT`,`SCRIPT_ID`,`ONLINE_INTERVAL`,`LINKED_OBJECT`,`LINKED_PROPERTY`,`CODE`,`LOG`,`ENCODING`,`AUTH`,`USERNAME`,`PASSWORD`) values (8,'Weather Today','http://pogoda.tut.by/city/26850?pda=1',0,'город<\\/a><br>.+?днем:(.+?), ночью','',' +0&deg;, пасмурно, снег','2015-02-04 13:57:34','2015-02-04 15:57:34',0,7200,'ThisComputer','weatherToday','','2014-08-19 21:16:31 new value: +22&deg;...+24&deg;, малооблачно\n2014-08-19 09:16:02 new value: +21&deg;...+23&deg;, переменная облачность\n2014-08-19 01:15:40 new value: +20&deg;...+22&deg;, переменная облачность, небольшой дождь\n2014-08-18 21:15:22 new value: +20&deg;...+22&deg;, переменная облачность\n2014-08-18 01:14:36 new value: +19&deg;...+21&deg;, переменная облачность\n2014-08-17 21:14:24 new value: +18&deg;...+20&deg;, переменная облачность\n2014-08-17 01:13:19 new value: +17&deg;...+19&deg;, переменная облачность, небольшой дождь\n2014-08-16 09:11:44 new value: +20&deg;...+22&deg;, переменная облачность, дождь, гроза \n2014-08-16 01:11:13 new value: +20&deg;...+22&deg;, малооблачно, возможна гроза\n2014-08-15 21:10:42 new value: +21&deg;...+23&deg;, малооблачно\n2014-08-15 09:08:57 new value: +20&deg;...+22&deg;, переменная облачность, небольшой дождь\n2014-08-15 01:07:29 new value: +21&deg;...+23&deg;, ясно\n2014-08-14 21:07:25 new value: +25&deg;...+27&deg;, переменная облачность\n2014-08-14 11:06:49 new value: +24&deg;...+26&deg;, переменная облачность, небольшой дождь\n2014-08-14 01:06:23 new value: +24&deg;...+26&deg;, переменная облачность, дождь, гроза \n2014-08-13 09:05:38 new value: +22&deg;...+24&deg;, переменная облачность\n2014-08-13 01:05:12 new value: +21&deg;...+23&deg;, малооблачно\n2014-08-12 21:05:02 new value: +19&deg;...+21&deg;, пасмурно, дождь, гроза\n2014-08-12 09:04:34 new value: +22&deg;...+24&deg;, пасмурно, дождь, гроза\n2014-08-12 01:04:12 new value: +20&deg;...+22&deg;, облачно с прояснениями, дождь, гроза \n2014-08-11 21:04:02 new value: +28&deg;...+30&deg;, ясно\n2014-08-11 01:03:10 new value: +27&deg;...+29&deg;, ясно\n2014-08-10 21:03:01 new value: +25&deg;...+27&deg;, переменная облачность\n2014-08-10 09:02:28 new value: +23&deg;...+25&deg;, малооблачно\n2014-08-10 01:02:07 new value: +24&deg;...+26&deg;, переменная облачность, небольшой дождь\n2014-08-09 21:01:57 new value: +23&deg;...+25&deg;, переменная облачность, небольшой дождь\n2014-08-09 09:01:27 new value: +24&deg;...+26&deg;, переменная облачность\n2014-08-09 01:01:06 new value: +24&deg;...+26&deg;, переменная облачность, небольшой дождь\n2014-08-08 21:00:55 new value: +28&deg;...+30&deg;, малооблачно\n2014-08-08 09:00:24 new value: +26&deg;...+28&deg;, малооблачно, возможна гроза\n2014-08-07 08:59:23 new value: +27&deg;...+29&deg;, ясно\n2014-08-07 00:59:02 new value: +26&deg;...+28&deg;, переменная облачность, дождь, гроза \n2014-08-06 20:58:52 new value: +28&deg;...+30&deg;, малооблачно\n2014-08-06 08:58:21 new value: +26&deg;...+28&deg;, переменная облачность, дождь, гроза \n2014-08-06 06:58:14 incorrect value:\n2014-08-06 00:57:59 new value: +27&deg;...+29&deg;, малооблачно, возможна гроза\n2014-08-05 20:57:50 new value: +30&deg;...+32&deg;, ясно\n2014-08-05 08:57:22 new value: +28&deg;...+30&deg;, малооблачно\n2014-08-05 00:57:00 new value: +27&deg;...+29&deg;, переменная облачность\n2014-08-04 20:56:50 new value: +32&deg;...+34&deg;, ясно\n2014-08-04 08:56:21 new value: +31&deg;...+33&deg;, ясно\n2014-08-04 00:56:02 new value: +30&deg;...+32&deg;, малооблачно\n2014-08-03 20:55:51 new value: +33&deg;...+35&deg;, ясно\n2014-08-03 00:54:58 new value: +32&deg;...+34&deg;, ясно\n2014-08-02 20:54:48 new value: +32&deg;...+34&deg;, малооблачно\n2014-08-02 08:54:16 new value: +31&deg;...+33&deg;, малооблачно\n2014-08-02 00:53:54 new value: +32&deg;...+34&deg;, переменная облачность\n2014-08-01 14:53:27 new value: +31&deg;...+33&deg;, переменная облачность\n2014-08-01 14:53:16 new value: +31&deg;...+33&deg;, переменная облачность\n','',0,'','');

/*Table structure for table `zwave_devices` */

DROP TABLE IF EXISTS `zwave_devices`;

CREATE TABLE `zwave_devices` (
  `ID` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `TITLE` varchar(255) NOT NULL DEFAULT '',
  `NODE_ID` varchar(50) NOT NULL DEFAULT '',
  `INSTANCE_ID` varchar(50) NOT NULL DEFAULT '',
  `BASIC` varchar(50) NOT NULL DEFAULT '',
  `LEVEL` varchar(50) NOT NULL DEFAULT '',
  `BATTERY_LEVEL` varchar(50) NOT NULL DEFAULT '',
  `SENSOR_VALUE` varchar(255) NOT NULL DEFAULT '',
  `MODE_VALUE` varchar(255) NOT NULL DEFAULT '',
  `DEVICE_TYPE` varchar(50) NOT NULL DEFAULT '',
  `STATUS` int(3) NOT NULL DEFAULT '0',
  `AUTO_POLL` int(3) NOT NULL DEFAULT '0',
  `LATEST_UPDATE` datetime DEFAULT NULL,
  `LOCATION_ID` int(10) NOT NULL DEFAULT '0',
  `CLASS_BASIC` int(3) NOT NULL DEFAULT '0',
  `CLASS_SENSOR_BINARY` int(3) NOT NULL DEFAULT '0',
  `CLASS_SENSOR_MULTILEVEL` int(3) NOT NULL DEFAULT '0',
  `CLASS_SWITCH_BINARY` int(3) NOT NULL DEFAULT '0',
  `CLASS_SWITCH_MULTILEVEL` int(3) NOT NULL DEFAULT '0',
  `CLASS_METER` int(3) NOT NULL DEFAULT '0',
  `CLASS_BATTERY` int(3) NOT NULL DEFAULT '0',
  `CLASS_THERMOSTAT` int(3) NOT NULL DEFAULT '0',
  `ALL_CLASSES` varchar(255) NOT NULL DEFAULT '',
  `CLASS_SENSOR_ALARM` int(3) NOT NULL DEFAULT '0',
  `CLASS_SCENE_CONTROLLER` int(3) NOT NULL DEFAULT '0',
  `CLASS_CONFIG` int(3) NOT NULL DEFAULT '0',
  `BRAND` varchar(255) NOT NULL DEFAULT '',
  `PRODUCT` varchar(255) NOT NULL DEFAULT '',
  `XMLFILE` varchar(255) NOT NULL DEFAULT '',
  `RAW_DATA` text NOT NULL,
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

/*Data for the table `zwave_devices` */

/*Table structure for table `zwave_properties` */

DROP TABLE IF EXISTS `zwave_properties`;

CREATE TABLE `zwave_properties` (
  `ID` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `DEVICE_ID` int(10) NOT NULL DEFAULT '0',
  `UNIQ_ID` varchar(100) NOT NULL DEFAULT '',
  `TITLE` varchar(255) NOT NULL DEFAULT '',
  `VALUE` varchar(255) NOT NULL DEFAULT '',
  `VALUE_TYPE` varchar(255) NOT NULL DEFAULT '',
  `READ_ONLY` int(3) NOT NULL DEFAULT '0',
  `LINKED_OBJECT` varchar(255) NOT NULL DEFAULT '',
  `LINKED_PROPERTY` varchar(255) NOT NULL DEFAULT '',
  `UPDATED` datetime DEFAULT NULL,
  `COMMENTS` varchar(255) NOT NULL DEFAULT '',
  `UPDATE_PERIOD` int(10) NOT NULL DEFAULT '0',
  `VALIDATE` int(3) NOT NULL DEFAULT '0',
  `VALID_FROM` varchar(10) NOT NULL DEFAULT '',
  `VALID_TO` varchar(10) NOT NULL DEFAULT '',
  `CORRECT_VALUE` varchar(10) NOT NULL DEFAULT '',
  `COMMAND_CLASS` varchar(10) NOT NULL DEFAULT '',
  `NEXT_UPDATE` datetime DEFAULT NULL,
  `LINKED_METHOD` varchar(255) NOT NULL DEFAULT '',
  PRIMARY KEY (`ID`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

/*Data for the table `zwave_properties` */

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
